[Killed] ConditionalExpression
components/molecules/alert/Alert.tsx:36:7
     autoCloseDelay,
   });
 
-  if (!isMounted) return null;
+  if (false) return null;
 
   const alertTitle = getAlertTitle(mode, title);
killedBy: Alert should render nothing when not opened
statusReason: expected <p class="cl-alert__message"></p> to be null

[Killed] LogicalOperator
components/molecules/alert/Alert.tsx:66:12
             </Header>
           </header>
           <p className="cl-alert__message">{message}</p>
-          {autoClose && <AlertProgressBar remainingPercentage={remainingPercentage} />}
+          {autoClose || <AlertProgressBar remainingPercentage={remainingPercentage} />}
         </div>
       </div>
killedBy: Alert should not render progress bar when autoClose is false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <progress
  class="cl-alert__progress-bar"
  max="100"
  style="width: 100%;"
  value="66.13333333333333"
/> instead
