[Killed] CallExpression
components/molecules/multi-select/MultiSelect.controller.ts:46:5
   const handleSelect = (id: string) => {
     const newValues = getMultiSelectUpdatedValues(values, id);
 
-    setValues(newValues);
+    ;
     onChange?.(newValues);
     onChangeFormInput?.({ name, value: getMultiSelectFormValues(newValues) });
killedBy: useMultiSelectController handles handleSelect without onChangeFormInput
statusReason: expected [ { id: '1', …(2) }, …(2) ] to deeply equal [ { id: '1', …(2) }, …(2) ]

[NoCoverage] CallExpression
components/molecules/multi-select/MultiSelect.controller.ts:53:5
 
   const handleReset = useCallback(() => {
     setOpened(false);
-    setValues(initialOptionsRef.current);
+    ;
     onChangeFormInputRef.current?.({
       name,

[Survived] CallExpression
components/molecules/multi-select/MultiSelect.controller.ts:60:3
     });
   }, [name]);
 
-  useResetFormInput(handleReset);
+  ;
 
   return {
