[Killed] CallExpression
components/molecules/select/Select.controller.ts:36:5
 
   const handleSelect = (id: string) => {
     const newValue = options.find((item) => item.id === id);
-    setSelected(newValue);
+    ;
     onChange?.(newValue);
     onChangeFormInput?.({ name, value: newValue?.id });
killedBy: Select should allow the user to select an option
statusReason: expect(element).toHaveValue(b4b08a09-e287-400b-ba65-afd6ae1f6fd7)

Expected the element to have value:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7
Received:

[Killed] CallExpression
components/molecules/select/Select.controller.ts:42:5
   };
 
   const handleClear = () => {
-    setSelected(undefined);
+    ;
     onChange?.(undefined);
   };
killedBy: Select should allow the user to deselect the same option
statusReason: expect(element).not.toHaveValue(b4b08a09-e287-400b-ba65-afd6ae1f6fd7)

Expected the element not to have value:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7
Received:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7

[NoCoverage] CallExpression
components/molecules/select/Select.controller.ts:48:5
 
   const handleReset = useCallback(() => {
     setOpened(false);
-    setSelected(initialValueRef.current);
+    ;
     onChangeFormInputRef.current?.({ name, value: initialValueRef.current?.id });
   }, [name]);
