[Killed] CallExpression
components/molecules/switch/Switch.controller.ts:30:7
 
   const handleChange = useCallback(
     (checked: boolean) => {
-      setIsChecked(checked);
+      ;
       onChangeRef.current?.(checked);
       onChangeFormInputRef.current?.({ name, value: checked });
killedBy: Switch handles Space key for toggling
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received:

  1st vi.fn() call:

  [
-   false,

[Killed] CallExpression
components/molecules/switch/Switch.controller.ts:40:9
   const handleKeyDown = useCallback(
     (event: KeyboardEvent<HTMLDivElement>) => {
       if (event.key === ' ' || event.key === 'Enter') {
-        event.preventDefault();
+        ;
         handleChange(!isChecked);
       }
killedBy: useSwitchController toggles state on handleKeyDown with Space key
statusReason: expected "vi.fn()" to be called at least once

[NoCoverage] CallExpression
components/molecules/switch/Switch.controller.ts:48:5
   );
 
   const handleReset = useCallback(() => {
-    setIsChecked(initialValueRef.current);
+    ;
     onChangeFormInputRef.current?.({ name, value: initialValueRef.current });
   }, [name]);
