[Killed] CallExpression
components/molecules/text-input/TextInput.controller.ts:46:5
     const value = event.target.value;
     const valid = validateTextInputValue({ value, required, validator });
 
-    setValue(value);
+    ;
     setValid(valid);
     onChangeFormInput?.({ name, value, valid });
killedBy: TextInput should display the entered text
statusReason: expect(element).toHaveValue(test)

Expected the element to have value:
  test
Received:

[Killed] CallExpression
components/molecules/text-input/TextInput.controller.ts:47:5
     const valid = validateTextInputValue({ value, required, validator });
 
     setValue(value);
-    setValid(valid);
+    ;
     onChangeFormInput?.({ name, value, valid });
     onChange?.(event);
killedBy: TextInput should show an error message if the input value is invalid
statusReason: expect(element).toHaveAttribute("aria-hidden", "false") // element.getAttribute("aria-hidden") === "false"

Expected the element to have attribute:
  aria-hidden="false"
Received:
  aria-hidden="true"

[Killed] CallExpression
components/molecules/text-input/TextInput.controller.ts:53:5
   };
 
   const handleClear = () => {
-    setValue('');
+    ;
     setValid(true);
     onChangeFormInput?.({ name, value: '', valid: true });
killedBy: TextInput should allow to clear the entered text via Clear button
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  t

[Killed] CallExpression
components/molecules/text-input/TextInput.controller.ts:60:5
   };
 
   const handleReset = useCallback(() => {
-    setValue(initialValueRef.current);
+    ;
     setValid(true);
     onChangeFormInputRef.current?.({ name, value: initialValueRef.current, valid: true });
killedBy: Form controlled flow (onSubmit) should reset form after successful submit when resetOnSuccess is true
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Alice

Ignored nodes: comments, script, style
