[Killed] CallExpression
components/organisms/grid/Grid.controller.ts:21:5
   const isAllCheckboxDisabled = data.some((item) => item?.disabled);
 
   const handleSelect = (ids: string[]) => {
-    setSelectedIds(ids);
+    ;
     onSelect?.(ids);
   };
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [] ]

Received:

  1st vi.fn() call:

  [
-   [],

[Killed] CallExpression
components/organisms/grid/Grid.controller.ts:26:5
   };
 
   const handleSelectAll = () => {
-    handleSelect(allIds);
+    ;
   };
 
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'row1', 'row2', 'row3', …(3) ] ]

Number of calls: 0

[Killed] CallExpression
components/organisms/grid/Grid.controller.ts:35:5
 
   const handleSelectRowById = (id: string) => {
     const newIds = [...selectedIds, id];
-    handleSelect(newIds);
+    ;
   };
 
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'row1' ] ]

Received:

  1st vi.fn() call:

  [
    [

[NoCoverage] CallExpression
components/organisms/grid/Grid.controller.ts:40:5
 
   const handleDeselectRowById = (id: string) => {
     const newIds = selectedIds.filter((item) => item !== id);
-    handleSelect(newIds);
+    ;
   };
   return {
