[Killed] CallExpression
src/hooks/use-auto-close/use-auto-close.ts:18:7
     if (!isOpened || !autoClose) return;
 
     const timer = setTimeout(() => {
-      onClose();
+      ;
     }, autoCloseDelay);
 
killedBy: useAutoClose hook should call onClose after default delay (3000ms)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
