[Killed] BlockStatement
src/hooks/use-form-loading/use-form-loading.ts:4:68
 import { FormContext } from '@components/contexts';
 import { useContext } from 'react';
 
-export const useFormLoading = (explicitProp?: boolean): boolean => {
-  const { isLoading: contextLoading } = useContext(FormContext);
-
-  if (explicitProp !== undefined) {
-    return explicitProp;
-  }
-
-  return contextLoading ?? false;
-};
+export const useFormLoading = (explicitProp?: boolean): boolean => {};
 
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] ConditionalExpression
src/hooks/use-form-loading/use-form-loading.ts:7:7
 export const useFormLoading = (explicitProp?: boolean): boolean => {
   const { isLoading: contextLoading } = useContext(FormContext);
 
-  if (explicitProp !== undefined) {
+  if (false) {
     return explicitProp;
   }
killedBy: MultiSelect loading state should have aria-busy="true" on the wrapper when isLoading is true
statusReason: expect(element).toHaveAttribute("aria-busy", "true") // element.getAttribute("aria-busy") === "true"

Expected the element to have attribute:
  aria-busy="true"
Received:
  aria-busy="false"

[Killed] BlockStatement
src/hooks/use-form-loading/use-form-loading.ts:7:35
 export const useFormLoading = (explicitProp?: boolean): boolean => {
   const { isLoading: contextLoading } = useContext(FormContext);
 
-  if (explicitProp !== undefined) {
-    return explicitProp;
-  }
+  if (explicitProp !== undefined) {}
 
   return contextLoading ?? false;
killedBy: MultiSelect loading state should have aria-busy="true" on the wrapper when isLoading is true
statusReason: expect(element).toHaveAttribute("aria-busy", "true") // element.getAttribute("aria-busy") === "true"

Expected the element to have attribute:
  aria-busy="true"
Received:
  aria-busy="false"

[Killed] LogicalOperator
src/hooks/use-form-loading/use-form-loading.ts:11:10
     return explicitProp;
   }
 
-  return contextLoading ?? false;
+  return contextLoading && false;
 };
 
killedBy: Form loading state propagation should propagate loading state to nested TextInput components
statusReason: expect(element).toHaveClass("cl-text-input_loading")

Expected the element to have class:
  cl-text-input_loading
Received:
  cl-text-input

Ignored nodes: comments, script, style

[NoCoverage] BooleanLiteral
src/hooks/use-form-loading/use-form-loading.ts:11:28
     return explicitProp;
   }
 
-  return contextLoading ?? false;
+  return contextLoading ?? true;
 };
 
