[Killed] BlockStatement
components/atoms/button/getButtonLoadingProps.ts:28:48
   isLoading,
   icon,
   onClick,
-}: ButtonLoadingParams): ButtonLoadingProps => {
-  const buttonClass = getClassName([baseClass, className, { 'cl-button_loading': isLoading }]);
-  const iconClass = getClassName([iconBaseClass, { 'cl-button__icon_spinning': isLoading }]);
-  const displayIcon = icon ? (isLoading ? IconName.Loader : icon) : undefined;
-
-  const handleClick = (e: MouseEvent<HTMLButtonElement>) => {
-    if (isLoading) {
-      e.preventDefault();
-      return;
-    }
-    onClick?.(e);
-  };
-
-  return { buttonClass, iconClass, displayIcon, handleClick };
-};
+}: ButtonLoadingParams): ButtonLoadingProps => {};
 
killedBy: FullscreenViewer rendering renders dialog when isOpen is true
statusReason: Cannot destructure property 'buttonClass' of 'getButtonLoadingProps(...)' as it is undefined.

[Killed] BlockStatement
components/atoms/button/getButtonLoadingProps.ts:33:61
   const iconClass = getClassName([iconBaseClass, { 'cl-button__icon_spinning': isLoading }]);
   const displayIcon = icon ? (isLoading ? IconName.Loader : icon) : undefined;
 
-  const handleClick = (e: MouseEvent<HTMLButtonElement>) => {
-    if (isLoading) {
-      e.preventDefault();
-      return;
-    }
-    onClick?.(e);
-  };
+  const handleClick = (e: MouseEvent<HTMLButtonElement>) => {};
 
   return { buttonClass, iconClass, displayIcon, handleClick };
killedBy: Button passes onClick handler to the button
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/atoms/button/getButtonLoadingProps.ts:34:9
   const displayIcon = icon ? (isLoading ? IconName.Loader : icon) : undefined;
 
   const handleClick = (e: MouseEvent<HTMLButtonElement>) => {
-    if (isLoading) {
+    if (true) {
       e.preventDefault();
       return;
killedBy: Button passes onClick handler to the button
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
components/atoms/button/getButtonLoadingProps.ts:34:20
   const displayIcon = icon ? (isLoading ? IconName.Loader : icon) : undefined;
 
   const handleClick = (e: MouseEvent<HTMLButtonElement>) => {
-    if (isLoading) {
-      e.preventDefault();
-      return;
-    }
+    if (isLoading) {}
     onClick?.(e);
   };
killedBy: Button loading state should not call onClick when isLoading is true
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      SyntheticBaseEvent {

[Killed] CallExpression
components/atoms/button/getButtonLoadingProps.ts:35:7
 
   const handleClick = (e: MouseEvent<HTMLButtonElement>) => {
     if (isLoading) {
-      e.preventDefault();
+      ;
       return;
     }
killedBy: getButtonLoadingProps handleClick should prevent default and not call onClick when loading
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] OptionalChaining
components/atoms/button/getButtonLoadingProps.ts:38:5
       e.preventDefault();
       return;
     }
-    onClick?.(e);
+    onClick(e);
   };
 
killedBy: getButtonLoadingProps handleClick should not throw when onClick is not provided
statusReason: expected [Function] to not throw an error but 'TypeError: onClick is not a function' was thrown
