[Killed] CallExpression
components/atoms/editable-text/useValueState.ts:7:5
   const [internalValue, setInternalValue] = useState(value);
 
   useEffect(() => {
-    setInternalValue(value);
+    ;
   }, [value]);
 
killedBy: useValueState should sync internal value when prop value changes
statusReason: expected 'initial' to be 'updated' // Object.is equality

[Killed] CallExpression
components/atoms/editable-text/useValueState.ts:11:5
   }, [value]);
 
   const updateValue = (newValue: string) => {
-    setInternalValue(newValue);
+    ;
   };
 
killedBy: useValueState should update internal value
statusReason: expected 'initial' to be 'new value' // Object.is equality

[Killed] CallExpression
components/atoms/editable-text/useValueState.ts:21:5
   };
 
   const resetValue = () => {
-    setInternalValue(value);
+    ;
   };
 
killedBy: useValueState should reset to original value
statusReason: expected 'modified' to be 'initial' // Object.is equality
