[Survived] CallExpression
components/atoms/tooltip/Tooltip.controller.ts:27:5
   const openTooltip = () => setIsOpened(true);
   const toggleTooltip = () => setIsOpened(!isOpened);
   const handleContextMenu = (e: MouseEvent) => {
-    e.preventDefault();
+    ;
     toggleTooltip();
   };

[Killed] CallExpression
components/atoms/tooltip/Tooltip.controller.ts:28:5
   const toggleTooltip = () => setIsOpened(!isOpened);
   const handleContextMenu = (e: MouseEvent) => {
     e.preventDefault();
-    toggleTooltip();
+    ;
   };
 
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      style="position: relative; cursor: pointer; line-height: 0;"
      tabindex="-1"

[Killed] CallExpression
components/atoms/tooltip/Tooltip.controller.ts:31:3
     toggleTooltip();
   };
 
-  useKeyPress({ keyCode: 'Escape', ref: tooltipRef, onKeyPress: closeTooltip });
+  ;
   useClickOutside({
     ref: tooltipRef,
killedBy: Tooltip should close tooltip on Escape key press
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] CallExpression
components/atoms/tooltip/Tooltip.controller.ts:32:3
   };
 
   useKeyPress({ keyCode: 'Escape', ref: tooltipRef, onKeyPress: closeTooltip });
-  useClickOutside({
-    ref: tooltipRef,
-    onClickOutsideHandler: closeTooltip,
-    dependentRef: wrapperRef,
-  });
+  ;
   useAutoClose({
     isOpened,
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Survived] CallExpression
components/atoms/tooltip/Tooltip.controller.ts:37:3
     onClickOutsideHandler: closeTooltip,
     dependentRef: wrapperRef,
   });
-  useAutoClose({
-    isOpened,
-    onClose: closeTooltip,
-    autoClose,
-    autoCloseDelay,
-  });
+  ;
 
   return {
