[Killed] CallExpression
components/molecules/checkbox/Checkbox.controller.ts:35:5
 
   const handleChange = (e: ChangeEvent<HTMLInputElement>) => {
     const checked = e.target.checked;
-    setIsChecked(checked);
+    ;
     onChange?.(e);
     onChangeFormInput?.({ name, value: checked });
killedBy: Form shared behavior should accept custom values in inputs
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  id="_r_7_"
  name="accepted"
  type="checkbox"
/>
