[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:13:24
   options: SelectValue[];
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
-}): MultiSelectValue[] {
-  return options.map((option) => {
-    let selected = false;
-
-    if (initialValues?.[name] && Array.isArray(initialValues[name])) {
-      selected = initialValues[name].some((item) => item === option.id || item?.id === option.id);
-    }
-
-    if (!initialValues?.[name] && Array.isArray(defaultValue)) {
-      selected = defaultValue.includes(option.id);
-    }
-
-    return { ...option, selected };
-  });
-}
+}): MultiSelectValue[] {}
 
 export const getMultiSelectFormValues = (options: MultiSelectValue[]): string[] => {
killedBy: MultiSelect should render correctly
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:14:34
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
 }): MultiSelectValue[] {
-  return options.map((option) => {
-    let selected = false;
-
-    if (initialValues?.[name] && Array.isArray(initialValues[name])) {
-      selected = initialValues[name].some((item) => item === option.id || item?.id === option.id);
-    }
-
-    if (!initialValues?.[name] && Array.isArray(defaultValue)) {
-      selected = defaultValue.includes(option.id);
-    }
-
-    return { ...option, selected };
-  });
+  return options.map((option) => {});
 }
 
killedBy: MultiSelect should render correctly
statusReason: Cannot read properties of undefined (reading 'selected')

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:17:70
   return options.map((option) => {
     let selected = false;
 
-    if (initialValues?.[name] && Array.isArray(initialValues[name])) {
-      selected = initialValues[name].some((item) => item === option.id || item?.id === option.id);
-    }
+    if (initialValues?.[name] && Array.isArray(initialValues[name])) {}
 
     if (!initialValues?.[name] && Array.isArray(defaultValue)) {
killedBy: MultiSelect should take an initial value from the form context
statusReason: expect(element).toHaveValue(b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91)

Expected the element to have value:
  b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91
Received:

[Killed] EqualityOperator
components/molecules/multi-select/MultiSelect.helpers.ts:18:75
     let selected = false;
 
     if (initialValues?.[name] && Array.isArray(initialValues[name])) {
-      selected = initialValues[name].some((item) => item === option.id || item?.id === option.id);
+      selected = initialValues[name].some((item) => item === option.id || item?.id !== option.id);
     }
 
killedBy: getMultiSelectSelectValues should return MultiSelectValue[] with selected true for options in initialValues
statusReason: expected [ { id: '1', …(2) }, …(2) ] to deeply equal [ { id: '1', …(2) }, …(2) ]

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelect.helpers.ts:18:53
     let selected = false;
 
     if (initialValues?.[name] && Array.isArray(initialValues[name])) {
-      selected = initialValues[name].some((item) => item === option.id || item?.id === option.id);
+      selected = initialValues[name].some((item) => true);
     }
 
killedBy: MultiSelect should take an initial value from the form context
statusReason: expect(element).toHaveValue(b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91)

Expected the element to have value:
  b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91
Received:
  57b5a856-bc4b-4c2f-8295-9f44434fafc7,583e8b60-0177-4e38-a423-4b1d5d0a2236,b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91

[Killed] LogicalOperator
components/molecules/multi-select/MultiSelect.helpers.ts:21:9
       selected = initialValues[name].some((item) => item === option.id || item?.id === option.id);
     }
 
-    if (!initialValues?.[name] && Array.isArray(defaultValue)) {
+    if (!initialValues?.[name] || Array.isArray(defaultValue)) {
       selected = defaultValue.includes(option.id);
     }
killedBy: getMultiSelectSelectValues should prioritize initialValues over defaultValue
statusReason: expected [ { id: '1', …(2) }, …(2) ] to deeply equal [ { id: '1', …(2) }, …(2) ]

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:36:26
 export const getMultiSelectUpdatedValues = (
   options: MultiSelectValue[],
   id: string,
-): MultiSelectValue[] => {
-  const targetSelected = options.some((item) => item.id === id && item.selected);
-  return options.map((item) => {
-    return item.id === id ? { ...item, selected: !targetSelected } : item;
-  });
-};
+): MultiSelectValue[] => {};
 
killedBy: MultiSelect should call onSelectChange handler
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] EqualityOperator
components/molecules/multi-select/MultiSelect.helpers.ts:37:49
   options: MultiSelectValue[],
   id: string,
 ): MultiSelectValue[] => {
-  const targetSelected = options.some((item) => item.id === id && item.selected);
+  const targetSelected = options.some((item) => item.id !== id && item.selected);
   return options.map((item) => {
     return item.id === id ? { ...item, selected: !targetSelected } : item;
killedBy: MultiSelect should allow the user to deselect an option
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  583e8b60-0177-4e38-a423-4b1d5d0a2236

[Killed] LogicalOperator
components/molecules/multi-select/MultiSelect.helpers.ts:37:49
   options: MultiSelectValue[],
   id: string,
 ): MultiSelectValue[] => {
-  const targetSelected = options.some((item) => item.id === id && item.selected);
+  const targetSelected = options.some((item) => item.id === id || item.selected);
   return options.map((item) => {
     return item.id === id ? { ...item, selected: !targetSelected } : item;
killedBy: MultiSelect should allow the user to select an option
statusReason: expect(element).toHaveValue(583e8b60-0177-4e38-a423-4b1d5d0a2236)

Expected the element to have value:
  583e8b60-0177-4e38-a423-4b1d5d0a2236
Received:

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:38:32
   id: string,
 ): MultiSelectValue[] => {
   const targetSelected = options.some((item) => item.id === id && item.selected);
-  return options.map((item) => {
-    return item.id === id ? { ...item, selected: !targetSelected } : item;
-  });
+  return options.map((item) => {});
 };
 
killedBy: MultiSelect should call onSelectChange handler
statusReason: Cannot read properties of undefined (reading 'selected')

[Killed] EqualityOperator
components/molecules/multi-select/MultiSelect.helpers.ts:39:12
 ): MultiSelectValue[] => {
   const targetSelected = options.some((item) => item.id === id && item.selected);
   return options.map((item) => {
-    return item.id === id ? { ...item, selected: !targetSelected } : item;
+    return item.id !== id ? { ...item, selected: !targetSelected } : item;
   });
 };
killedBy: MultiSelect should allow the user to select an option
statusReason: expect(element).toHaveValue(583e8b60-0177-4e38-a423-4b1d5d0a2236)

Expected the element to have value:
  583e8b60-0177-4e38-a423-4b1d5d0a2236
Received:
  57b5a856-bc4b-4c2f-8295-9f44434fafc7,b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelect.helpers.ts:39:12
 ): MultiSelectValue[] => {
   const targetSelected = options.some((item) => item.id === id && item.selected);
   return options.map((item) => {
-    return item.id === id ? { ...item, selected: !targetSelected } : item;
+    return false ? { ...item, selected: !targetSelected } : item;
   });
 };
killedBy: MultiSelect should allow the user to select an option
statusReason: expect(element).toHaveValue(583e8b60-0177-4e38-a423-4b1d5d0a2236)

Expected the element to have value:
  583e8b60-0177-4e38-a423-4b1d5d0a2236
Received:
