[Killed] CallExpression
components/molecules/numeric-input/NumericInput.controller.ts:52:5
   initialValueRef.current = initialValue;
 
   const updateValue = (value: number) => {
-    setValue(value);
+    ;
     const valid = validateNumericInputValue({ value, required, validator, maxValue, minValue });
     setValid(valid);
killedBy: NumericInput updates value when typing
statusReason: expect(element).toHaveValue(10)

Expected the element to have value:
  10
Received:
  0

[Killed] CallExpression
components/molecules/numeric-input/NumericInput.controller.ts:54:5
   const updateValue = (value: number) => {
     setValue(value);
     const valid = validateNumericInputValue({ value, required, validator, maxValue, minValue });
-    setValid(valid);
+    ;
     onChangeFormInput?.({ name, value, valid });
   };
killedBy: NumericInput should show an error message if the input value is invalid
statusReason: expect(element).toHaveAttribute("aria-hidden", "false") // element.getAttribute("aria-hidden") === "false"

Expected the element to have attribute:
  aria-hidden="false"
Received:
  aria-hidden="true"

[Killed] CallExpression
components/molecules/numeric-input/NumericInput.controller.ts:60:5
 
   const handleChange = (event: ChangeEvent<HTMLInputElement>) => {
     const value = Number(event.target.value);
-    updateValue(value);
+    ;
     onChange?.(event);
   };
killedBy: NumericInput updates value when typing
statusReason: expect(element).toHaveValue(10)

Expected the element to have value:
  10
Received:
  0
