[Killed] CallExpression
components/molecules/search/Search.controller.ts:59:5
 
   const handleChange = useCallback((event: React.ChangeEvent<HTMLInputElement>) => {
     const value = event.target.value;
-    setSearchValue(value);
+    ;
   }, []);
 
killedBy: Search calls onSearch automatically when typing in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test query' ]

Number of calls: 0

[Killed] CallExpression
components/molecules/search/Search.controller.ts:63:5
   }, []);
 
   const handleClear = useCallback(() => {
-    setSearchValue('');
+    ;
     onClear?.();
   }, [onClear]);
killedBy: Search calls onClear on Escape key press
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  test

[Killed] CallExpression
components/molecules/search/Search.controller.ts:75:9
     (event: React.KeyboardEvent<HTMLInputElement>) => {
       if (event.key === 'Enter') {
         // Trigger immediate search on Enter
-        event.preventDefault();
+        ;
         if (onSearchRef.current) {
           onSearchRef.current(searchValue);
killedBy: useSearchController handleKeyDown should trigger search on Enter key press
statusReason: expected "vi.fn()" to be called at least once

[Killed] CallExpression
components/molecules/search/Search.controller.ts:77:11
         // Trigger immediate search on Enter
         event.preventDefault();
         if (onSearchRef.current) {
-          onSearchRef.current(searchValue);
+          ;
         }
       } else if (event.key === 'Escape') {
killedBy: useSearchController handleKeyDown should trigger search on Enter key press
statusReason: expected "vi.fn()" to be called with arguments: [ 'test' ]

Number of calls: 0

[Killed] CallExpression
components/molecules/search/Search.controller.ts:81:9
         }
       } else if (event.key === 'Escape') {
         // Clear on Escape
-        event.preventDefault();
+        ;
         handleClear();
       }
killedBy: useSearchController handleKeyDown should clear search on Escape key press
statusReason: expected "vi.fn()" to be called at least once

[Killed] CallExpression
components/molecules/search/Search.controller.ts:82:9
       } else if (event.key === 'Escape') {
         // Clear on Escape
         event.preventDefault();
-        handleClear();
+        ;
       }
     },
killedBy: useSearchController handleKeyDown should clear search on Escape key press
statusReason: expected 'test' to be '' // Object.is equality
