[Killed] CallExpression
components/organisms/form/Form.controller.ts:51:5
 
   const handleInputChange = (params: FormInputParams) => {
     const newData = { ...formData, [params.name]: params.value };
-    setFormData(newData);
+    ;
     setValidationState(updateValidationState(validationState, params));
   };
killedBy: useFormController controlled flow edge cases should merge uncontrolled form data with controlled formData on submit
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] CallExpression
components/organisms/form/Form.controller.ts:52:5
   const handleInputChange = (params: FormInputParams) => {
     const newData = { ...formData, [params.name]: params.value };
     setFormData(newData);
-    setValidationState(updateValidationState(validationState, params));
+    ;
   };
 
killedBy: useFormController controlled flow (onSubmit) should track validation state via handleInputChange
statusReason: expected true to be false // Object.is equality

[Survived] CallExpression
components/organisms/form/Form.controller.ts:56:5
   };
 
   const triggerReset = useCallback(() => {
-    setFormData(initialValues);
+    ;
     setResetSignal((prev) => prev + 1);
     setValidationState(getInitialValidationState(initialValues));

[Killed] CallExpression
components/organisms/form/Form.controller.ts:58:5
   const triggerReset = useCallback(() => {
     setFormData(initialValues);
     setResetSignal((prev) => prev + 1);
-    setValidationState(getInitialValidationState(initialValues));
+    ;
   }, [initialValues]);
 
killedBy: useFormController handleReset should reset validation state to initial on manual reset
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
components/organisms/form/Form.controller.ts:63:5
 
   const handleReset = (event: SubmitEvent<HTMLFormElement>) => {
     onReset?.(event);
-    triggerReset();
+    ;
   };
 
killedBy: Form shared behavior should reset entered values to initial values on manual reset
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Killed] CallExpression
components/organisms/form/Form.controller.ts:74:27
       if (!action) return prevState;
       const result = await action(prevState as TActionState, formData);
       onActionComplete?.(result);
-      if (resetOnSuccess) triggerReset();
+      if (resetOnSuccess) ;
       return result as Awaited<TActionState>;
     },
killedBy: useFormController action flow should trigger reset after successful action when resetOnSuccess is true
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] CallExpression
components/organisms/form/Form.controller.ts:82:5
 
   // Controlled flow
   const handleSubmit = async (event: SubmitEvent<HTMLFormElement>) => {
-    event.preventDefault();
+    ;
     if (!valid || !onSubmit) return;
 
killedBy: useFormController controlled flow edge cases should not call onSubmit when onSubmit is not provided
statusReason: expected "vi.fn()" to be called at least once

[Killed] CallExpression
components/organisms/form/Form.controller.ts:91:27
     setControlledPending(true);
     try {
       await onSubmit(resultData);
-      if (resetOnSuccess) triggerReset();
+      if (resetOnSuccess) ;
     } finally {
       setControlledPending(false);
killedBy: useFormController controlled flow (onSubmit) should reset form data and increment resetSignal when resetOnSuccess is true
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
