[Killed] CallExpression
organisms/gallery/hooks/use-carousel-scroll.ts:44:5
     const container = containerRef.current;
     if (!container) return;
 
-    updateButtonVisibility();
+    ;
 
     const resizeObserver = new ResizeObserver(updateButtonVisibility);
killedBy: useCarouselScroll non-carousel layout resets buttons when switching from carousel to grid
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
organisms/gallery/hooks/use-carousel-scroll.ts:47:5
     updateButtonVisibility();
 
     const resizeObserver = new ResizeObserver(updateButtonVisibility);
-    resizeObserver.observe(container);
+    ;
 
     container.addEventListener('scroll', updateButtonVisibility);
killedBy: useCarouselScroll carousel layout — ResizeObserver integration attaches a ResizeObserver to the container
statusReason: expected "vi.fn()" to be called with arguments: [ <div></div> ]

Number of calls: 0

[Killed] CallExpression
organisms/gallery/hooks/use-carousel-scroll.ts:49:5
     const resizeObserver = new ResizeObserver(updateButtonVisibility);
     resizeObserver.observe(container);
 
-    container.addEventListener('scroll', updateButtonVisibility);
+    ;
 
     return () => {
killedBy: useCarouselScroll carousel layout — scroll event updates visibility shows Prev button after scrolling forward
statusReason: expected false to be true // Object.is equality

[Survived] CallExpression
organisms/gallery/hooks/use-carousel-scroll.ts:52:7
     container.addEventListener('scroll', updateButtonVisibility);
 
     return () => {
-      container.removeEventListener('scroll', updateButtonVisibility);
+      ;
       resizeObserver.disconnect();
     };

[Killed] CallExpression
organisms/gallery/hooks/use-carousel-scroll.ts:53:7
 
     return () => {
       container.removeEventListener('scroll', updateButtonVisibility);
-      resizeObserver.disconnect();
+      ;
     };
   }, [layout, containerRef, updateButtonVisibility]);
killedBy: useCarouselScroll carousel layout — ResizeObserver integration disconnects ResizeObserver on unmount
statusReason: expected "vi.fn()" to be called at least once

[Killed] CallExpression
organisms/gallery/hooks/use-carousel-scroll.ts:61:5
     const container = containerRef.current;
     if (!container) return;
 
-    container.scrollBy({ left: container.clientWidth, behavior: 'smooth' });
+    ;
   }, [containerRef]);
 
killedBy: useCarouselScroll scrollForward and scrollBackward scrollForward calls scrollBy with positive clientWidth
statusReason: expected "vi.fn()" to be called with arguments: [ { left: 300, behavior: 'smooth' } ]

Number of calls: 0
