[Killed] CallExpression
organisms/gallery/hooks/use-fullscreen-viewer.ts:19:5
 
   const openViewer = useCallback((index: number, element: HTMLElement) => {
     triggerRef.current = element;
-    setCurrentImageIndex(index);
+    ;
     setIsViewerOpen(true);
   }, []);
killedBy: Gallery fullscreen mode enabled opens fullscreen viewer with correct image index
statusReason: Unable to find an element with the text: 2 / 3. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      aria-label="Image gallery"
      class="cl-gallery"

[Killed] CallExpression
organisms/gallery/hooks/use-fullscreen-viewer.ts:32:5
   }, []);
 
   const handleNavigate = useCallback((index: number) => {
-    setCurrentImageIndex(index);
+    ;
   }, []);
 
killedBy: Gallery navigation in fullscreen mode updates current index when navigating
statusReason: Unable to find an element with the text: 2 / 3. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      aria-label="Image gallery"
      class="cl-gallery"
