[Killed] CallExpression
components/organisms/grid/Grid.helpers.ts:25:5
       value = '';
     }
 
-    result.push({ field: column.field, value });
+    ;
   }
 
killedBy: getGridRowValues should return correct values for each column when fields exist in item
statusReason: expected [] to deeply equal [ { field: 'id', value: '1' }, …(2) ]
