[Killed] CallExpression
src/hooks/use-click-outside/use-click-outside.ts:14:3
   onClickOutsideHandler,
   dependentRef,
 }: UseClickOutsideParams): void => {
-  useEffect(() => {
-    const handleClickOutside = (event: MouseEvent) => {
-      const isOutsideRef = ref?.current && !ref.current.contains(event.target as Node);
-      const hasNoDependentRef = !dependentRef?.current;
-      const isOutsideDependentRef = hasNoDependentRef
-        ? true
-        : !dependentRef?.current?.contains(event.target as Node);
-      if (isOutsideRef && isOutsideDependentRef) {
-        onClickOutsideHandler();
-      }
-    };
-
-    document.addEventListener('mousedown', handleClickOutside);
-    return () => {
-      document.removeEventListener('mousedown', handleClickOutside);
-    };
-  }, [ref, dependentRef, onClickOutsideHandler]);
+  ;
 };
 
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] CallExpression
src/hooks/use-click-outside/use-click-outside.ts:22:9
         ? true
         : !dependentRef?.current?.contains(event.target as Node);
       if (isOutsideRef && isOutsideDependentRef) {
-        onClickOutsideHandler();
+        ;
       }
     };
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] CallExpression
src/hooks/use-click-outside/use-click-outside.ts:26:5
       }
     };
 
-    document.addEventListener('mousedown', handleClickOutside);
+    ;
     return () => {
       document.removeEventListener('mousedown', handleClickOutside);
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Survived] CallExpression
src/hooks/use-click-outside/use-click-outside.ts:28:7
 
     document.addEventListener('mousedown', handleClickOutside);
     return () => {
-      document.removeEventListener('mousedown', handleClickOutside);
+      ;
     };
   }, [ref, dependentRef, onClickOutsideHandler]);
