[Killed] CallExpression
src/hooks/use-container-dimensions/use-container-dimensions.ts:17:7
 
   useEffect(() => {
     if (ref?.current && isVisible) {
-      setDimensions({
-        width: ref.current.offsetWidth,
-        height: ref.current.offsetHeight,
-      });
+      ;
     }
   }, [ref, isVisible]);
killedBy: useTooltipPosition should center tooltip horizontally under the wrapper
statusReason: expected 200 to be 150 // Object.is equality
