[Killed] CallExpression
src/hooks/use-is-hovered/use-is-hovered.ts:14:5
     const handleMouseEnter = () => setIsHovered(true);
     const handleMouseLeave = () => setIsHovered(false);
 
-    element.addEventListener('mouseenter', handleMouseEnter);
+    ;
     element.addEventListener('mouseleave', handleMouseLeave);
 
killedBy: useIsHovered returns true on mouseenter
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div />

[Killed] CallExpression
src/hooks/use-is-hovered/use-is-hovered.ts:15:5
     const handleMouseLeave = () => setIsHovered(false);
 
     element.addEventListener('mouseenter', handleMouseEnter);
-    element.addEventListener('mouseleave', handleMouseLeave);
+    ;
 
     return () => {
killedBy: useIsHovered returns false on mouseleave
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div />

[Killed] CallExpression
src/hooks/use-is-hovered/use-is-hovered.ts:18:7
     element.addEventListener('mouseleave', handleMouseLeave);
 
     return () => {
-      element.removeEventListener('mouseenter', handleMouseEnter);
+      ;
       element.removeEventListener('mouseleave', handleMouseLeave);
     };
killedBy: useIsHovered cleans up event listeners on unmount
statusReason: expected "removeEventListener" to be called with arguments: [ 'mouseenter', Any<Function> ]

Received:

  1st removeEventListener call:

  [
-   "mouseenter",

[Killed] CallExpression
src/hooks/use-is-hovered/use-is-hovered.ts:19:7
 
     return () => {
       element.removeEventListener('mouseenter', handleMouseEnter);
-      element.removeEventListener('mouseleave', handleMouseLeave);
+      ;
     };
   }, [ref, isMounted]);
killedBy: useIsHovered cleans up event listeners on unmount
statusReason: expected "removeEventListener" to be called with arguments: [ 'mouseleave', Any<Function> ]

Received:

  1st removeEventListener call:

  [
-   "mouseleave",
