[Killed] CallExpression
src/hooks/use-is-overflow/use-is-overflow.ts:14:3
 }) => {
   const [isOverflow, setIsOverflow] = useState(false);
 
-  useEffect(() => {
-    const checkIsOverflow = () => {
-      const { current } = ref;
-
-      if (current) {
-        if (dimension === 'width') {
-          const { scrollWidth = 0, clientWidth = 0 } = current as HTMLElement;
-          setIsOverflow(scrollWidth > clientWidth);
-        }
-
-        if (dimension === 'height') {
-          const { scrollHeight = 0, clientHeight = 0 } = current as HTMLElement;
-          setIsOverflow(scrollHeight > clientHeight);
-        }
-      }
-    };
-
-    if (isMounted) {
-      checkIsOverflow();
-    }
-
-    window.addEventListener('resize', checkIsOverflow);
-
-    return () => window.removeEventListener('resize', checkIsOverflow);
-  }, [ref, dimension, isMounted]);
+  ;
 
   return isOverflow;
killedBy: useIsOverflow hook should return true when element is overflowed (width)
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/hooks/use-is-overflow/use-is-overflow.ts:32:7
     };
 
     if (isMounted) {
-      checkIsOverflow();
+      ;
     }
 
killedBy: useIsOverflow hook should return true when element is overflowed (width)
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/hooks/use-is-overflow/use-is-overflow.ts:35:5
       checkIsOverflow();
     }
 
-    window.addEventListener('resize', checkIsOverflow);
+    ;
 
     return () => window.removeEventListener('resize', checkIsOverflow);
killedBy: useIsOverflow hook should add and remove resize event listener
statusReason: expected "vi.fn()" to be called with arguments: [ 'resize', Any<Function> ]

Number of calls: 0
