[Killed] CallExpression
src/hooks/use-key-press/use-key-press.ts:10:3
 };
 
 export const useKeyPress = ({ ref, keyCode, onKeyPress }: useKeyPressParams) => {
-  useEffect(() => {
-    const handleKeyPress = (e: KeyboardEvent) => {
-      if (e?.code === keyCode && ref?.current) {
-        onKeyPress();
-      }
-    };
-
-    document.addEventListener('keydown', handleKeyPress, false);
-    return () => {
-      document.removeEventListener('keydown', handleKeyPress, false);
-    };
-  }, [ref, keyCode, onKeyPress]);
+  ;
 };
 
killedBy: Tooltip should close tooltip on Escape key press
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] CallExpression
src/hooks/use-key-press/use-key-press.ts:13:9
   useEffect(() => {
     const handleKeyPress = (e: KeyboardEvent) => {
       if (e?.code === keyCode && ref?.current) {
-        onKeyPress();
+        ;
       }
     };
killedBy: Tooltip should close tooltip on Escape key press
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>
