[Killed] CallExpression
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:24:11
     const handleTabKeyPress = (event: KeyboardEvent) => {
       if (event.key === 'Tab') {
         if (event.shiftKey && document.activeElement === firstElement) {
-          event.preventDefault();
+          ;
           lastElement.focus();
         } else if (!event.shiftKey && document.activeElement === lastElement) {
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <button type="button"></button> to be <button type="button"></button> // Object.is equality

[Killed] CallExpression
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:25:11
       if (event.key === 'Tab') {
         if (event.shiftKey && document.activeElement === firstElement) {
           event.preventDefault();
-          lastElement.focus();
+          ;
         } else if (!event.shiftKey && document.activeElement === lastElement) {
           event.preventDefault();
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <button type="button"></button> to be <button type="button"></button> // Object.is equality

[Killed] CallExpression
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:27:11
           event.preventDefault();
           lastElement.focus();
         } else if (!event.shiftKey && document.activeElement === lastElement) {
-          event.preventDefault();
+          ;
           firstElement.focus();
         }
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <button type="button"></button> to be <button type="button"></button> // Object.is equality

[Killed] CallExpression
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:28:11
           lastElement.focus();
         } else if (!event.shiftKey && document.activeElement === lastElement) {
           event.preventDefault();
-          firstElement.focus();
+          ;
         }
       }
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <button type="button"></button> to be <button type="button"></button> // Object.is equality

[Killed] CallExpression
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:33:5
       }
     };
 
-    modalElement.addEventListener('keydown', handleTabKeyPress);
+    ;
 
     return () => {
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <body><div><div>…(3)</div></div></body> to be <button type="button"></button> // Object.is equality

[Survived] CallExpression
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:36:7
     modalElement.addEventListener('keydown', handleTabKeyPress);
 
     return () => {
-      modalElement.removeEventListener('keydown', handleTabKeyPress);
+      ;
     };
   }, [modalRef, isOpened]);
