[Killed] CallExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:48:7
         left = spacing;
       }
 
-      setPosition({ top, left });
+      ;
     };
 
killedBy: useTooltipPosition should center tooltip horizontally under the wrapper
statusReason: expected +0 to be 150 // Object.is equality

[Killed] CallExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:52:5
     };
 
     // Initial position calculation
-    updatePosition();
+    ;
 
     // Set up resize observer for window changes
killedBy: useTooltipPosition should center tooltip horizontally under the wrapper
statusReason: expected +0 to be 150 // Object.is equality

[Killed] CallExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:56:5
 
     // Set up resize observer for window changes
     const resizeObserver = new ResizeObserver(updatePosition);
-    resizeObserver.observe(document.documentElement);
+    ;
 
     return () => {
killedBy: useTooltipPosition should set up ResizeObserver when opened
statusReason: expected "vi.fn()" to be called with arguments: [ <html><head></head>
…(1)</html> ]

Number of calls: 0

[Killed] CallExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:59:7
     resizeObserver.observe(document.documentElement);
 
     return () => {
-      resizeObserver.disconnect();
+      ;
     };
   }, [isOpened, wrapperRef, tooltipHeight, tooltipWidth, spacing]);
killedBy: useTooltipPosition should cleanup ResizeObserver on unmount
statusReason: expected "vi.fn()" to be called at least once
