[Killed] CallExpression
src/hooks/use-window-dimensions/use-window-dimensions.ts:15:7
 
   useEffect(() => {
     function handleResize() {
-      setWindowDimensions(getWindowDimensions());
+      ;
     }
 
killedBy: useWindowDimensions should update the window dimensions on resize
statusReason: Unable to find an element with the text: Width: 800, Height: 600. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Width: 1024, Height: 768
    </div>

[Killed] CallExpression
src/hooks/use-window-dimensions/use-window-dimensions.ts:18:5
       setWindowDimensions(getWindowDimensions());
     }
 
-    window.addEventListener('resize', handleResize);
+    ;
     return () => window.removeEventListener('resize', handleResize);
   }, []);
killedBy: useWindowDimensions should update the window dimensions on resize
statusReason: Unable to find an element with the text: Width: 800, Height: 600. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Width: 1024, Height: 768
    </div>
