[Survived] CallExpression
src/utils/handle-dropdown-list-key-press.ts:28:7
 
   switch (e.key) {
     case 'Escape':
-      e.preventDefault();
+      ;
       onClose();
       break;

[Killed] CallExpression
src/utils/handle-dropdown-list-key-press.ts:29:7
   switch (e.key) {
     case 'Escape':
       e.preventDefault();
-      onClose();
+      ;
       break;
     case 'ArrowUp': {
killedBy: handleDropdownListKeyPress closes the dropdown when Escape is pressed
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] CallExpression
src/utils/handle-dropdown-list-key-press.ts:32:7
       onClose();
       break;
     case 'ArrowUp': {
-      e.preventDefault();
+      ;
       const previousOptionIndex =
         currentFocusIndex - 1 >= 0 ? currentFocusIndex - 1 : options.length - 1;

[Killed] CallExpression
src/utils/handle-dropdown-list-key-press.ts:36:26
       const previousOptionIndex =
         currentFocusIndex - 1 >= 0 ? currentFocusIndex - 1 : options.length - 1;
       const previousValue = options[previousOptionIndex];
-      if (previousValue) moveFocusOnElementById(previousValue.id);
+      if (previousValue) ;
       break;
     }
killedBy: MultiSelect should move focus to the previous option pressing ArrowUp button
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="57b5a856-bc4b-4c2f-8295-9f44434fafc7"
  role="option"

[Killed] CallExpression
src/utils/handle-dropdown-list-key-press.ts:41:7
     }
     case 'ArrowDown':
     case 'Tab': {
-      e.preventDefault();
+      ;
       const nextOptionIndex = currentFocusIndex === options.length - 1 ? 0 : currentFocusIndex + 1;
       const nextValue = options[nextOptionIndex];
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"

[Killed] CallExpression
src/utils/handle-dropdown-list-key-press.ts:44:22
       e.preventDefault();
       const nextOptionIndex = currentFocusIndex === options.length - 1 ? 0 : currentFocusIndex + 1;
       const nextValue = options[nextOptionIndex];
-      if (nextValue) moveFocusOnElementById(nextValue.id);
+      if (nextValue) ;
       break;
     }
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"
