[Killed] CallExpression
components/atoms/editable-text/useInputFocus.ts:11:7
 ) => {
   useEffect(() => {
     if (editMode && ref.current && !readOnly) {
-      ref.current.focus();
+      ;
       if (autoSelectTextOnEditMode) {
         ref.current.select();
killedBy: useInputFocus should focus input when entering edit mode
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] CallExpression
components/atoms/editable-text/useInputFocus.ts:13:9
     if (editMode && ref.current && !readOnly) {
       ref.current.focus();
       if (autoSelectTextOnEditMode) {
-        ref.current.select();
+        ;
       }
     }
killedBy: useInputFocus should focus and select input when autoSelect is enabled
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
