[Killed] CallExpression
src/hooks/use-debounce/use-debounce.ts:8:7
 
   useEffect(() => {
     const handler = setTimeout(() => {
-      setDebouncedValue(value);
+      ;
     }, delay);
 
killedBy: useSearchController automatic search with debounce should trigger onSearch after debounce delay in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test search' ]

Number of calls: 0

[Killed] CallExpression
src/hooks/use-debounce/use-debounce.ts:12:7
     }, delay);
 
     return () => {
-      clearTimeout(handler);
+      ;
     };
   }, [value, delay]);
killedBy: useSearchController automatic search with debounce should cancel previous debounce when value changes
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "first",
