[Killed] CallExpression
src/hooks/use-is-mounted/use-is-mounted.ts:6:3
 export const useIsMounted = (isOpened: boolean, delay: number = 300): boolean => {
   const [isMounted, setIsMounted] = useState(false);
 
-  useEffect(() => {
-    let timeoutId: NodeJS.Timeout;
-
-    if (isOpened) {
-      setIsMounted(true);
-    } else {
-      timeoutId = setTimeout(() => {
-        setIsMounted(false);
-      }, delay);
-    }
-
-    return () => {
-      if (timeoutId) {
-        clearTimeout(timeoutId);
-      }
-    };
-  }, [isOpened, delay]);
+  ;
 
   return isMounted;
killedBy: FullscreenViewer rendering renders dialog when isOpen is true
statusReason: Unable to find an element by: [data-testid="fullscreen-image-viewer"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
