[Killed] CallExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:27:7
     if (!autoClose) return;
 
     if (!isOpened) {
-      setRemainingPercentage(100);
+      ;
       elapsedTimeRef.current = 0;
       if (animationFrameRef.current) {
killedBy: useRemainingTimer (open/close, cleanup, deps, edge) Open/Close Behavior resets timer when closed
statusReason: expected 50.4 to be 100 // Object.is equality

[Survived] CallExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:30:9
       setRemainingPercentage(100);
       elapsedTimeRef.current = 0;
       if (animationFrameRef.current) {
-        cancelAnimationFrame(animationFrameRef.current);
+        ;
       }
       return;

[Killed] CallExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:49:7
       elapsedTimeRef.current = elapsed;
 
       const percentage = Math.max(0, 100 - (elapsed / autoCloseDelay) * 100);
-      setRemainingPercentage(percentage);
+      ;
 
       if (elapsed >= autoCloseDelay) {
killedBy: useRemainingTimer (open/close, cleanup, deps, edge) Open/Close Behavior resets timer when closed
statusReason: expected 100 to be less than 60

[Killed] CallExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:52:9
       setRemainingPercentage(percentage);
 
       if (elapsed >= autoCloseDelay) {
-        onClose();
+        ;
         return;
       }
killedBy: useRemainingTimer (open/close, cleanup, deps, edge) Dependency Changes uses new onClose callback when dependency changes
statusReason: expected "vi.fn()" to be called once, but got 0 times
