[Killed] CallExpression
src/hooks/use-reset-form-input/use-reset-form-input.ts:9:7
 
   useEffect(() => {
     if (resetSignal) {
-      onReset();
+      ;
     }
   }, [resetSignal, onReset]);
killedBy: Form controlled flow (onSubmit) should reset form after successful submit when resetOnSuccess is true
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Alice

Ignored nodes: comments, script, style
