[Killed] CallExpression
src/utils/move-focus-on-element-by-id.ts:4:16
 export function moveFocusOnElementById(id: string) {
   const element = document.getElementById(id);
 
-  if (element) element.focus();
+  if (element) ;
 }
 
killedBy: moveFocusOnElementById should focus the element with the provided ID
statusReason: expected "vi.fn()" to be called at least once
