[NoCoverage] BooleanLiteral
atoms/button/__docs__/Button.stories.tsx:13:15
     text: 'Button',
     type: 'button',
     view: ButtonView.Primary,
-    disabled: false,
+    disabled: true,
     extended: false,
     onClick: () => console.log('Button clicked!'),

[NoCoverage] BooleanLiteral
atoms/button/__docs__/Button.stories.tsx:14:15
     type: 'button',
     view: ButtonView.Primary,
     disabled: false,
-    extended: false,
+    extended: true,
     onClick: () => console.log('Button clicked!'),
   },

[NoCoverage] ArrowFunction
atoms/button/__docs__/Button.stories.tsx:15:14
     view: ButtonView.Primary,
     disabled: false,
     extended: false,
-    onClick: () => console.log('Button clicked!'),
+    onClick: () => undefined,
   },
   argTypes: {

[NoCoverage] BooleanLiteral
atoms/button/__docs__/Button.stories.tsx:237:15
     text: 'Disabled',
     view: ButtonView.Primary,
     icon: IconName.PhoneOff,
-    disabled: true,
+    disabled: false,
   },
 };
