[NoCoverage] BooleanLiteral
atoms/editable-text/__docs__/EditableText.stories.tsx:123:31
   args: {
     value: 'Click on the text to edit',
     id: 'editable-text',
-    autoSelectTextOnEditMode: false,
+    autoSelectTextOnEditMode: true,
     multiline: false,
     onChange: (value: string) => console.log('Changed to:', value),

[NoCoverage] BooleanLiteral
atoms/editable-text/__docs__/EditableText.stories.tsx:124:16
     value: 'Click on the text to edit',
     id: 'editable-text',
     autoSelectTextOnEditMode: false,
-    multiline: false,
+    multiline: true,
     onChange: (value: string) => console.log('Changed to:', value),
     onClick: () => console.log('EditableText is clicked'),

[NoCoverage] ArrowFunction
atoms/editable-text/__docs__/EditableText.stories.tsx:125:15
     id: 'editable-text',
     autoSelectTextOnEditMode: false,
     multiline: false,
-    onChange: (value: string) => console.log('Changed to:', value),
+    onChange: () => undefined,
     onClick: () => console.log('EditableText is clicked'),
     placeholder: 'Click on the text to edit',

[NoCoverage] ArrowFunction
atoms/editable-text/__docs__/EditableText.stories.tsx:126:14
     autoSelectTextOnEditMode: false,
     multiline: false,
     onChange: (value: string) => console.log('Changed to:', value),
-    onClick: () => console.log('EditableText is clicked'),
+    onClick: () => undefined,
     placeholder: 'Click on the text to edit',
     readOnly: false,

[NoCoverage] BooleanLiteral
atoms/editable-text/__docs__/EditableText.stories.tsx:128:15
     onChange: (value: string) => console.log('Changed to:', value),
     onClick: () => console.log('EditableText is clicked'),
     placeholder: 'Click on the text to edit',
-    readOnly: false,
+    readOnly: true,
     className: 'test-class',
     isEditMode: undefined,

[NoCoverage] BooleanLiteral
atoms/editable-text/__docs__/EditableText.stories.tsx:142:15
 
 export const ReadOnly: Story = {
   args: {
-    readOnly: true,
+    readOnly: false,
     value: 'This text is read-only',
   },
