[NoCoverage] BooleanLiteral
atoms/error-message/__docs__/ErrorMessage.stories.tsx:64:14
 export const Default: Story = {
   args: {
     errorId: 'error-id',
-    visible: true,
+    visible: false,
     message: 'Incorrect value',
     testId: 'test-id',
