[Killed] BlockStatement
components/atoms/image/ResponsivePicture.tsx:17:76
   onError?: (event: React.SyntheticEvent<HTMLImageElement, Event>) => void;
 };
 
-export const ResponsivePicture: FC<Props> = ({ sources = [], ...rest }) => {
-  return (
-    <picture className="cl-image__picture">
-      {sources.map((source, index) => (
-        <source
-          key={`${source.src}-${index}`}
-          srcSet={source.descriptor ? `${source.src} ${source.descriptor}` : source.src}
-          media={source.media}
-          type={source.type}
-        />
-      ))}
-      <BasicImage {...rest} />
-    </picture>
-  );
-};
+export const ResponsivePicture: FC<Props> = ({ sources = [], ...rest }) => {};
 
killedBy: Image shows fallback when responsive image fails to load
statusReason: Unable to find an accessible element with the role "img"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[NoCoverage] ArrayDeclaration
components/atoms/image/ResponsivePicture.tsx:17:58
   onError?: (event: React.SyntheticEvent<HTMLImageElement, Event>) => void;
 };
 
-export const ResponsivePicture: FC<Props> = ({ sources = [], ...rest }) => {
+export const ResponsivePicture: FC<Props> = ({ sources = ["Stryker was here"], ...rest }) => {
   return (
     <picture className="cl-image__picture">

[Killed] ArrowFunction
components/atoms/image/ResponsivePicture.tsx:20:20
 export const ResponsivePicture: FC<Props> = ({ sources = [], ...rest }) => {
   return (
     <picture className="cl-image__picture">
-      {sources.map((source, index) => (
-        <source
-          key={`${source.src}-${index}`}
-          srcSet={source.descriptor ? `${source.src} ${source.descriptor}` : source.src}
-          media={source.media}
-          type={source.type}
-        />
-      ))}
+      {sources.map(() => undefined)}
       <BasicImage {...rest} />
     </picture>
killedBy: Image snapshot tests ResponsivePicture should match snapshot
statusReason: Snapshot `Image snapshot tests > ResponsivePicture should match snapshot 1` mismatched
