[NoCoverage] ArrayDeclaration
atoms/image/__docs__/Image.stories.tsx:79:16
     },
     decoding: {
       control: 'select',
-      options: ['sync', 'async', 'auto'],
+      options: [],
       description: 'Decoding behavior',
       table: {

[NoCoverage] ArrowFunction
atoms/image/__docs__/Image.stories.tsx:186:14
   args: {
     src: 'https://picsum.photos/error',
     alt: 'Image with error handling',
-    onError: () => console.log('Image failed to load, displaying fallback.'),
+    onError: () => undefined,
   },
 };
