[NoCoverage] BooleanLiteral
atoms/label/__docs__/Label.stories.tsx:68:15
   },
   args: {
     label: 'Sample Label',
-    required: false,
+    required: true,
     inputId: 'sample-input',
     isTextHidden: false,

[NoCoverage] BooleanLiteral
atoms/label/__docs__/Label.stories.tsx:70:19
     label: 'Sample Label',
     required: false,
     inputId: 'sample-input',
-    isTextHidden: false,
+    isTextHidden: true,
   },
 };

[NoCoverage] BooleanLiteral
atoms/label/__docs__/Label.stories.tsx:81:15
 export const Primary: Story = {
   args: {
     label: 'Username',
-    required: true,
+    required: false,
   },
 };

[NoCoverage] BooleanLiteral
atoms/label/__docs__/Label.stories.tsx:98:15
     label: 'Password',
     icon: IconName.EyeOff,
     iconPosition: 'right',
-    required: true,
+    required: false,
   },
 };

[NoCoverage] BooleanLiteral
atoms/label/__docs__/Label.stories.tsx:105:19
 export const HiddenText: Story = {
   args: {
     label: 'Delete',
-    isTextHidden: true,
+    isTextHidden: false,
     icon: IconName.Trash2,
     iconPosition: 'left',
