[NoCoverage] ArrayDeclaration
atoms/link/__docs__/Link.stories.tsx:48:16
     // Styling
     iconPosition: {
       control: 'radio',
-      options: ['left', 'right'],
+      options: [],
       description: 'Position of the icon relative to the text',
       table: {

[NoCoverage] BooleanLiteral
atoms/link/__docs__/Link.stories.tsx:77:15
   args: {
     href: '#',
     children: 'Example Link',
-    external: false,
+    external: true,
     disabled: false,
   },

[NoCoverage] BooleanLiteral
atoms/link/__docs__/Link.stories.tsx:78:15
     href: '#',
     children: 'Example Link',
     external: false,
-    disabled: false,
+    disabled: true,
   },
 };

[NoCoverage] BooleanLiteral
atoms/link/__docs__/Link.stories.tsx:96:15
   args: {
     children: 'External Website',
     href: 'https://google.com',
-    external: true,
+    external: false,
   },
 };

[NoCoverage] BooleanLiteral
atoms/link/__docs__/Link.stories.tsx:137:15
 export const DisabledLink: Story = {
   args: {
     children: 'Disabled Link',
-    disabled: true,
+    disabled: false,
     href: '#',
     icon: IconName.XSquare,
