[NoCoverage] BlockStatement
atoms/portal/__docs__/Portal.example.tsx:6:64
 
 import Portal from '../Portal';
 
-export const PortalExample: FC<PropsWithChildren> = (props) => {
-  return (
-    <Portal>
-      <div className="container">{props.children}</div>
-    </Portal>
-  );
-};
+export const PortalExample: FC<PropsWithChildren> = (props) => {};
 
