[NoCoverage] BlockStatement
atoms/tooltip/__docs__/Tooltip.example.tsx:13:7
   visibleOn,
   id,
   ...rest
-}) => {
-  return (
-    <div>
-      <Tooltip
-        tooltipContent={tooltipContent}
-        containerTag={containerTag}
-        visibleOn={visibleOn}
-        id={id}
-        {...rest}
-      >
-        {visibleOn === 'click' && <Button text="Click me" />}
-        {visibleOn === 'hover' && <Button text="Hover on me" />}
-        {visibleOn === 'focus' && <Button text="Focus on me" />}
-        {visibleOn === 'contextmenu' && <Button text="Right click on me" />}
-      </Tooltip>
-    </div>
-  );
-};
+}) => {};
 

[NoCoverage] ConditionalExpression
atoms/tooltip/__docs__/Tooltip.example.tsx:23:10
         id={id}
         {...rest}
       >
-        {visibleOn === 'click' && <Button text="Click me" />}
+        {true}
         {visibleOn === 'hover' && <Button text="Hover on me" />}
         {visibleOn === 'focus' && <Button text="Focus on me" />}

[NoCoverage] ConditionalExpression
atoms/tooltip/__docs__/Tooltip.example.tsx:23:10
         id={id}
         {...rest}
       >
-        {visibleOn === 'click' && <Button text="Click me" />}
+        {true && <Button text="Click me" />}
         {visibleOn === 'hover' && <Button text="Hover on me" />}
         {visibleOn === 'focus' && <Button text="Focus on me" />}

[NoCoverage] ConditionalExpression
atoms/tooltip/__docs__/Tooltip.example.tsx:24:10
         {...rest}
       >
         {visibleOn === 'click' && <Button text="Click me" />}
-        {visibleOn === 'hover' && <Button text="Hover on me" />}
+        {true}
         {visibleOn === 'focus' && <Button text="Focus on me" />}
         {visibleOn === 'contextmenu' && <Button text="Right click on me" />}

[NoCoverage] ConditionalExpression
atoms/tooltip/__docs__/Tooltip.example.tsx:24:10
         {...rest}
       >
         {visibleOn === 'click' && <Button text="Click me" />}
-        {visibleOn === 'hover' && <Button text="Hover on me" />}
+        {true && <Button text="Hover on me" />}
         {visibleOn === 'focus' && <Button text="Focus on me" />}
         {visibleOn === 'contextmenu' && <Button text="Right click on me" />}

[NoCoverage] LogicalOperator
atoms/tooltip/__docs__/Tooltip.example.tsx:25:10
       >
         {visibleOn === 'click' && <Button text="Click me" />}
         {visibleOn === 'hover' && <Button text="Hover on me" />}
-        {visibleOn === 'focus' && <Button text="Focus on me" />}
+        {visibleOn === 'focus' || <Button text="Focus on me" />}
         {visibleOn === 'contextmenu' && <Button text="Right click on me" />}
       </Tooltip>

[NoCoverage] EqualityOperator
atoms/tooltip/__docs__/Tooltip.example.tsx:25:10
       >
         {visibleOn === 'click' && <Button text="Click me" />}
         {visibleOn === 'hover' && <Button text="Hover on me" />}
-        {visibleOn === 'focus' && <Button text="Focus on me" />}
+        {visibleOn !== 'focus' && <Button text="Focus on me" />}
         {visibleOn === 'contextmenu' && <Button text="Right click on me" />}
       </Tooltip>

[NoCoverage] ConditionalExpression
atoms/tooltip/__docs__/Tooltip.example.tsx:26:10
         {visibleOn === 'click' && <Button text="Click me" />}
         {visibleOn === 'hover' && <Button text="Hover on me" />}
         {visibleOn === 'focus' && <Button text="Focus on me" />}
-        {visibleOn === 'contextmenu' && <Button text="Right click on me" />}
+        {true}
       </Tooltip>
     </div>

[NoCoverage] ConditionalExpression
atoms/tooltip/__docs__/Tooltip.example.tsx:26:10
         {visibleOn === 'click' && <Button text="Click me" />}
         {visibleOn === 'hover' && <Button text="Hover on me" />}
         {visibleOn === 'focus' && <Button text="Focus on me" />}
-        {visibleOn === 'contextmenu' && <Button text="Right click on me" />}
+        {true && <Button text="Right click on me" />}
       </Tooltip>
     </div>
