[NoCoverage] BooleanLiteral
atoms/tooltip/__docs__/Tooltip.stories.tsx:21:16
     containerTag: TooltipContainer.Span,
     visibleOn: 'hover',
     id: 'tooltip-id',
-    autoClose: false,
+    autoClose: true,
     autoCloseDelay: 3000,
   },

[NoCoverage] BooleanLiteral
atoms/tooltip/__docs__/Tooltip.stories.tsx:139:16
     containerTag: TooltipContainer.Div,
     visibleOn: 'click',
     id: 'tooltip-id',
-    autoClose: true,
+    autoClose: false,
     autoCloseDelay: 3000,
   },
