[NoCoverage] BlockStatement
molecules/accordion/__docs__/Accordion.example.tsx:6:64
 
 import Accordion from '../Accordion';
 
-export const AccordionExample: FC<AccordionProps> = (props) => {
-  return <Accordion {...props} />;
-};
+export const AccordionExample: FC<AccordionProps> = (props) => {};
 
