[NoCoverage] BlockStatement
molecules/alert/__docs__/Alert.example.tsx:8:84
 
 import Alert from '../Alert';
 
-export const AlertExample: FC<AlertProps> = ({ mode, message, title, ...rest }) => {
-  const [isOpened, setIsOpened] = useState(false);
-
-  const handleOpen = () => setIsOpened(true);
-  const handleClose = () => setIsOpened(false);
-
-  return (
-    <div>
-      <Button onClick={handleOpen} text="Trigger Alert" view={ButtonView.Secondary} />
-      <Alert
-        title={title}
-        message={message}
-        mode={mode}
-        {...rest}
-        isOpened={isOpened}
-        onClose={handleClose}
-      />
-    </div>
-  );
-};
+export const AlertExample: FC<AlertProps> = ({ mode, message, title, ...rest }) => {};
 

[NoCoverage] BooleanLiteral
molecules/alert/__docs__/Alert.example.tsx:9:44
 import Alert from '../Alert';
 
 export const AlertExample: FC<AlertProps> = ({ mode, message, title, ...rest }) => {
-  const [isOpened, setIsOpened] = useState(false);
+  const [isOpened, setIsOpened] = useState(true);
 
   const handleOpen = () => setIsOpened(true);

[NoCoverage] ArrowFunction
molecules/alert/__docs__/Alert.example.tsx:11:22
 export const AlertExample: FC<AlertProps> = ({ mode, message, title, ...rest }) => {
   const [isOpened, setIsOpened] = useState(false);
 
-  const handleOpen = () => setIsOpened(true);
+  const handleOpen = () => undefined;
   const handleClose = () => setIsOpened(false);
 

[NoCoverage] BooleanLiteral
molecules/alert/__docs__/Alert.example.tsx:11:40
 export const AlertExample: FC<AlertProps> = ({ mode, message, title, ...rest }) => {
   const [isOpened, setIsOpened] = useState(false);
 
-  const handleOpen = () => setIsOpened(true);
+  const handleOpen = () => setIsOpened(false);
   const handleClose = () => setIsOpened(false);
 

[NoCoverage] ArrowFunction
molecules/alert/__docs__/Alert.example.tsx:12:23
   const [isOpened, setIsOpened] = useState(false);
 
   const handleOpen = () => setIsOpened(true);
-  const handleClose = () => setIsOpened(false);
+  const handleClose = () => undefined;
 
   return (

[NoCoverage] BooleanLiteral
molecules/alert/__docs__/Alert.example.tsx:12:41
   const [isOpened, setIsOpened] = useState(false);
 
   const handleOpen = () => setIsOpened(true);
-  const handleClose = () => setIsOpened(false);
+  const handleClose = () => setIsOpened(true);
 
   return (
