[NoCoverage] BooleanLiteral
molecules/alert/__docs__/Alert.stories.tsx:121:16
   args: {
     message: 'Lorem ipsum dolor sit amet consectetur adipisicing elit.',
     mode: AlertMode.Info,
-    autoClose: true,
+    autoClose: false,
     autoCloseDelay: 3000,
   },

[NoCoverage] BooleanLiteral
molecules/alert/__docs__/Alert.stories.tsx:146:16
     title: 'Success!',
     message: 'Your profile has been updated successfully.',
     mode: AlertMode.Success,
-    autoClose: true,
+    autoClose: false,
     autoCloseDelay: 3000,
   },

[NoCoverage] BooleanLiteral
molecules/alert/__docs__/Alert.stories.tsx:156:16
     title: 'Warning',
     mode: AlertMode.Warning,
     message: 'Your storage is almost full. Consider cleaning up unused files.',
-    autoClose: false,
+    autoClose: true,
   },
 };

[NoCoverage] BooleanLiteral
molecules/alert/__docs__/Alert.stories.tsx:166:16
     mode: AlertMode.Error,
     message:
       'Failed to connect to the server. Please check your internet connection and try again.',
-    autoClose: false,
+    autoClose: true,
   },
 };

[NoCoverage] BooleanLiteral
molecules/alert/__docs__/Alert.stories.tsx:176:16
     message:
     mode: AlertMode.Help,
-    autoClose: false,
+    autoClose: true,
   },
 };
