[NoCoverage] BlockStatement
molecules/checkbox/__docs__/Checkbox.example.tsx:6:62
 
 import Checkbox from '../Checkbox';
 
-export const CheckboxExample: FC<CheckboxProps> = (props) => {
-  return <Checkbox {...props} />;
-};
+export const CheckboxExample: FC<CheckboxProps> = (props) => {};
 
