[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:156:15
     id: 'accept-terms-checkbox',
     name: 'isTermsAccepted',
     label: 'Accept Terms and Conditions',
-    required: true,
+    required: false,
     disabled: false,
     noLabel: false,

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:157:15
     name: 'isTermsAccepted',
     label: 'Accept Terms and Conditions',
     required: true,
-    disabled: false,
+    disabled: true,
     noLabel: false,
     defaultChecked: false,

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:158:14
     label: 'Accept Terms and Conditions',
     required: true,
     disabled: false,
-    noLabel: false,
+    noLabel: true,
     defaultChecked: false,
     iconPosition: 'left',

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:159:21
     required: true,
     disabled: false,
     noLabel: false,
-    defaultChecked: false,
+    defaultChecked: true,
     iconPosition: 'left',
   },

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:175:15
     id: 'accept-terms-checkbox',
     name: 'isTermsAccepted',
     label: 'Accept Terms and Conditions',
-    required: false,
+    required: true,
     disabled: false,
     noLabel: false,

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:176:15
     name: 'isTermsAccepted',
     label: 'Accept Terms and Conditions',
     required: false,
-    disabled: false,
+    disabled: true,
     noLabel: false,
     defaultChecked: false,

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:188:16
     id: 'newsletter-checkbox',
     name: 'subscribeNewsletter',
     label: 'Subscribe to newsletter',
-    stateless: true,
+    stateless: false,
     checked: true,
     required: false,

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:189:14
     name: 'subscribeNewsletter',
     label: 'Subscribe to newsletter',
     stateless: true,
-    checked: true,
+    checked: false,
     required: false,
     disabled: false,

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:190:15
     label: 'Subscribe to newsletter',
     stateless: true,
     checked: true,
-    required: false,
+    required: true,
     disabled: false,
     noLabel: false,

[NoCoverage] BlockStatement
molecules/checkbox/__docs__/Checkbox.stories.tsx:195:21
     noLabel: false,
     iconPosition: 'left',
   },
-  render: (args) => {
-    const [isSubscribed, setIsSubscribed] = useState(args.checked ?? false);
-
-    const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {
-      setIsSubscribed(event.target.checked);
-    };
-
-    return <CheckboxExample {...args} checked={isSubscribed} onChange={handleChange} />;
-  },
+  render: (args) => {},
 };
 

[NoCoverage] LogicalOperator
molecules/checkbox/__docs__/Checkbox.stories.tsx:196:54
     iconPosition: 'left',
   },
   render: (args) => {
-    const [isSubscribed, setIsSubscribed] = useState(args.checked ?? false);
+    const [isSubscribed, setIsSubscribed] = useState(args.checked && false);
 
     const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:196:70
     iconPosition: 'left',
   },
   render: (args) => {
-    const [isSubscribed, setIsSubscribed] = useState(args.checked ?? false);
+    const [isSubscribed, setIsSubscribed] = useState(args.checked ?? true);
 
     const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {

[NoCoverage] BlockStatement
molecules/checkbox/__docs__/Checkbox.stories.tsx:198:74
   render: (args) => {
     const [isSubscribed, setIsSubscribed] = useState(args.checked ?? false);
 
-    const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {
-      setIsSubscribed(event.target.checked);
-    };
+    const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {};
 
     return <CheckboxExample {...args} checked={isSubscribed} onChange={handleChange} />;

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:213:14
     label: 'Accept Terms and Conditions',
     required: false,
     disabled: false,
-    noLabel: true,
+    noLabel: false,
     defaultChecked: true,
   },

[NoCoverage] BooleanLiteral
molecules/checkbox/__docs__/Checkbox.stories.tsx:214:21
     required: false,
     disabled: false,
     noLabel: true,
-    defaultChecked: true,
+    defaultChecked: false,
   },
 };
