[Killed] BooleanLiteral
components/molecules/multi-select/MultiSelect.controller.ts:23:40
   onChange?: (values?: SelectValue[]) => void;
   options: SelectValue[];
 }) {
-  const [opened, setOpened] = useState(false);
+  const [opened, setOpened] = useState(true);
   const { onChangeFormInput, initialValues } = useContext(FormContext);
   const initialOptions = getMultiSelectInitialValues({
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] ArrowFunction
components/molecules/multi-select/MultiSelect.controller.ts:39:23
   onChangeFormInputRef.current = onChangeFormInput;
   initialOptionsRef.current = initialOptions;
 
-  const handleClose = () => setOpened(false);
+  const handleClose = () => undefined;
 
   const handleToggle = () => setOpened(!opened);
killedBy: useMultiSelectController toggles opened state correctly
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
components/molecules/multi-select/MultiSelect.controller.ts:39:39
   onChangeFormInputRef.current = onChangeFormInput;
   initialOptionsRef.current = initialOptions;
 
-  const handleClose = () => setOpened(false);
+  const handleClose = () => setOpened(true);
 
   const handleToggle = () => setOpened(!opened);
killedBy: useMultiSelectController toggles opened state correctly
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
components/molecules/multi-select/MultiSelect.controller.ts:41:24
 
   const handleClose = () => setOpened(false);
 
-  const handleToggle = () => setOpened(!opened);
+  const handleToggle = () => undefined;
 
   const handleSelect = (id: string) => {
killedBy: useMultiSelectController toggles opened state correctly
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
components/molecules/multi-select/MultiSelect.controller.ts:41:40
 
   const handleClose = () => setOpened(false);
 
-  const handleToggle = () => setOpened(!opened);
+  const handleToggle = () => setOpened(opened);
 
   const handleSelect = (id: string) => {
killedBy: useMultiSelectController toggles opened state correctly
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.controller.ts:43:40
 
   const handleToggle = () => setOpened(!opened);
 
-  const handleSelect = (id: string) => {
-    const newValues = getMultiSelectUpdatedValues(values, id);
-
-    setValues(newValues);
-    onChange?.(newValues);
-    onChangeFormInput?.({ name, value: getMultiSelectFormValues(newValues) });
-  };
+  const handleSelect = (id: string) => {};
 
   const handleReset = useCallback(() => {
killedBy: useMultiSelectController handles handleSelect without onChangeFormInput
statusReason: expected [ { id: '1', …(2) }, …(2) ] to deeply equal [ { id: '1', …(2) }, …(2) ]

[Killed] OptionalChaining
components/molecules/multi-select/MultiSelect.controller.ts:47:5
     const newValues = getMultiSelectUpdatedValues(values, id);
 
     setValues(newValues);
-    onChange?.(newValues);
+    onChange(newValues);
     onChangeFormInput?.({ name, value: getMultiSelectFormValues(newValues) });
   };
killedBy: useMultiSelectController handles handleSelect without onChange callback
statusReason: onChange is not a function

[Killed] OptionalChaining
components/molecules/multi-select/MultiSelect.controller.ts:48:5
 
     setValues(newValues);
     onChange?.(newValues);
-    onChangeFormInput?.({ name, value: getMultiSelectFormValues(newValues) });
+    onChangeFormInput({
+  name,
+  value: getMultiSelectFormValues(newValues)
+});
   };
 
killedBy: useMultiSelectController handles handleSelect without onChangeFormInput
statusReason: onChangeFormInput is not a function

[NoCoverage] BlockStatement
components/molecules/multi-select/MultiSelect.controller.ts:51:41
     onChangeFormInput?.({ name, value: getMultiSelectFormValues(newValues) });
   };
 
-  const handleReset = useCallback(() => {
-    setOpened(false);
-    setValues(initialOptionsRef.current);
-    onChangeFormInputRef.current?.({
-      name,
-      value: getMultiSelectFormValues(initialOptionsRef.current),
-    });
-  }, [name]);
+  const handleReset = useCallback(() => {}, [name]);
 
   useResetFormInput(handleReset);

[NoCoverage] BooleanLiteral
components/molecules/multi-select/MultiSelect.controller.ts:52:15
   };
 
   const handleReset = useCallback(() => {
-    setOpened(false);
+    setOpened(true);
     setValues(initialOptionsRef.current);
     onChangeFormInputRef.current?.({

[NoCoverage] OptionalChaining
components/molecules/multi-select/MultiSelect.controller.ts:54:5
   const handleReset = useCallback(() => {
     setOpened(false);
     setValues(initialOptionsRef.current);
-    onChangeFormInputRef.current?.({
-      name,
-      value: getMultiSelectFormValues(initialOptionsRef.current),
-    });
+    onChangeFormInputRef.current({
+  name,
+  value: getMultiSelectFormValues(initialOptionsRef.current)
+});
   }, [name]);
 
