[Survived] ArrowFunction
components/molecules/multi-select/Option.tsx:21:25
     { 'cl-select-option_selected': selected },
   ]);
 
-  const handleKeyDown = (id: string) => (e: KeyboardEvent<HTMLLIElement>) => {
-    switch (e.key) {
-      case ' ':
-      case 'SpaceBar':
-      case 'Enter':
-        e.preventDefault();
-        onSelect(id);
-        break;
-      default:
-        break;
-    }
-  };
+  const handleKeyDown = () => undefined;
 
   return (

[Survived] BlockStatement
components/molecules/multi-select/Option.tsx:21:78
     { 'cl-select-option_selected': selected },
   ]);
 
-  const handleKeyDown = (id: string) => (e: KeyboardEvent<HTMLLIElement>) => {
-    switch (e.key) {
-      case ' ':
-      case 'SpaceBar':
-      case 'Enter':
-        e.preventDefault();
-        onSelect(id);
-        break;
-      default:
-        break;
-    }
-  };
+  const handleKeyDown = (id: string) => (e: KeyboardEvent<HTMLLIElement>) => {};
 
   return (

[NoCoverage] ConditionalExpression
components/molecules/multi-select/Option.tsx:25:7
     switch (e.key) {
       case ' ':
       case 'SpaceBar':
-      case 'Enter':
-        e.preventDefault();
-        onSelect(id);
-        break;
+      case 'Enter':
       default:
         break;

[Survived] ConditionalExpression
components/molecules/multi-select/Option.tsx:29:7
         e.preventDefault();
         onSelect(id);
         break;
-      default:
-        break;
+      default:
     }
   };

[Killed] ArrowFunction
components/molecules/multi-select/Option.tsx:41:16
       aria-selected={selected}
       tabIndex={0}
       onKeyDown={handleKeyDown(id)}
-      onClick={() => onSelect(id)}
+      onClick={() => undefined}
       className={optionClass}
     >
killedBy: MultiSelect should call onSelectChange handler
statusReason: expected "vi.fn()" to be called once, but got 0 times
