[NoCoverage] BlockStatement
molecules/multi-select/__docs__/MultiSelect.example.tsx:6:68
 import type { FC } from 'react';
 import MultiSelect from '../MultiSelect';
 
-export const MultiSelectExample: FC<MultiSelectProps> = (props) => {
-  return <MultiSelect {...props} className="responsiveWrapper" />;
-};
+export const MultiSelectExample: FC<MultiSelectProps> = (props) => {};
 
