[NoCoverage] ArrayDeclaration
molecules/multi-select/__docs__/MultiSelect.stories.tsx:7:49
 import type MultiSelect from '../MultiSelect';
 import { MultiSelectExample } from './MultiSelect.example';
 
-const MULTI_SELECT_VALUES: MultiSelectValue[] = [
-  { id: '57b5a856-bc4b-4c2f-8295-9f44434fafc7', label: 'English', selected: false },
-  { id: '583e8b60-0177-4e38-a423-4b1d5d0a2236', label: 'Spanish', selected: false },
-  { id: 'b20bea7b-8172-4d12-b172-d5feac02d863', label: 'French', selected: false },
-  { id: '641fc722-af5a-4426-8f8a-1566cc492b91', label: 'German', selected: false },
-];
+const MULTI_SELECT_VALUES: MultiSelectValue[] = [];
 
 const meta: Meta<typeof MultiSelect> = {

[NoCoverage] BooleanLiteral
molecules/multi-select/__docs__/MultiSelect.stories.tsx:8:77
 import { MultiSelectExample } from './MultiSelect.example';
 
 const MULTI_SELECT_VALUES: MultiSelectValue[] = [
-  { id: '57b5a856-bc4b-4c2f-8295-9f44434fafc7', label: 'English', selected: false },
+  { id: '57b5a856-bc4b-4c2f-8295-9f44434fafc7', label: 'English', selected: true },
   { id: '583e8b60-0177-4e38-a423-4b1d5d0a2236', label: 'Spanish', selected: false },
   { id: 'b20bea7b-8172-4d12-b172-d5feac02d863', label: 'French', selected: false },

[NoCoverage] BooleanLiteral
molecules/multi-select/__docs__/MultiSelect.stories.tsx:9:77
 
 const MULTI_SELECT_VALUES: MultiSelectValue[] = [
   { id: '57b5a856-bc4b-4c2f-8295-9f44434fafc7', label: 'English', selected: false },
-  { id: '583e8b60-0177-4e38-a423-4b1d5d0a2236', label: 'Spanish', selected: false },
+  { id: '583e8b60-0177-4e38-a423-4b1d5d0a2236', label: 'Spanish', selected: true },
   { id: 'b20bea7b-8172-4d12-b172-d5feac02d863', label: 'French', selected: false },
   { id: '641fc722-af5a-4426-8f8a-1566cc492b91', label: 'German', selected: false },

[NoCoverage] BooleanLiteral
molecules/multi-select/__docs__/MultiSelect.stories.tsx:10:76
 const MULTI_SELECT_VALUES: MultiSelectValue[] = [
   { id: '57b5a856-bc4b-4c2f-8295-9f44434fafc7', label: 'English', selected: false },
   { id: '583e8b60-0177-4e38-a423-4b1d5d0a2236', label: 'Spanish', selected: false },
-  { id: 'b20bea7b-8172-4d12-b172-d5feac02d863', label: 'French', selected: false },
+  { id: 'b20bea7b-8172-4d12-b172-d5feac02d863', label: 'French', selected: true },
   { id: '641fc722-af5a-4426-8f8a-1566cc492b91', label: 'German', selected: false },
 ];

[NoCoverage] BooleanLiteral
molecules/multi-select/__docs__/MultiSelect.stories.tsx:11:76
   { id: '57b5a856-bc4b-4c2f-8295-9f44434fafc7', label: 'English', selected: false },
   { id: '583e8b60-0177-4e38-a423-4b1d5d0a2236', label: 'Spanish', selected: false },
   { id: 'b20bea7b-8172-4d12-b172-d5feac02d863', label: 'French', selected: false },
-  { id: '641fc722-af5a-4426-8f8a-1566cc492b91', label: 'German', selected: false },
+  { id: '641fc722-af5a-4426-8f8a-1566cc492b91', label: 'German', selected: true },
 ];
 

[NoCoverage] ArrowFunction
molecules/multi-select/__docs__/MultiSelect.stories.tsx:145:15
     label: 'Select Languages',
     options: MULTI_SELECT_VALUES,
     placeholder: 'Select languages',
-    onChange: (values) => console.log(values),
+    onChange: () => undefined,
     required: true,
     disabled: false,

[NoCoverage] BooleanLiteral
molecules/multi-select/__docs__/MultiSelect.stories.tsx:146:15
     options: MULTI_SELECT_VALUES,
     placeholder: 'Select languages',
     onChange: (values) => console.log(values),
-    required: true,
+    required: false,
     disabled: false,
   },
