[NoCoverage] BlockStatement
molecules/numeric-input/__docs__/NumericInput.example.tsx:6:70
 import type { FC } from 'react';
 import NumericInput from '../NumericInput';
 
-export const NumericInputExample: FC<NumericInputProps> = (props) => {
-  return <NumericInput {...props} className="responsiveWrapper" />;
-};
+export const NumericInputExample: FC<NumericInputProps> = (props) => {};
 
