[NoCoverage] BooleanLiteral
molecules/numeric-input/__docs__/NumericInput.stories.tsx:229:15
     max: 100,
     min: 0,
     step: 1,
-    required: false,
+    required: true,
     disabled: false,
     readOnly: false,

[NoCoverage] BooleanLiteral
molecules/numeric-input/__docs__/NumericInput.stories.tsx:231:15
     step: 1,
     required: false,
     disabled: false,
-    readOnly: false,
+    readOnly: true,
     hasSpinButtons: true,
     errorMessage: 'Enter a number between 1 and 99',

[NoCoverage] BooleanLiteral
molecules/numeric-input/__docs__/NumericInput.stories.tsx:232:21
     required: false,
     disabled: false,
     readOnly: false,
-    hasSpinButtons: true,
+    hasSpinButtons: false,
     errorMessage: 'Enter a number between 1 and 99',
     validator: (age) => !!age && age >= 1 && age < 100,

[NoCoverage] BooleanLiteral
molecules/numeric-input/__docs__/NumericInput.stories.tsx:234:25
     readOnly: false,
     hasSpinButtons: true,
     errorMessage: 'Enter a number between 1 and 99',
-    validator: (age) => !!age && age >= 1 && age < 100,
+    validator: (age) => !age && age >= 1 && age < 100,
   },
 };

[NoCoverage] EqualityOperator
molecules/numeric-input/__docs__/NumericInput.stories.tsx:234:46
     readOnly: false,
     hasSpinButtons: true,
     errorMessage: 'Enter a number between 1 and 99',
-    validator: (age) => !!age && age >= 1 && age < 100,
+    validator: (age) => !!age && age >= 1 && age <= 100,
   },
 };

[NoCoverage] BooleanLiteral
molecules/numeric-input/__docs__/NumericInput.stories.tsx:243:16
     name: 'product-quantity',
     label: 'Product Quantity:',
     id: 'quantity-input',
-    stateless: true,
+    stateless: false,
     value: 5,
     max: 50,

[NoCoverage] BooleanLiteral
molecules/numeric-input/__docs__/NumericInput.stories.tsx:248:15
     max: 50,
     min: 1,
     step: 1,
-    disabled: false,
+    disabled: true,
     readOnly: false,
     hasSpinButtons: true,

[NoCoverage] BlockStatement
molecules/numeric-input/__docs__/NumericInput.stories.tsx:252:21
     readOnly: false,
     hasSpinButtons: true,
   },
-  render: (args) => {
-    const [quantity, setQuantity] = useState(args.value || 5);
-
-    const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {
-      setQuantity(Number(event.target.value));
-    };
-
-    const handleIncrement = () => {
-      setQuantity((prev) => Math.min(prev + (args.step || 1), args.max || 50));
-    };
-
-    const handleDecrement = () => {
-      setQuantity((prev) => Math.max(prev - (args.step || 1), args.min || 1));
-    };
-
-    return (
-      <NumericInputExample
-        {...args}
-        value={quantity}
-        onChange={handleChange}
-        onIncrement={handleIncrement}
-        onDecrement={handleDecrement}
-      />
-    );
-  },
+  render: (args) => {},
 };
 

[NoCoverage] LogicalOperator
molecules/numeric-input/__docs__/NumericInput.stories.tsx:253:46
     hasSpinButtons: true,
   },
   render: (args) => {
-    const [quantity, setQuantity] = useState(args.value || 5);
+    const [quantity, setQuantity] = useState(args.value && 5);
 
     const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {

[NoCoverage] ConditionalExpression
molecules/numeric-input/__docs__/NumericInput.stories.tsx:253:46
     hasSpinButtons: true,
   },
   render: (args) => {
-    const [quantity, setQuantity] = useState(args.value || 5);
+    const [quantity, setQuantity] = useState(false);
 
     const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {

[NoCoverage] BlockStatement
molecules/numeric-input/__docs__/NumericInput.stories.tsx:255:74
   render: (args) => {
     const [quantity, setQuantity] = useState(args.value || 5);
 
-    const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {
-      setQuantity(Number(event.target.value));
-    };
+    const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {};
 
     const handleIncrement = () => {

[NoCoverage] BlockStatement
molecules/numeric-input/__docs__/NumericInput.stories.tsx:259:35
       setQuantity(Number(event.target.value));
     };
 
-    const handleIncrement = () => {
-      setQuantity((prev) => Math.min(prev + (args.step || 1), args.max || 50));
-    };
+    const handleIncrement = () => {};
 
     const handleDecrement = () => {

[NoCoverage] LogicalOperator
molecules/numeric-input/__docs__/NumericInput.stories.tsx:260:63
     };
 
     const handleIncrement = () => {
-      setQuantity((prev) => Math.min(prev + (args.step || 1), args.max || 50));
+      setQuantity((prev) => Math.min(prev + (args.step || 1), args.max && 50));
     };
 

[NoCoverage] MethodExpression
molecules/numeric-input/__docs__/NumericInput.stories.tsx:260:29
     };
 
     const handleIncrement = () => {
-      setQuantity((prev) => Math.min(prev + (args.step || 1), args.max || 50));
+      setQuantity((prev) => Math.max(prev + (args.step || 1), args.max || 50));
     };
 

[NoCoverage] BlockStatement
molecules/numeric-input/__docs__/NumericInput.stories.tsx:263:35
       setQuantity((prev) => Math.min(prev + (args.step || 1), args.max || 50));
     };
 
-    const handleDecrement = () => {
-      setQuantity((prev) => Math.max(prev - (args.step || 1), args.min || 1));
-    };
+    const handleDecrement = () => {};
 
     return (

[NoCoverage] ArithmeticOperator
molecules/numeric-input/__docs__/NumericInput.stories.tsx:264:38
     };
 
     const handleDecrement = () => {
-      setQuantity((prev) => Math.max(prev - (args.step || 1), args.min || 1));
+      setQuantity((prev) => Math.max(prev + (args.step || 1), args.min || 1));
     };
 

[NoCoverage] ConditionalExpression
molecules/numeric-input/__docs__/NumericInput.stories.tsx:264:46
     };
 
     const handleDecrement = () => {
-      setQuantity((prev) => Math.max(prev - (args.step || 1), args.min || 1));
+      setQuantity((prev) => Math.max(prev - (true), args.min || 1));
     };
 
