[NoCoverage] BlockStatement
molecules/search/__docs__/Search.example.tsx:11:42
 export const SearchExample: FC<SearchProps> = ({ onSearch, ...rest }) => {
   const [searchTerms, setSearchTerms] = useState<string[]>([]);
 
-  const handleSearch = (term: string) => {
-    setSearchTerms((prevTerms) => [term, ...prevTerms]);
-    onSearch?.(term);
-  };
+  const handleSearch = (term: string) => {};
 
   const handleClear = () => {

[NoCoverage] ArrowFunction
molecules/search/__docs__/Search.example.tsx:12:20
   const [searchTerms, setSearchTerms] = useState<string[]>([]);
 
   const handleSearch = (term: string) => {
-    setSearchTerms((prevTerms) => [term, ...prevTerms]);
+    setSearchTerms(() => undefined);
     onSearch?.(term);
   };

[NoCoverage] OptionalChaining
molecules/search/__docs__/Search.example.tsx:13:5
 
   const handleSearch = (term: string) => {
     setSearchTerms((prevTerms) => [term, ...prevTerms]);
-    onSearch?.(term);
+    onSearch(term);
   };
 

[NoCoverage] BlockStatement
molecules/search/__docs__/Search.example.tsx:16:29
     onSearch?.(term);
   };
 
-  const handleClear = () => {
-    setSearchTerms([]);
-  };
+  const handleClear = () => {};
 
   return (

[NoCoverage] EqualityOperator
molecules/search/__docs__/Search.example.tsx:31:8
       }}
     >
       <Search {...rest} onSearch={handleSearch} onClear={handleClear} />
-      {searchTerms.length > 0 && (
+      {searchTerms.length <= 0 && (
         <div className="container" style={{ margin: 0 }}>
           <Header as="h5">You searched for: </Header>

[NoCoverage] LogicalOperator
molecules/search/__docs__/Search.example.tsx:31:8
       }}
     >
       <Search {...rest} onSearch={handleSearch} onClear={handleClear} />
-      {searchTerms.length > 0 && (
-        <div className="container" style={{ margin: 0 }}>
-          <Header as="h5">You searched for: </Header>
-          {searchTerms.map((term) => (
-            <div key={term}>{term}</div>
-          ))}
-        </div>
-      )}
+      {searchTerms.length > 0 || <div className="container" style={{
+  margin: 0
+}}>
+          <Header as="h5">You searched for: </Header>
+          {searchTerms.map(term => <div key={term}>{term}</div>)}
+        </div>}
     </div>
   );

[NoCoverage] ArrowFunction
molecules/search/__docs__/Search.example.tsx:34:28
       {searchTerms.length > 0 && (
         <div className="container" style={{ margin: 0 }}>
           <Header as="h5">You searched for: </Header>
-          {searchTerms.map((term) => (
-            <div key={term}>{term}</div>
-          ))}
+          {searchTerms.map(() => undefined)}
         </div>
       )}
