[NoCoverage] BooleanLiteral
molecules/search/__docs__/Search.stories.tsx:232:16
 
     // Behavior props
     searchMode: 'manual',
-    clearable: true,
+    clearable: false,
 
     // Validation props

[NoCoverage] BooleanLiteral
molecules/search/__docs__/Search.stories.tsx:235:15
     clearable: true,
 
     // Validation props
-    required: false,
+    required: true,
 
     // Browser behavior props

[NoCoverage] BooleanLiteral
molecules/search/__docs__/Search.stories.tsx:239:17
 
     // Browser behavior props
     autoComplete: 'off',
-    spellCheck: false,
+    spellCheck: true,
 
     // State props

[NoCoverage] BooleanLiteral
molecules/search/__docs__/Search.stories.tsx:242:15
     spellCheck: false,
 
     // State props
-    disabled: false,
+    disabled: true,
   },
 };

[NoCoverage] BooleanLiteral
molecules/search/__docs__/Search.stories.tsx:286:15
     placeholder: 'Minimum 3 characters...',
     minLength: 3,
     maxLength: 50,
-    required: true,
+    required: false,
     searchMode: 'manual',
   },

[NoCoverage] BooleanLiteral
molecules/search/__docs__/Search.stories.tsx:302:15
   args: {
     label: 'Disabled Search',
     placeholder: 'This search is disabled...',
-    disabled: true,
+    disabled: false,
   },
   parameters: {
