[Killed] BooleanLiteral
components/molecules/select/Select.controller.ts:21:40
 }) {
   const { onChangeFormInput, initialValues } = useContext(FormContext);
   const initialValue = getSelectInitialValue({ name, options, defaultValue, initialValues });
-  const [opened, setOpened] = useState(false);
+  const [opened, setOpened] = useState(true);
   const [selected, setSelected] = useState<SelectValue | undefined>(initialValue);
   const onChangeFormInputRef = useRef(onChangeFormInput);
killedBy: Select should render correctly
statusReason: Snapshot `Select > should render correctly 1` mismatched

[Killed] BlockStatement
components/molecules/select/Select.controller.ts:34:40
 
   const handleToggle = () => setOpened(!opened);
 
-  const handleSelect = (id: string) => {
-    const newValue = options.find((item) => item.id === id);
-    setSelected(newValue);
-    onChange?.(newValue);
-    onChangeFormInput?.({ name, value: newValue?.id });
-  };
+  const handleSelect = (id: string) => {};
 
   const handleClear = () => {
killedBy: Select should call onSelectChange handler
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
components/molecules/select/Select.controller.ts:35:45
   const handleToggle = () => setOpened(!opened);
 
   const handleSelect = (id: string) => {
-    const newValue = options.find((item) => item.id === id);
+    const newValue = options.find((item) => true);
     setSelected(newValue);
     onChange?.(newValue);
killedBy: Select should allow the user to select an option
statusReason: expect(element).toHaveValue(b4b08a09-e287-400b-ba65-afd6ae1f6fd7)

Expected the element to have value:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7
Received:
  57b5a856-bc4b-4c2f-8295-9f44434fafc7

[Killed] EqualityOperator
components/molecules/select/Select.controller.ts:35:45
   const handleToggle = () => setOpened(!opened);
 
   const handleSelect = (id: string) => {
-    const newValue = options.find((item) => item.id === id);
+    const newValue = options.find((item) => item.id !== id);
     setSelected(newValue);
     onChange?.(newValue);
killedBy: Select should allow the user to select an option
statusReason: expect(element).toHaveValue(b4b08a09-e287-400b-ba65-afd6ae1f6fd7)

Expected the element to have value:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7
Received:
  57b5a856-bc4b-4c2f-8295-9f44434fafc7

[Survived] OptionalChaining
components/molecules/select/Select.controller.ts:37:5
   const handleSelect = (id: string) => {
     const newValue = options.find((item) => item.id === id);
     setSelected(newValue);
-    onChange?.(newValue);
+    onChange(newValue);
     onChangeFormInput?.({ name, value: newValue?.id });
   };

[NoCoverage] OptionalChaining
components/molecules/select/Select.controller.ts:38:40
     const newValue = options.find((item) => item.id === id);
     setSelected(newValue);
     onChange?.(newValue);
-    onChangeFormInput?.({ name, value: newValue?.id });
+    onChangeFormInput?.({ name, value: newValue.id });
   };
 

[Killed] BlockStatement
components/molecules/select/Select.controller.ts:41:29
     onChangeFormInput?.({ name, value: newValue?.id });
   };
 
-  const handleClear = () => {
-    setSelected(undefined);
-    onChange?.(undefined);
-  };
+  const handleClear = () => {};
 
   const handleReset = useCallback(() => {
killedBy: Select should allow the user to deselect the same option
statusReason: expect(element).not.toHaveValue(b4b08a09-e287-400b-ba65-afd6ae1f6fd7)

Expected the element not to have value:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7
Received:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7

[Survived] OptionalChaining
components/molecules/select/Select.controller.ts:43:5
 
   const handleClear = () => {
     setSelected(undefined);
-    onChange?.(undefined);
+    onChange(undefined);
   };
 

[NoCoverage] BlockStatement
components/molecules/select/Select.controller.ts:46:41
     onChange?.(undefined);
   };
 
-  const handleReset = useCallback(() => {
-    setOpened(false);
-    setSelected(initialValueRef.current);
-    onChangeFormInputRef.current?.({ name, value: initialValueRef.current?.id });
-  }, [name]);
+  const handleReset = useCallback(() => {}, [name]);
 
   useResetFormInput(handleReset);

[NoCoverage] OptionalChaining
components/molecules/select/Select.controller.ts:49:51
   const handleReset = useCallback(() => {
     setOpened(false);
     setSelected(initialValueRef.current);
-    onChangeFormInputRef.current?.({ name, value: initialValueRef.current?.id });
+    onChangeFormInputRef.current?.({ name, value: initialValueRef.current.id });
   }, [name]);
 

[NoCoverage] OptionalChaining
components/molecules/select/Select.controller.ts:49:5
   const handleReset = useCallback(() => {
     setOpened(false);
     setSelected(initialValueRef.current);
-    onChangeFormInputRef.current?.({ name, value: initialValueRef.current?.id });
+    onChangeFormInputRef.current({
+  name,
+  value: initialValueRef.current?.id
+});
   }, [name]);
 
