[NoCoverage] BlockStatement
molecules/select/__docs__/Select.example.tsx:6:58
 import type { FC } from 'react';
 import Select from '../Select';
 
-export const SelectExample: FC<SelectProps> = (props) => {
-  return <Select {...props} className="responsiveWrapper" />;
-};
+export const SelectExample: FC<SelectProps> = (props) => {};
 
