[NoCoverage] ArrowFunction
molecules/select/__docs__/Select.stories.tsx:143:15
     options: SELECT_LANGUAGES,
     name: 'language',
     placeholder: 'Select your language',
-    onChange: (value) => console.log(value),
+    onChange: () => undefined,
     required: false,
     disabled: false,

[NoCoverage] BooleanLiteral
molecules/select/__docs__/Select.stories.tsx:144:15
     name: 'language',
     placeholder: 'Select your language',
     onChange: (value) => console.log(value),
-    required: false,
+    required: true,
     disabled: false,
   },
