[Killed] BlockStatement
molecules/select/option/Option.tsx:19:46
   const { id, label } = value;
   const optionClass = getClassName(['cl-select-option', { 'cl-select-option_selected': selected }]);
 
-  const handleOptionSelect = (id: string) => {
-    if (selected) {
-      onClear();
-    } else {
-      onSelect(id);
-    }
-  };
+  const handleOptionSelect = (id: string) => {};
 
   const handleKeyDown = (id: string) => (e: KeyboardEvent<HTMLLIElement>) => {
killedBy: Select should call onSelectChange handler
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
molecules/select/option/Option.tsx:20:9
   const optionClass = getClassName(['cl-select-option', { 'cl-select-option_selected': selected }]);
 
   const handleOptionSelect = (id: string) => {
-    if (selected) {
+    if (false) {
       onClear();
     } else {
killedBy: Select should allow the user to deselect the same option
statusReason: expect(element).not.toHaveValue(b4b08a09-e287-400b-ba65-afd6ae1f6fd7)

Expected the element not to have value:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7
Received:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7

[Killed] ConditionalExpression
molecules/select/option/Option.tsx:20:9
   const optionClass = getClassName(['cl-select-option', { 'cl-select-option_selected': selected }]);
 
   const handleOptionSelect = (id: string) => {
-    if (selected) {
+    if (true) {
       onClear();
     } else {
killedBy: Select should allow the user to select an option
statusReason: expect(element).toHaveValue(b4b08a09-e287-400b-ba65-afd6ae1f6fd7)

Expected the element to have value:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7
Received:

[Killed] BlockStatement
molecules/select/option/Option.tsx:22:12
   const handleOptionSelect = (id: string) => {
     if (selected) {
       onClear();
-    } else {
-      onSelect(id);
-    }
+    } else {}
   };
 
killedBy: Select should call onSelectChange handler
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Survived] BlockStatement
molecules/select/option/Option.tsx:27:78
     }
   };
 
-  const handleKeyDown = (id: string) => (e: KeyboardEvent<HTMLLIElement>) => {
-    switch (e.key) {
-      case ' ':
-      case 'SpaceBar':
-      case 'Enter':
-        e.preventDefault();
-        handleOptionSelect(id);
-        break;
-      default:
-        break;
-    }
-  };
+  const handleKeyDown = (id: string) => (e: KeyboardEvent<HTMLLIElement>) => {};
 
   return (

[Survived] ArrowFunction
molecules/select/option/Option.tsx:27:25
     }
   };
 
-  const handleKeyDown = (id: string) => (e: KeyboardEvent<HTMLLIElement>) => {
-    switch (e.key) {
-      case ' ':
-      case 'SpaceBar':
-      case 'Enter':
-        e.preventDefault();
-        handleOptionSelect(id);
-        break;
-      default:
-        break;
-    }
-  };
+  const handleKeyDown = () => undefined;
 
   return (

[NoCoverage] ConditionalExpression
molecules/select/option/Option.tsx:31:7
     switch (e.key) {
       case ' ':
       case 'SpaceBar':
-      case 'Enter':
-        e.preventDefault();
-        handleOptionSelect(id);
-        break;
+      case 'Enter':
       default:
         break;

[Killed] ArrowFunction
molecules/select/option/Option.tsx:47:16
       aria-selected={selected}
       tabIndex={0}
       onKeyDown={handleKeyDown(id)}
-      onClick={() => handleOptionSelect(id)}
+      onClick={() => undefined}
       className={optionClass}
     >
killedBy: Select should call onSelectChange handler
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] LogicalOperator
molecules/select/option/Option.tsx:51:8
       className={optionClass}
     >
       <span>{label}</span>
-      {selected && <Icon name={IconName.Check} size={ElementSize.Small} />}
+      {selected || <Icon name={IconName.Check} size={ElementSize.Small} />}
     </li>
   );
killedBy: Select should render correctly
statusReason: Snapshot `Select > should render correctly 1` mismatched

[Survived] ConditionalExpression
molecules/select/option/Option.tsx:51:8
       className={optionClass}
     >
       <span>{label}</span>
-      {selected && <Icon name={IconName.Check} size={ElementSize.Small} />}
+      {true}
     </li>
   );
