[Killed] BlockStatement
components/molecules/switch/Switch.controller.ts:29:27
   onChangeRef.current = onChange;
 
   const handleChange = useCallback(
-    (checked: boolean) => {
-      setIsChecked(checked);
-      onChangeRef.current?.(checked);
-      onChangeFormInputRef.current?.({ name, value: checked });
-    },
+    (checked: boolean) => {},
     [name],
   );
killedBy: Switch toggles the switch when clicked
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Number of calls: 0

[Killed] OptionalChaining
components/molecules/switch/Switch.controller.ts:31:7
   const handleChange = useCallback(
     (checked: boolean) => {
       setIsChecked(checked);
-      onChangeRef.current?.(checked);
+      onChangeRef.current(checked);
       onChangeFormInputRef.current?.({ name, value: checked });
     },
killedBy: useSwitchController handles handleChange without onChange callback
statusReason: onChangeRef.current is not a function

[Killed] OptionalChaining
components/molecules/switch/Switch.controller.ts:32:7
     (checked: boolean) => {
       setIsChecked(checked);
       onChangeRef.current?.(checked);
-      onChangeFormInputRef.current?.({ name, value: checked });
+      onChangeFormInputRef.current({
+  name,
+  value: checked
+});
     },
     [name],
killedBy: useSwitchController handles handleChange without onChangeFormInput
statusReason: onChangeFormInputRef.current is not a function

[Survived] ArrayDeclaration
components/molecules/switch/Switch.controller.ts:34:5
       onChangeRef.current?.(checked);
       onChangeFormInputRef.current?.({ name, value: checked });
     },
-    [name],
+    [],
   );
 

[Killed] BlockStatement
components/molecules/switch/Switch.controller.ts:38:47
   );
 
   const handleKeyDown = useCallback(
-    (event: KeyboardEvent<HTMLDivElement>) => {
-      if (event.key === ' ' || event.key === 'Enter') {
-        event.preventDefault();
-        handleChange(!isChecked);
-      }
-    },
+    (event: KeyboardEvent<HTMLDivElement>) => {},
     [isChecked, handleChange],
   );
killedBy: Switch handles Space key for toggling
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Number of calls: 0

[Killed] ConditionalExpression
components/molecules/switch/Switch.controller.ts:39:11
 
   const handleKeyDown = useCallback(
     (event: KeyboardEvent<HTMLDivElement>) => {
-      if (event.key === ' ' || event.key === 'Enter') {
+      if (false) {
         event.preventDefault();
         handleChange(!isChecked);
killedBy: useSwitchController toggles state on handleKeyDown with Space key
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
components/molecules/switch/Switch.controller.ts:39:11
 
   const handleKeyDown = useCallback(
     (event: KeyboardEvent<HTMLDivElement>) => {
-      if (event.key === ' ' || event.key === 'Enter') {
+      if (false || event.key === 'Enter') {
         event.preventDefault();
         handleChange(!isChecked);
killedBy: useSwitchController toggles state on handleKeyDown with Space key
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
components/molecules/switch/Switch.controller.ts:41:22
     (event: KeyboardEvent<HTMLDivElement>) => {
       if (event.key === ' ' || event.key === 'Enter') {
         event.preventDefault();
-        handleChange(!isChecked);
+        handleChange(isChecked);
       }
     },
killedBy: useSwitchController toggles state on handleKeyDown with Space key
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
components/molecules/switch/Switch.controller.ts:47:41
     [isChecked, handleChange],
   );
 
-  const handleReset = useCallback(() => {
-    setIsChecked(initialValueRef.current);
-    onChangeFormInputRef.current?.({ name, value: initialValueRef.current });
-  }, [name]);
+  const handleReset = useCallback(() => {}, [name]);
 
   useResetFormInput(handleReset);

[NoCoverage] OptionalChaining
components/molecules/switch/Switch.controller.ts:49:5
 
   const handleReset = useCallback(() => {
     setIsChecked(initialValueRef.current);
-    onChangeFormInputRef.current?.({ name, value: initialValueRef.current });
+    onChangeFormInputRef.current({
+  name,
+  value: initialValueRef.current
+});
   }, [name]);
 
