[NoCoverage] BooleanLiteral
components/molecules/switch/Switch.tsx:12:14
   checked,
   onChange,
   label,
-  disabled = false,
+  disabled = true,
   className,
   id,

[Killed] BlockStatement
components/molecules/switch/Switch.tsx:38:29
     },
   ]);
 
-  const handleClick = () => {
-    if (!disabled) {
-      handleChange(!controlledChecked);
-    }
-  };
+  const handleClick = () => {};
 
   return (
killedBy: Switch toggles the switch when clicked
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Number of calls: 0

[Killed] ConditionalExpression
components/molecules/switch/Switch.tsx:39:9
   ]);
 
   const handleClick = () => {
-    if (!disabled) {
+    if (false) {
       handleChange(!controlledChecked);
     }
killedBy: Switch toggles the switch when clicked
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Number of calls: 0

[Killed] ConditionalExpression
components/molecules/switch/Switch.tsx:39:9
   ]);
 
   const handleClick = () => {
-    if (!disabled) {
+    if (true) {
       handleChange(!controlledChecked);
     }
killedBy: Switch does not toggle the switch when disabled
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      true,

[Killed] BooleanLiteral
components/molecules/switch/Switch.tsx:40:20
 
   const handleClick = () => {
     if (!disabled) {
-      handleChange(!controlledChecked);
+      handleChange(controlledChecked);
     }
   };
killedBy: Switch toggles the switch when clicked
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Received: 

  1st vi.fn() call:

  [
-   true,

[Survived] UnaryOperator
components/molecules/switch/Switch.tsx:49:28
       role="switch"
       aria-checked={controlledChecked}
       aria-label={label}
-      tabIndex={disabled ? -1 : 0}
+      tabIndex={disabled ? +1 : 0}
       className={switchClass}
       onClick={handleClick}

[Killed] ConditionalExpression
components/molecules/switch/Switch.tsx:66:8
         data-testid="switch-input"
       />
       <span className="cl-switch__label">{label}</span>
-      {hasIndicator && (
-        <span className="cl-switch__indicator" aria-hidden="true">
-          {controlledChecked ? 'On' : 'Off'}
-        </span>
-      )}
+      {true}
       <span className="cl-switch__track">
         <span className="cl-switch__thumb" />
killedBy: Switch renders the indicator correctly
statusReason: Unable to find an element with the text: On. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-checked="true"
      aria-label="Test Switch"

[Killed] LogicalOperator
components/molecules/switch/Switch.tsx:66:8
         data-testid="switch-input"
       />
       <span className="cl-switch__label">{label}</span>
-      {hasIndicator && (
-        <span className="cl-switch__indicator" aria-hidden="true">
-          {controlledChecked ? 'On' : 'Off'}
-        </span>
-      )}
+      {hasIndicator || <span className="cl-switch__indicator" aria-hidden="true">
+          {controlledChecked ? 'On' : 'Off'}
+        </span>}
       <span className="cl-switch__track">
         <span className="cl-switch__thumb" />
killedBy: Switch renders the indicator correctly
statusReason: Unable to find an element with the text: On. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-checked="true"
      aria-label="Test Switch"
