[NoCoverage] BlockStatement
molecules/switch/__docs__/Switch.example.tsx:6:53
 
 import Switch from '../Switch';
 
-export const SwitchExample = (args: SwitchProps) => {
-  const [checked, setChecked] = useState(args.checked);
-  return <Switch {...args} checked={checked} onChange={setChecked} />;
-};
+export const SwitchExample = (args: SwitchProps) => {};
 
