[NoCoverage] BooleanLiteral
molecules/switch/__docs__/Switch.stories.tsx:98:14
   },
   args: {
     label: 'Enable notifications',
-    checked: false,
+    checked: true,
     disabled: false,
   },

[NoCoverage] BooleanLiteral
molecules/switch/__docs__/Switch.stories.tsx:99:15
   args: {
     label: 'Enable notifications',
     checked: false,
-    disabled: false,
+    disabled: true,
   },
 };

[NoCoverage] BooleanLiteral
molecules/switch/__docs__/Switch.stories.tsx:115:15
 export const Disabled: Story = {
   args: {
     label: 'Airplane mode',
-    disabled: true,
+    disabled: false,
   },
 };

[NoCoverage] BooleanLiteral
molecules/switch/__docs__/Switch.stories.tsx:122:14
 export const WithIndicator: Story = {
   args: {
     label: 'Bluetooth',
-    checked: true,
+    checked: false,
     hasIndicator: true,
   },

[NoCoverage] BooleanLiteral
molecules/switch/__docs__/Switch.stories.tsx:123:19
   args: {
     label: 'Bluetooth',
     checked: true,
-    hasIndicator: true,
+    hasIndicator: false,
   },
 };
