[Killed] BooleanLiteral
components/molecules/text-input/TextInput.controller.ts:33:47
   const { onChangeFormInput, initialValues } = useContext(FormContext);
   const initialValue = getTextInputInitialValue({ initialValues, defaultValue, name });
   const [value, setValue] = useState<string>(initialValue);
-  const [valid, setValid] = useState<boolean>(true);
+  const [valid, setValid] = useState<boolean>(false);
   const [passwordShown, setPasswordShown] = useState<boolean>(false);
   const onChangeFormInputRef = useRef(onChangeFormInput);
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] BooleanLiteral
components/molecules/text-input/TextInput.controller.ts:34:63
   const initialValue = getTextInputInitialValue({ initialValues, defaultValue, name });
   const [value, setValue] = useState<string>(initialValue);
   const [valid, setValid] = useState<boolean>(true);
-  const [passwordShown, setPasswordShown] = useState<boolean>(false);
+  const [passwordShown, setPasswordShown] = useState<boolean>(true);
   const onChangeFormInputRef = useRef(onChangeFormInput);
   const initialValueRef = useRef(initialValue);
killedBy: TextInput should toggle password visibility
statusReason: expect(element).toHaveAttribute("type", "password") // element.getAttribute("type") === "password"

Expected the element to have attribute:
  type="password"
Received:
  type="text"

[Killed] BlockStatement
components/molecules/text-input/TextInput.controller.ts:42:66
   onChangeFormInputRef.current = onChangeFormInput;
   initialValueRef.current = initialValue;
 
-  const handleChange = (event: ChangeEvent<HTMLInputElement>) => {
-    const value = event.target.value;
-    const valid = validateTextInputValue({ value, required, validator });
-
-    setValue(value);
-    setValid(valid);
-    onChangeFormInput?.({ name, value, valid });
-    onChange?.(event);
-  };
+  const handleChange = (event: ChangeEvent<HTMLInputElement>) => {};
 
   const handleClear = () => {
killedBy: TextInput should call onChange handler when a user types something
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] OptionalChaining
components/molecules/text-input/TextInput.controller.ts:48:5
 
     setValue(value);
     setValid(valid);
-    onChangeFormInput?.({ name, value, valid });
+    onChangeFormInput({
+  name,
+  value,
+  valid
+});
     onChange?.(event);
   };
killedBy: TextInput should call onChange handler when a user types something
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
components/molecules/text-input/TextInput.controller.ts:52:29
     onChange?.(event);
   };
 
-  const handleClear = () => {
-    setValue('');
-    setValid(true);
-    onChangeFormInput?.({ name, value: '', valid: true });
-    onClear?.();
-  };
+  const handleClear = () => {};
 
   const handleReset = useCallback(() => {
killedBy: TextInput should allow to clear the entered text via Clear button
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  t

[Survived] BooleanLiteral
components/molecules/text-input/TextInput.controller.ts:54:14
 
   const handleClear = () => {
     setValue('');
-    setValid(true);
+    setValid(false);
     onChangeFormInput?.({ name, value: '', valid: true });
     onClear?.();

[Killed] OptionalChaining
components/molecules/text-input/TextInput.controller.ts:55:5
   const handleClear = () => {
     setValue('');
     setValid(true);
-    onChangeFormInput?.({ name, value: '', valid: true });
+    onChangeFormInput({
+  name,
+  value: '',
+  valid: true
+});
     onClear?.();
   };
killedBy: TextInput should call onClear handler when Clear button is clicked
statusReason: expected "vi.fn()" to be called once, but got 0 times

[NoCoverage] BooleanLiteral
components/molecules/text-input/TextInput.controller.ts:55:51
   const handleClear = () => {
     setValue('');
     setValid(true);
-    onChangeFormInput?.({ name, value: '', valid: true });
+    onChangeFormInput?.({ name, value: '', valid: false });
     onClear?.();
   };

[Killed] BlockStatement
components/molecules/text-input/TextInput.controller.ts:59:41
     onClear?.();
   };
 
-  const handleReset = useCallback(() => {
-    setValue(initialValueRef.current);
-    setValid(true);
-    onChangeFormInputRef.current?.({ name, value: initialValueRef.current, valid: true });
-  }, [name]);
+  const handleReset = useCallback(() => {}, [name]);
 
   const togglePassword = () => {
killedBy: Form should reset entered values to initial values
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Survived] BooleanLiteral
components/molecules/text-input/TextInput.controller.ts:61:14
 
   const handleReset = useCallback(() => {
     setValue(initialValueRef.current);
-    setValid(true);
+    setValid(false);
     onChangeFormInputRef.current?.({ name, value: initialValueRef.current, valid: true });
   }, [name]);

[Survived] BooleanLiteral
components/molecules/text-input/TextInput.controller.ts:62:83
   const handleReset = useCallback(() => {
     setValue(initialValueRef.current);
     setValid(true);
-    onChangeFormInputRef.current?.({ name, value: initialValueRef.current, valid: true });
+    onChangeFormInputRef.current?.({ name, value: initialValueRef.current, valid: false });
   }, [name]);
 

[Survived] OptionalChaining
components/molecules/text-input/TextInput.controller.ts:62:5
   const handleReset = useCallback(() => {
     setValue(initialValueRef.current);
     setValid(true);
-    onChangeFormInputRef.current?.({ name, value: initialValueRef.current, valid: true });
+    onChangeFormInputRef.current({
+  name,
+  value: initialValueRef.current,
+  valid: true
+});
   }, [name]);
 

[Killed] BlockStatement
components/molecules/text-input/TextInput.controller.ts:65:32
     onChangeFormInputRef.current?.({ name, value: initialValueRef.current, valid: true });
   }, [name]);
 
-  const togglePassword = () => {
-    setPasswordShown(!passwordShown);
-  };
+  const togglePassword = () => {};
 
   useResetFormInput(handleReset);
killedBy: TextInput should toggle password visibility
statusReason: expect(element).toHaveAttribute("type", "text") // element.getAttribute("type") === "text"

Expected the element to have attribute:
  type="text"
Received:
  type="password"

[Killed] BooleanLiteral
components/molecules/text-input/TextInput.controller.ts:66:22
   }, [name]);
 
   const togglePassword = () => {
-    setPasswordShown(!passwordShown);
+    setPasswordShown(passwordShown);
   };
 
killedBy: TextInput should toggle password visibility
statusReason: expect(element).toHaveAttribute("type", "text") // element.getAttribute("type") === "text"

Expected the element to have attribute:
  type="text"
Received:
  type="password"
