[NoCoverage] BlockStatement
molecules/text-input/__docs__/TextInput.example.tsx:7:64
 
 import TextInput from '../TextInput';
 
-export const TextInputExample: FC<TextInputProps> = (props) => {
-  return <TextInput {...props} className="responsiveWrapper" />;
-};
+export const TextInputExample: FC<TextInputProps> = (props) => {};
 
