[NoCoverage] BooleanLiteral
molecules/text-input/__docs__/TextInput.stories.tsx:228:15
     name: 'formula',
     id: 'formula-input',
     type: 'text',
-    required: false,
+    required: true,
     disabled: false,
     clearable: true,

[NoCoverage] BooleanLiteral
molecules/text-input/__docs__/TextInput.stories.tsx:230:16
     type: 'text',
     required: false,
     disabled: false,
-    clearable: true,
+    clearable: false,
     errorMessage: 'Only latin letters are allowed',
     validator: { regexp: '^[A-Za-z ]+$' },

[NoCoverage] ArrayDeclaration
molecules/text-input/__docs__/TextInput.stories.tsx:237:16
   argTypes: {
     type: {
       control: 'select',
-      options: ['text', 'email', 'password'],
+      options: [],
     },
     validator: { control: 'object' },

[NoCoverage] BooleanLiteral
molecules/text-input/__docs__/TextInput.stories.tsx:250:15
     name: 'pwd',
     id: 'pwd-input',
     type: 'password',
-    required: true,
+    required: false,
     disabled: false,
     clearable: false,

[NoCoverage] BooleanLiteral
molecules/text-input/__docs__/TextInput.stories.tsx:252:16
     type: 'password',
     required: true,
     disabled: false,
-    clearable: false,
+    clearable: true,
     errorMessage: 'Your password should contain at least 6 characters',
     validator: (input) => input.length > 6,

[NoCoverage] ArrowFunction
molecules/text-input/__docs__/TextInput.stories.tsx:254:16
     disabled: false,
     clearable: false,
     errorMessage: 'Your password should contain at least 6 characters',
-    validator: (input) => input.length > 6,
+    validator: () => undefined,
   },
   argTypes: {

[NoCoverage] EqualityOperator
molecules/text-input/__docs__/TextInput.stories.tsx:254:27
     disabled: false,
     clearable: false,
     errorMessage: 'Your password should contain at least 6 characters',
-    validator: (input) => input.length > 6,
+    validator: (input) => input.length <= 6,
   },
   argTypes: {

[NoCoverage] BooleanLiteral
molecules/text-input/__docs__/TextInput.stories.tsx:272:15
     name: 'email',
     id: 'email-input',
     type: 'email',
-    required: true,
+    required: false,
     disabled: false,
     clearable: true,

[NoCoverage] BooleanLiteral
molecules/text-input/__docs__/TextInput.stories.tsx:292:16
     name: 'message',
     label: 'Your Message:',
     id: 'message-input',
-    stateless: true,
+    stateless: false,
     value: 'Hello',
     placeholder: 'Type your message...',

[NoCoverage] BooleanLiteral
molecules/text-input/__docs__/TextInput.stories.tsx:296:15
     value: 'Hello',
     placeholder: 'Type your message...',
     type: 'text',
-    disabled: false,
+    disabled: true,
     readOnly: false,
     clearable: true,

[NoCoverage] BooleanLiteral
molecules/text-input/__docs__/TextInput.stories.tsx:298:16
     type: 'text',
     disabled: false,
     readOnly: false,
-    clearable: true,
+    clearable: false,
   },
   render: (args) => {

[NoCoverage] BlockStatement
molecules/text-input/__docs__/TextInput.stories.tsx:300:21
     readOnly: false,
     clearable: true,
   },
-  render: (args) => {
-    const [message, setMessage] = useState(args.value || '');
-
-    const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {
-      setMessage(event.target.value);
-    };
-
-    const handleClear = () => {
-      setMessage('');
-    };
-
-    return (
-      <TextInputExample {...args} value={message} onChange={handleChange} onClear={handleClear} />
-    );
-  },
+  render: (args) => {},
 };
 

[NoCoverage] ConditionalExpression
molecules/text-input/__docs__/TextInput.stories.tsx:301:44
     clearable: true,
   },
   render: (args) => {
-    const [message, setMessage] = useState(args.value || '');
+    const [message, setMessage] = useState(false);
 
     const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {

[NoCoverage] ConditionalExpression
molecules/text-input/__docs__/TextInput.stories.tsx:301:44
     clearable: true,
   },
   render: (args) => {
-    const [message, setMessage] = useState(args.value || '');
+    const [message, setMessage] = useState(true);
 
     const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {

[NoCoverage] BlockStatement
molecules/text-input/__docs__/TextInput.stories.tsx:303:74
   render: (args) => {
     const [message, setMessage] = useState(args.value || '');
 
-    const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {
-      setMessage(event.target.value);
-    };
+    const handleChange = (event: React.ChangeEvent<HTMLInputElement>) => {};
 
     const handleClear = () => {

[NoCoverage] BlockStatement
molecules/text-input/__docs__/TextInput.stories.tsx:307:31
       setMessage(event.target.value);
     };
 
-    const handleClear = () => {
-      setMessage('');
-    };
+    const handleClear = () => {};
 
     return (
