[NoCoverage] BooleanLiteral
organisms/dialog/__docs__/Dialog.example.tsx:9:44
 import Dialog from '../Dialog';
 
 export const DialogExample: FC<DialogProps> = ({ onClose, title, ...rest }) => {
-  const [isOpened, setIsOpened] = useState(false);
+  const [isOpened, setIsOpened] = useState(true);
 
   const handleOpen = () => setIsOpened(true);

[NoCoverage] BlockStatement
organisms/dialog/__docs__/Dialog.example.tsx:12:29
   const [isOpened, setIsOpened] = useState(false);
 
   const handleOpen = () => setIsOpened(true);
-  const handleClose = () => {
-    setIsOpened(false);
-    if (onClose) onClose();
-  };
+  const handleClose = () => {};
 
   const modalContent = (

[NoCoverage] BooleanLiteral
organisms/dialog/__docs__/Dialog.example.tsx:13:17
 
   const handleOpen = () => setIsOpened(true);
   const handleClose = () => {
-    setIsOpened(false);
+    setIsOpened(true);
     if (onClose) onClose();
   };

[NoCoverage] ConditionalExpression
organisms/dialog/__docs__/Dialog.example.tsx:14:9
   const handleOpen = () => setIsOpened(true);
   const handleClose = () => {
     setIsOpened(false);
-    if (onClose) onClose();
+    if (true) onClose();
   };
 

[NoCoverage] ConditionalExpression
organisms/dialog/__docs__/Dialog.example.tsx:14:9
   const handleOpen = () => setIsOpened(true);
   const handleClose = () => {
     setIsOpened(false);
-    if (onClose) onClose();
+    if (false) onClose();
   };
 
