[NoCoverage] BooleanLiteral
organisms/dialog/__docs__/Dialog.stories.tsx:98:15
 
 export const Example: Story = {
   args: {
-    isOpened: false,
+    isOpened: true,
     title: 'Please read this dialog',
     icon: IconName.Info,
