[NoCoverage] ArrayDeclaration
organisms/form/__docs__/Form.example.tsx:14:41
 import type { FormProps, FormValues, SelectValue } from '@types';
 import { type FC, useState } from 'react';
 
-const SELECT_LANGUAGES: SelectValue[] = [
-  { id: 'lang-1', label: 'English' },
-  { id: 'lang-2', label: 'Russian' },
-  { id: 'lang-3', label: 'German' },
-];
+const SELECT_LANGUAGES: SelectValue[] = [];
 
 const MULTI_SELECT_VALUES: SelectValue[] = [

[NoCoverage] ArrayDeclaration
organisms/form/__docs__/Form.example.tsx:20:44
   { id: 'lang-3', label: 'German' },
 ];
 
-const MULTI_SELECT_VALUES: SelectValue[] = [
-  { id: 'pr-lang-1', label: 'JavaScript' },
-  { id: 'pr-lang-2', label: 'Python' },
-  { id: 'pr-lang-3', label: 'Java' },
-  { id: 'pr-lang-4', label: 'C#' },
-];
+const MULTI_SELECT_VALUES: SelectValue[] = [];
 
 export const FormExample: FC<FormProps> = (props) => {

[NoCoverage] BooleanLiteral
organisms/form/__docs__/Form.example.tsx:34:19
     firstName: 'John',
     lastName: 'Doe',
     age: 42,
-    isSubscribed: true,
+    isSubscribed: false,
   };
 

[NoCoverage] ArrowFunction
organisms/form/__docs__/Form.example.tsx:42:18
       <Form
         {...props}
         initialValues={initialValues}
-        onReset={() => setData(undefined)}
+        onReset={() => undefined}
         onClickSubmit={(data) => setData(data)}
       >

[NoCoverage] ArrowFunction
organisms/form/__docs__/Form.example.tsx:43:24
         {...props}
         initialValues={initialValues}
         onReset={() => setData(undefined)}
-        onClickSubmit={(data) => setData(data)}
+        onClickSubmit={() => undefined}
       >
         <TextInput

[NoCoverage] BooleanLiteral
organisms/form/__docs__/Form.example.tsx:70:31
         <NumericInput
           name="age"
           label="Age"
-          validator={(age) => !!age && age >= 1 && age < 100}
+          validator={(age) => !age && age >= 1 && age < 100}
           errorMessage={'Enter a number between 1 and 99'}
         />

[NoCoverage] ConditionalExpression
organisms/form/__docs__/Form.example.tsx:70:40
         <NumericInput
           name="age"
           label="Age"
-          validator={(age) => !!age && age >= 1 && age < 100}
+          validator={(age) => !!age && true && age < 100}
           errorMessage={'Enter a number between 1 and 99'}
         />

[NoCoverage] BlockStatement
organisms/form/__docs__/Form.example.tsx:97:51
               </tr>
             </thead>
             <tbody>
-              {Object.entries(data).map((item) => {
-                return (
-                  <tr key={item[0]}>
-                    <td>{item[0]}</td>
-                    <td>{item[1]?.toString()}</td>
-                    <td>{typeof item[1]}</td>
-                  </tr>
-                );
-              })}
+              {Object.entries(data).map((item) => {})}
             </tbody>
           </table>

[NoCoverage] OptionalChaining
organisms/form/__docs__/Form.example.tsx:101:26
                 return (
                   <tr key={item[0]}>
                     <td>{item[0]}</td>
-                    <td>{item[1]?.toString()}</td>
+                    <td>{item[1].toString()}</td>
                     <td>{typeof item[1]}</td>
                   </tr>
