[NoCoverage] BooleanLiteral
organisms/form/__docs__/Form.stories.tsx:10:15
   component: FormExample,
   title: 'Organisms/Form',
   args: {
-    hasReset: true,
+    hasReset: false,
     initialValues: {
       firstName: 'John',

[NoCoverage] ArrowFunction
organisms/form/__docs__/Form.stories.tsx:16:20
       lastName: 'Doe',
       age: 42,
     },
-    onClickSubmit: (data) => console.log(data),
+    onClickSubmit: () => undefined,
   },
   argTypes: {
