[Killed] ArrowFunction
components/organisms/grid/Grid.controller.ts:16:27
 }) => {
   const { elementId } = useElementIds(id);
   const [selectedIds, setSelectedIds] = useState<string[]>([]);
-  const allIds = data.map((item) => item.id);
+  const allIds = data.map(() => undefined);
   const isAllSelected = allIds.length === selectedIds.length;
   const isAllCheckboxDisabled = data.some((item) => item?.disabled);
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'row1', 'row2', 'row3', …(3) ] ]

Received: 

  1st vi.fn() call:

  [
    [

[Killed] EqualityOperator
components/organisms/grid/Grid.controller.ts:17:25
   const { elementId } = useElementIds(id);
   const [selectedIds, setSelectedIds] = useState<string[]>([]);
   const allIds = data.map((item) => item.id);
-  const isAllSelected = allIds.length === selectedIds.length;
+  const isAllSelected = allIds.length !== selectedIds.length;
   const isAllCheckboxDisabled = data.some((item) => item?.disabled);
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
components/organisms/grid/Grid.controller.ts:17:25
   const { elementId } = useElementIds(id);
   const [selectedIds, setSelectedIds] = useState<string[]>([]);
   const allIds = data.map((item) => item.id);
-  const isAllSelected = allIds.length === selectedIds.length;
+  const isAllSelected = true;
   const isAllCheckboxDisabled = data.some((item) => item?.disabled);
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Survived] MethodExpression
components/organisms/grid/Grid.controller.ts:18:33
   const [selectedIds, setSelectedIds] = useState<string[]>([]);
   const allIds = data.map((item) => item.id);
   const isAllSelected = allIds.length === selectedIds.length;
-  const isAllCheckboxDisabled = data.some((item) => item?.disabled);
+  const isAllCheckboxDisabled = data.every(item => item?.disabled);
 
   const handleSelect = (ids: string[]) => {

[Survived] ArrowFunction
components/organisms/grid/Grid.controller.ts:18:43
   const [selectedIds, setSelectedIds] = useState<string[]>([]);
   const allIds = data.map((item) => item.id);
   const isAllSelected = allIds.length === selectedIds.length;
-  const isAllCheckboxDisabled = data.some((item) => item?.disabled);
+  const isAllCheckboxDisabled = data.some(() => undefined);
 
   const handleSelect = (ids: string[]) => {

[Killed] BlockStatement
components/organisms/grid/Grid.controller.ts:20:43
   const isAllSelected = allIds.length === selectedIds.length;
   const isAllCheckboxDisabled = data.some((item) => item?.disabled);
 
-  const handleSelect = (ids: string[]) => {
-    setSelectedIds(ids);
-    onSelect?.(ids);
-  };
+  const handleSelect = (ids: string[]) => {};
 
   const handleSelectAll = () => {
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'row1', 'row2', 'row3', …(3) ] ]

Number of calls: 0

[Survived] OptionalChaining
components/organisms/grid/Grid.controller.ts:22:5
 
   const handleSelect = (ids: string[]) => {
     setSelectedIds(ids);
-    onSelect?.(ids);
+    onSelect(ids);
   };
 

[Killed] BlockStatement
components/organisms/grid/Grid.controller.ts:25:33
     onSelect?.(ids);
   };
 
-  const handleSelectAll = () => {
-    handleSelect(allIds);
-  };
+  const handleSelectAll = () => {};
 
   const handleDeselectAll = () => {
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'row1', 'row2', 'row3', …(3) ] ]

Number of calls: 0

[Killed] BlockStatement
components/organisms/grid/Grid.controller.ts:29:35
     handleSelect(allIds);
   };
 
-  const handleDeselectAll = () => {
-    handleSelect([]);
-  };
+  const handleDeselectAll = () => {};
 
   const handleSelectRowById = (id: string) => {
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [] ]

Received: 

  1st vi.fn() call:

  [
-   [],

[Killed] ArrayDeclaration
components/organisms/grid/Grid.controller.ts:30:18
   };
 
   const handleDeselectAll = () => {
-    handleSelect([]);
+    handleSelect(["Stryker was here"]);
   };
 
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [] ]

Received: 

  1st vi.fn() call:

  [
-   [],

[Killed] BlockStatement
components/organisms/grid/Grid.controller.ts:33:47
     handleSelect([]);
   };
 
-  const handleSelectRowById = (id: string) => {
-    const newIds = [...selectedIds, id];
-    handleSelect(newIds);
-  };
+  const handleSelectRowById = (id: string) => {};
 
   const handleDeselectRowById = (id: string) => {
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'row1' ] ]

Received: 

  1st vi.fn() call:

  [
    [

[Killed] ArrayDeclaration
components/organisms/grid/Grid.controller.ts:34:20
   };
 
   const handleSelectRowById = (id: string) => {
-    const newIds = [...selectedIds, id];
+    const newIds = [];
     handleSelect(newIds);
   };
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'row1' ] ]

Received: 

  1st vi.fn() call:

  [
    [

[NoCoverage] BlockStatement
components/organisms/grid/Grid.controller.ts:38:49
     handleSelect(newIds);
   };
 
-  const handleDeselectRowById = (id: string) => {
-    const newIds = selectedIds.filter((item) => item !== id);
-    handleSelect(newIds);
-  };
+  const handleDeselectRowById = (id: string) => {};
   return {
     elementId,

[NoCoverage] ConditionalExpression
components/organisms/grid/Grid.controller.ts:39:49
   };
 
   const handleDeselectRowById = (id: string) => {
-    const newIds = selectedIds.filter((item) => item !== id);
+    const newIds = selectedIds.filter((item) => false);
     handleSelect(newIds);
   };

[NoCoverage] EqualityOperator
components/organisms/grid/Grid.controller.ts:39:49
   };
 
   const handleDeselectRowById = (id: string) => {
-    const newIds = selectedIds.filter((item) => item !== id);
+    const newIds = selectedIds.filter((item) => item === id);
     handleSelect(newIds);
   };
