[NoCoverage] BooleanLiteral
components/organisms/grid/Grid.tsx:18:16
   onSelect,
   renderDataItem,
   caption,
-  selectable = false,
+  selectable = true,
   className,
   ...rest

[Killed] ArrayDeclaration
components/organisms/grid/Grid.tsx:35:48
 
   return (
     <div className="cl-grid__wrapper">
-      <table {...rest} className={getClassName(['cl-grid', className])}>
+      <table {...rest} className={getClassName([])}>
         {caption && <caption className="cl-grid__caption">{caption}</caption>}
         <GridColumnGroup columns={columns} selectable={selectable} />
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] LogicalOperator
components/organisms/grid/Grid.tsx:36:10
   return (
     <div className="cl-grid__wrapper">
       <table {...rest} className={getClassName(['cl-grid', className])}>
-        {caption && <caption className="cl-grid__caption">{caption}</caption>}
+        {caption || <caption className="cl-grid__caption">{caption}</caption>}
         <GridColumnGroup columns={columns} selectable={selectable} />
         <GridHead
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
components/organisms/grid/Grid.tsx:36:10
   return (
     <div className="cl-grid__wrapper">
       <table {...rest} className={getClassName(['cl-grid', className])}>
-        {caption && <caption className="cl-grid__caption">{caption}</caption>}
+        {false}
         <GridColumnGroup columns={columns} selectable={selectable} />
         <GridHead
killedBy: Grid should render an optional caption
statusReason: Unable to find an element with the text: Test Caption. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-grid__wrapper"
    >
