[NoCoverage] BlockStatement
organisms/grid/__docs__/Grid.example.tsx:5:54
 import type { GridProps } from '@types';
 import type { FC } from 'react';
 
-export const GridExample: FC<GridProps> = (props) => {
-  return <Grid {...props} />;
-};
+export const GridExample: FC<GridProps> = (props) => {};
 
