[NoCoverage] BooleanLiteral
organisms/grid/__docs__/Grid.stories.tsx:113:17
 
 export const DefaultGrid: Story = {
   args: {
-    selectable: false,
+    selectable: true,
     renderDataItem: (item, field) => {
       return field === 'phone' ? (

[NoCoverage] BlockStatement
organisms/grid/__docs__/Grid.stories.tsx:114:38
 export const DefaultGrid: Story = {
   args: {
     selectable: false,
-    renderDataItem: (item, field) => {
-      return field === 'phone' ? (
-        <em>{item[field ?? ''] as string}</em>
-      ) : (
-        <span>{item[field] as string}</span>
-      );
-    },
+    renderDataItem: (item, field) => {},
     caption: 'Contact List',
     columns: [

[NoCoverage] ConditionalExpression
organisms/grid/__docs__/Grid.stories.tsx:115:14
   args: {
     selectable: false,
     renderDataItem: (item, field) => {
-      return field === 'phone' ? (
+      return false ? (
         <em>{item[field ?? ''] as string}</em>
       ) : (

[NoCoverage] ConditionalExpression
organisms/grid/__docs__/Grid.stories.tsx:115:14
   args: {
     selectable: false,
     renderDataItem: (item, field) => {
-      return field === 'phone' ? (
+      return true ? (
         <em>{item[field ?? ''] as string}</em>
       ) : (

[NoCoverage] BooleanLiteral
organisms/grid/__docs__/Grid.stories.tsx:177:17
 
 export const SelectableGrid: Story = {
   args: {
-    selectable: true,
+    selectable: false,
     onSelect: (ids: string[]) => console.log(ids),
     columns: [

[NoCoverage] ArrowFunction
organisms/grid/__docs__/Grid.stories.tsx:178:15
 export const SelectableGrid: Story = {
   args: {
     selectable: true,
-    onSelect: (ids: string[]) => console.log(ids),
+    onSelect: () => undefined,
     columns: [
       { title: 'Company', field: 'company' },

[NoCoverage] ArrayDeclaration
organisms/grid/__docs__/Grid.stories.tsx:179:14
   args: {
     selectable: true,
     onSelect: (ids: string[]) => console.log(ids),
-    columns: [
-      { title: 'Company', field: 'company' },
-      { title: 'Contact', field: 'contact' },
-      { title: 'Country', field: 'country' },
-      { title: 'Phone', field: 'phone' },
-    ],
+    columns: [],
     data: [
       {
