[Killed] BooleanLiteral
organisms/grid/checkbox/GridCheckbox.tsx:17:14
   name,
   label,
   disabled,
-  required = false,
+  required = true,
   onChange,
   checked = false,
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[NoCoverage] BooleanLiteral
organisms/grid/checkbox/GridCheckbox.tsx:19:13
   disabled,
   required = false,
   onChange,
-  checked = false,
+  checked = true,
   ...props
 }) => {

[Survived] OptionalChaining
organisms/grid/checkbox/GridCheckbox.tsx:22:39
   checked = false,
   ...props
 }) => {
-  const { elementId } = useElementIds(props?.id);
+  const { elementId } = useElementIds(props.id);
   const checkboxClass = getClassName([
     'cl-grid-checkbox',

[Killed] ArrayDeclaration
organisms/grid/checkbox/GridCheckbox.tsx:23:38
   ...props
 }) => {
   const { elementId } = useElementIds(props?.id);
-  const checkboxClass = getClassName([
-    'cl-grid-checkbox',
-    {
-      'cl-grid-checkbox_disabled': !!disabled,
-      'cl-grid-checkbox_checked': !!checked,
-    },
-  ]);
+  const checkboxClass = getClassName([]);
 
   return (
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
organisms/grid/checkbox/GridCheckbox.tsx:26:36
   const checkboxClass = getClassName([
     'cl-grid-checkbox',
     {
-      'cl-grid-checkbox_disabled': !!disabled,
+      'cl-grid-checkbox_disabled': !disabled,
       'cl-grid-checkbox_checked': !!checked,
     },
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
organisms/grid/checkbox/GridCheckbox.tsx:27:36
     'cl-grid-checkbox',
     {
       'cl-grid-checkbox_disabled': !!disabled,
-      'cl-grid-checkbox_checked': !!checked,
+      'cl-grid-checkbox_checked': !checked,
     },
   ]);
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
organisms/grid/checkbox/GridCheckbox.tsx:47:23
         label={label}
         required={required}
         inputId={elementId}
-        isTextHidden={true}
+        isTextHidden={false}
         iconPosition="left"
         icon={checked ? IconName.CheckSquare : IconName.Square}
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched
