[NoCoverage] ArrayDeclaration
components/organisms/menu/Menu.tsx:10:11
 import './Menu.css';
 
 const Menu: FC<MenuProps> = ({
-  items = [],
+  items = ["Stryker was here"],
   mode = OrientationMode.Vertical,
   openedOn = 'click',

[Killed] BlockStatement
components/organisms/menu/Menu.tsx:15:7
   openedOn = 'click',
   className,
   ...rest
-}) => {
-  const menuClass = getClassName([
-    'cl-menu-bar',
-    className,
-    { 'cl-menu-bar_vertical': mode === OrientationMode.Vertical },
-  ]);
-
-  return (
-    <menu {...rest} className={menuClass}>
-      {items.map((item) => (
-        <MenuListItem key={item.id} item={item} mode={mode} openedOn={openedOn} />
-      ))}
-    </menu>
-  );
-};
+}) => {};
 
 export default Menu;
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Snapshot `Menu Component > renders a menu bar with the correct role 1` mismatched

[Killed] ArrayDeclaration
components/organisms/menu/Menu.tsx:16:34
   className,
   ...rest
 }) => {
-  const menuClass = getClassName([
-    'cl-menu-bar',
-    className,
-    { 'cl-menu-bar_vertical': mode === OrientationMode.Vertical },
-  ]);
+  const menuClass = getClassName([]);
 
   return (
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Snapshot `Menu Component > renders a menu bar with the correct role 1` mismatched

[Killed] EqualityOperator
components/organisms/menu/Menu.tsx:19:31
   const menuClass = getClassName([
     'cl-menu-bar',
     className,
-    { 'cl-menu-bar_vertical': mode === OrientationMode.Vertical },
+    { 'cl-menu-bar_vertical': mode !== OrientationMode.Vertical },
   ]);
 
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Snapshot `Menu Component > renders a menu bar with the correct role 1` mismatched

[Killed] ConditionalExpression
components/organisms/menu/Menu.tsx:19:31
   const menuClass = getClassName([
     'cl-menu-bar',
     className,
-    { 'cl-menu-bar_vertical': mode === OrientationMode.Vertical },
+    { 'cl-menu-bar_vertical': false },
   ]);
 
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Snapshot `Menu Component > renders a menu bar with the correct role 1` mismatched

[Killed] ArrowFunction
components/organisms/menu/Menu.tsx:24:18
 
   return (
     <menu {...rest} className={menuClass}>
-      {items.map((item) => (
-        <MenuListItem key={item.id} item={item} mode={mode} openedOn={openedOn} />
-      ))}
+      {items.map(() => undefined)}
     </menu>
   );
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Snapshot `Menu Component > renders a menu bar with the correct role 1` mismatched
