[NoCoverage] BlockStatement
organisms/menu/__docs__/Menu.example.tsx:11:7
   openedOn = 'click',
   items = [],
   ...rest
-}) => {
-  return (
-    <div
-      style={{
-        width: mode === OrientationMode.Vertical ? '400px' : '100%',
-        display: 'flex',
-        alignItems: 'center',
-        justifyContent: 'center',
-      }}
-    >
-      <Menu items={items} mode={mode} openedOn={openedOn} {...rest} />
-    </div>
-  );
-};
+}) => {};
 
 export default MenuExample;

[NoCoverage] ConditionalExpression
organisms/menu/__docs__/Menu.example.tsx:15:16
   return (
     <div
       style={{
-        width: mode === OrientationMode.Vertical ? '400px' : '100%',
+        width: false ? '400px' : '100%',
         display: 'flex',
         alignItems: 'center',

[NoCoverage] EqualityOperator
organisms/menu/__docs__/Menu.example.tsx:15:16
   return (
     <div
       style={{
-        width: mode === OrientationMode.Vertical ? '400px' : '100%',
+        width: mode !== OrientationMode.Vertical ? '400px' : '100%',
         display: 'flex',
         alignItems: 'center',
