[NoCoverage] ArrayDeclaration
organisms/menu/__docs__/Menu.stories.tsx:38:26
           {
             id: 'item-10',
             label: 'Statistics',
-            nestedItems: [
-              {
-                id: 'item-18',
-                label: '2023',
-                icon: IconName.Check,
-                onHover: () => console.log('Hover item-18'),
-              },
-              {
-                id: 'item-19',
-                label: '2024',
-                icon: IconName.Check,
-                onClick: () => console.log('Click item-18'),
-              },
-              {
-                id: 'item-20',
-                label: '2025',
-                icon: IconName.Check,
-                onFocus: () => console.log('Focus item-18'),
-                link: 'https://github.com/',
-              },
-            ],
+            nestedItems: [],
           },
           {

[NoCoverage] ArrowFunction
organisms/menu/__docs__/Menu.stories.tsx:43:26
                 id: 'item-18',
                 label: '2023',
                 icon: IconName.Check,
-                onHover: () => console.log('Hover item-18'),
+                onHover: () => undefined,
               },
               {

[NoCoverage] ArrowFunction
organisms/menu/__docs__/Menu.stories.tsx:49:26
                 id: 'item-19',
                 label: '2024',
                 icon: IconName.Check,
-                onClick: () => console.log('Click item-18'),
+                onClick: () => undefined,
               },
               {

[NoCoverage] ArrowFunction
organisms/menu/__docs__/Menu.stories.tsx:55:26
                 id: 'item-20',
                 label: '2025',
                 icon: IconName.Check,
-                onFocus: () => console.log('Focus item-18'),
+                onFocus: () => undefined,
                 link: 'https://github.com/',
               },

[NoCoverage] ArrayDeclaration
organisms/menu/__docs__/Menu.stories.tsx:139:16
     },
     openedOn: {
       control: 'radio',
-      options: ['hover', 'click'],
+      options: [],
       description: 'Interaction method for opening nested menus',
       table: {
