[Killed] OptionalChaining
organisms/menu/list-item/MenuListItem.tsx:17:19
 };
 
 export const MenuListItem: FC<Props> = ({ item, mode, openedOn }) => {
-  const isLeaf = !item?.nestedItems?.length;
+  const isLeaf = !item?.nestedItems.length;
   const [isSubMenuOpened, setIsSubMenuOpened] = useState(false);
   const subMenuBarClass = getClassName([
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
organisms/menu/list-item/MenuListItem.tsx:17:18
 };
 
 export const MenuListItem: FC<Props> = ({ item, mode, openedOn }) => {
-  const isLeaf = !item?.nestedItems?.length;
+  const isLeaf = item?.nestedItems?.length;
   const [isSubMenuOpened, setIsSubMenuOpened] = useState(false);
   const subMenuBarClass = getClassName([
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Snapshot `Menu Component > renders a menu bar with the correct role 1` mismatched

[Killed] BooleanLiteral
organisms/menu/list-item/MenuListItem.tsx:18:58
 
 export const MenuListItem: FC<Props> = ({ item, mode, openedOn }) => {
   const isLeaf = !item?.nestedItems?.length;
-  const [isSubMenuOpened, setIsSubMenuOpened] = useState(false);
+  const [isSubMenuOpened, setIsSubMenuOpened] = useState(true);
   const subMenuBarClass = getClassName([
     'cl-sub-menu-bar',
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Snapshot `Menu Component > renders a menu bar with the correct role 1` mismatched

[Killed] ArrayDeclaration
organisms/menu/list-item/MenuListItem.tsx:19:40
 export const MenuListItem: FC<Props> = ({ item, mode, openedOn }) => {
   const isLeaf = !item?.nestedItems?.length;
   const [isSubMenuOpened, setIsSubMenuOpened] = useState(false);
-  const subMenuBarClass = getClassName([
-    'cl-sub-menu-bar',
-    { 'cl-sub-menu-bar_horizontal': mode === OrientationMode.Horizontal },
-  ]);
+  const subMenuBarClass = getClassName([]);
 
   if (isLeaf) {
killedBy: MenuListItem should match the snapshot
statusReason: Snapshot `MenuListItem > should match the snapshot 1` mismatched

[Killed] EqualityOperator
organisms/menu/list-item/MenuListItem.tsx:21:37
   const [isSubMenuOpened, setIsSubMenuOpened] = useState(false);
   const subMenuBarClass = getClassName([
     'cl-sub-menu-bar',
-    { 'cl-sub-menu-bar_horizontal': mode === OrientationMode.Horizontal },
+    { 'cl-sub-menu-bar_horizontal': mode !== OrientationMode.Horizontal },
   ]);
 
killedBy: MenuListItem should match the snapshot
statusReason: Snapshot `MenuListItem > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/menu/list-item/MenuListItem.tsx:21:37
   const [isSubMenuOpened, setIsSubMenuOpened] = useState(false);
   const subMenuBarClass = getClassName([
     'cl-sub-menu-bar',
-    { 'cl-sub-menu-bar_horizontal': mode === OrientationMode.Horizontal },
+    { 'cl-sub-menu-bar_horizontal': false },
   ]);
 
killedBy: MenuListItem should match the snapshot
statusReason: Snapshot `MenuListItem > should match the snapshot 1` mismatched

[Killed] BlockStatement
organisms/menu/list-item/MenuListItem.tsx:24:15
     { 'cl-sub-menu-bar_horizontal': mode === OrientationMode.Horizontal },
   ]);
 
-  if (isLeaf) {
-    return <MenuLeaf item={item} />;
-  }
+  if (isLeaf) {}
 
   const toggleSubMenu = () => {
killedBy: MenuListItem should match the snapshot
statusReason: Snapshot `MenuListItem > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/menu/list-item/MenuListItem.tsx:24:7
     { 'cl-sub-menu-bar_horizontal': mode === OrientationMode.Horizontal },
   ]);
 
-  if (isLeaf) {
+  if (true) {
     return <MenuLeaf item={item} />;
   }
killedBy: MenuListItem should match the snapshot
statusReason: Snapshot `MenuListItem > should match the snapshot 1` mismatched

[Killed] BlockStatement
organisms/menu/list-item/MenuListItem.tsx:28:31
     return <MenuLeaf item={item} />;
   }
 
-  const toggleSubMenu = () => {
-    setIsSubMenuOpened(!isSubMenuOpened);
-  };
+  const toggleSubMenu = () => {};
 
   const closeSubMenu = () => {
killedBy: Menu Component should open the sub-menu onClick the item with nested items
statusReason: Unable to find an element with the text: Nested Item. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <menu
      class="cl-menu-bar cl-menu-bar_vertical"
    >

[Killed] BooleanLiteral
organisms/menu/list-item/MenuListItem.tsx:29:24
   }
 
   const toggleSubMenu = () => {
-    setIsSubMenuOpened(!isSubMenuOpened);
+    setIsSubMenuOpened(isSubMenuOpened);
   };
 
killedBy: Menu Component should open the sub-menu onClick the item with nested items
statusReason: Unable to find an element with the text: Nested Item. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <menu
      class="cl-menu-bar cl-menu-bar_vertical"
    >

[NoCoverage] BlockStatement
organisms/menu/list-item/MenuListItem.tsx:32:30
     setIsSubMenuOpened(!isSubMenuOpened);
   };
 
-  const closeSubMenu = () => {
-    setIsSubMenuOpened(false);
-  };
+  const closeSubMenu = () => {};
 
   const openSubMenu = () => {

[NoCoverage] BooleanLiteral
organisms/menu/list-item/MenuListItem.tsx:33:24
   };
 
   const closeSubMenu = () => {
-    setIsSubMenuOpened(false);
+    setIsSubMenuOpened(true);
   };
 

[NoCoverage] BlockStatement
organisms/menu/list-item/MenuListItem.tsx:36:29
     setIsSubMenuOpened(false);
   };
 
-  const openSubMenu = () => {
-    setIsSubMenuOpened(true);
-  };
+  const openSubMenu = () => {};
 
   return (

[NoCoverage] BooleanLiteral
organisms/menu/list-item/MenuListItem.tsx:37:24
   };
 
   const openSubMenu = () => {
-    setIsSubMenuOpened(true);
+    setIsSubMenuOpened(false);
   };
 

[Killed] ArrowFunction
organisms/menu/list-item/MenuListItem.tsx:51:33
       openedOn={openedOn}
     >
       <ul className={subMenuBarClass} role="menu" aria-label={item.label}>
-        {item?.nestedItems?.map((child) => (
-          <MenuListItem item={child} key={child.id} mode={mode} openedOn={openedOn} />
-        ))}
+        {item?.nestedItems?.map(() => undefined)}
       </ul>
     </SubMenu>
killedBy: Menu Component should open the sub-menu onClick the item with nested items
statusReason: Unable to find an element with the text: Nested Item. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <menu
      class="cl-menu-bar cl-menu-bar_vertical"
    >

[Survived] OptionalChaining
organisms/menu/list-item/MenuListItem.tsx:51:10
       openedOn={openedOn}
     >
       <ul className={subMenuBarClass} role="menu" aria-label={item.label}>
-        {item?.nestedItems?.map((child) => (
+        {item?.nestedItems.map((child) => (
           <MenuListItem item={child} key={child.id} mode={mode} openedOn={openedOn} />
         ))}
