[Killed] BlockStatement
organisms/menu/sub-menu/SubMenu.tsx:49:60
     </span>
   );
 
-  const handleKeyDown = (e: KeyboardEvent<HTMLElement>) => {
-    e.stopPropagation();
-    if (e.key === ' ') {
-      toggleSubMenu();
-    }
-  };
+  const handleKeyDown = (e: KeyboardEvent<HTMLElement>) => {};
 
   const onClickOutsideHandler = () => {
killedBy: SubMenu toggles submenu on Space key press
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
organisms/menu/sub-menu/SubMenu.tsx:51:9
 
   const handleKeyDown = (e: KeyboardEvent<HTMLElement>) => {
     e.stopPropagation();
-    if (e.key === ' ') {
+    if (true) {
       toggleSubMenu();
     }
killedBy: SubMenu toggles submenu on Space key press
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
organisms/menu/sub-menu/SubMenu.tsx:51:9
 
   const handleKeyDown = (e: KeyboardEvent<HTMLElement>) => {
     e.stopPropagation();
-    if (e.key === ' ') {
+    if (false) {
       toggleSubMenu();
     }
killedBy: SubMenu toggles submenu on Space key press
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[NoCoverage] BlockStatement
organisms/menu/sub-menu/SubMenu.tsx:56:39
     }
   };
 
-  const onClickOutsideHandler = () => {
-    if (mode === OrientationMode.Vertical) return;
-    closeSubMenu();
-  };
+  const onClickOutsideHandler = () => {};
 
   useClickOutside({ ref, dependentRef, onClickOutsideHandler });

[NoCoverage] ConditionalExpression
organisms/menu/sub-menu/SubMenu.tsx:57:9
   };
 
   const onClickOutsideHandler = () => {
-    if (mode === OrientationMode.Vertical) return;
+    if (true) return;
     closeSubMenu();
   };

[NoCoverage] ConditionalExpression
organisms/menu/sub-menu/SubMenu.tsx:57:9
   };
 
   const onClickOutsideHandler = () => {
-    if (mode === OrientationMode.Vertical) return;
+    if (false) return;
     closeSubMenu();
   };

[Killed] ConditionalExpression
organisms/menu/sub-menu/SubMenu.tsx:71:21
       aria-haspopup="true"
       aria-expanded={isSubMenuOpened}
       onKeyDown={handleKeyDown}
-      onMouseEnter={openedOn === 'hover' ? openSubMenu : undefined}
+      onMouseEnter={true ? openSubMenu : undefined}
       onMouseLeave={openedOn === 'hover' ? closeSubMenu : undefined}
       ref={ref}
killedBy: Menu Component should open the sub-menu onClick the item with nested items
statusReason: Unable to find an element with the text: Nested Item. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <menu
      class="cl-menu-bar cl-menu-bar_vertical"
    >

[Killed] EqualityOperator
organisms/menu/sub-menu/SubMenu.tsx:71:21
       aria-haspopup="true"
       aria-expanded={isSubMenuOpened}
       onKeyDown={handleKeyDown}
-      onMouseEnter={openedOn === 'hover' ? openSubMenu : undefined}
+      onMouseEnter={openedOn !== 'hover' ? openSubMenu : undefined}
       onMouseLeave={openedOn === 'hover' ? closeSubMenu : undefined}
       ref={ref}
killedBy: Menu Component should open the sub-menu onClick the item with nested items
statusReason: Unable to find an element with the text: Nested Item. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <menu
      class="cl-menu-bar cl-menu-bar_vertical"
    >

[Survived] ConditionalExpression
organisms/menu/sub-menu/SubMenu.tsx:72:21
       aria-expanded={isSubMenuOpened}
       onKeyDown={handleKeyDown}
       onMouseEnter={openedOn === 'hover' ? openSubMenu : undefined}
-      onMouseLeave={openedOn === 'hover' ? closeSubMenu : undefined}
+      onMouseLeave={false ? closeSubMenu : undefined}
       ref={ref}
     >

[Survived] ConditionalExpression
organisms/menu/sub-menu/SubMenu.tsx:72:21
       aria-expanded={isSubMenuOpened}
       onKeyDown={handleKeyDown}
       onMouseEnter={openedOn === 'hover' ? openSubMenu : undefined}
-      onMouseLeave={openedOn === 'hover' ? closeSubMenu : undefined}
+      onMouseLeave={true ? closeSubMenu : undefined}
       ref={ref}
     >

[Killed] ConditionalExpression
organisms/menu/sub-menu/SubMenu.tsx:84:8
         {itemContent}
         <Icon name={IconName.ChevronDown} className={iconClass} size={ElementSize.Small} />
       </span>
-      {isSubMenuOpened && children}
+      {false}
     </li>
   );
killedBy: Menu Component should open the sub-menu onClick the item with nested items
statusReason: Unable to find an element with the text: Nested Item. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <menu
      class="cl-menu-bar cl-menu-bar_vertical"
    >

[Killed] LogicalOperator
organisms/menu/sub-menu/SubMenu.tsx:84:8
         {itemContent}
         <Icon name={IconName.ChevronDown} className={iconClass} size={ElementSize.Small} />
       </span>
-      {isSubMenuOpened && children}
+      {isSubMenuOpened || children}
     </li>
   );
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Snapshot `Menu Component > renders a menu bar with the correct role 1` mismatched
