[NoCoverage] BooleanLiteral
components/organisms/tabs/Tabs.tsx:15:15
   defaultTabId,
   className,
   mode = OrientationMode.Horizontal,
-  stretched = false,
+  stretched = true,
   editable = false,
   extendable = false,

[Killed] BooleanLiteral
components/organisms/tabs/Tabs.tsx:16:14
   className,
   mode = OrientationMode.Horizontal,
   stretched = false,
-  editable = false,
+  editable = true,
   extendable = false,
   extendedTabLabel = 'New Tab',
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
components/organisms/tabs/Tabs.tsx:17:16
   mode = OrientationMode.Horizontal,
   stretched = false,
   editable = false,
-  extendable = false,
+  extendable = true,
   extendedTabLabel = 'New Tab',
   extendedTabContent,
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Survived] ArithmeticOperator
components/organisms/tabs/Tabs.tsx:28:48
 }) => {
   const [tabs, setTabs] = useState<ChopLogicTabItem[]>(initialTabs);
   const initialTabsCount = initialTabs.length;
-  const [tabCounter, setTabCounter] = useState(initialTabsCount + 1);
+  const [tabCounter, setTabCounter] = useState(initialTabsCount - 1);
   const tabIds = tabs.map((item) => item.id);
   const tabPanelIds = tabIds.map((id) => `tabpanel_${id}`);

[Killed] ArrowFunction
components/organisms/tabs/Tabs.tsx:29:27
   const [tabs, setTabs] = useState<ChopLogicTabItem[]>(initialTabs);
   const initialTabsCount = initialTabs.length;
   const [tabCounter, setTabCounter] = useState(initialTabsCount + 1);
-  const tabIds = tabs.map((item) => item.id);
+  const tabIds = tabs.map(() => undefined);
   const tabPanelIds = tabIds.map((id) => `tabpanel_${id}`);
   const defaultId = defaultTabId && tabIds.includes(defaultTabId) ? defaultTabId : tabIds[0];
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ArrowFunction
components/organisms/tabs/Tabs.tsx:30:34
   const initialTabsCount = initialTabs.length;
   const [tabCounter, setTabCounter] = useState(initialTabsCount + 1);
   const tabIds = tabs.map((item) => item.id);
-  const tabPanelIds = tabIds.map((id) => `tabpanel_${id}`);
+  const tabPanelIds = tabIds.map(() => undefined);
   const defaultId = defaultTabId && tabIds.includes(defaultTabId) ? defaultTabId : tabIds[0];
   const [selectedTabId, setSelectedTabId] = useState(defaultId);
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
components/organisms/tabs/Tabs.tsx:31:21
   const [tabCounter, setTabCounter] = useState(initialTabsCount + 1);
   const tabIds = tabs.map((item) => item.id);
   const tabPanelIds = tabIds.map((id) => `tabpanel_${id}`);
-  const defaultId = defaultTabId && tabIds.includes(defaultTabId) ? defaultTabId : tabIds[0];
+  const defaultId = true ? defaultTabId : tabIds[0];
   const [selectedTabId, setSelectedTabId] = useState(defaultId);
   const tabsClass = getClassName([
killedBy: Tabs Extendable Tabs should handle deleting the only tab
statusReason: Unable to find a label with the text of: Delete tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] LogicalOperator
components/organisms/tabs/Tabs.tsx:31:21
   const [tabCounter, setTabCounter] = useState(initialTabsCount + 1);
   const tabIds = tabs.map((item) => item.id);
   const tabPanelIds = tabIds.map((id) => `tabpanel_${id}`);
-  const defaultId = defaultTabId && tabIds.includes(defaultTabId) ? defaultTabId : tabIds[0];
+  const defaultId = defaultTabId || tabIds.includes(defaultTabId) ? defaultTabId : tabIds[0];
   const [selectedTabId, setSelectedTabId] = useState(defaultId);
   const tabsClass = getClassName([
killedBy: Tabs Extendable Tabs should handle deleting the only tab
statusReason: Unable to find a label with the text of: Delete tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] EqualityOperator
components/organisms/tabs/Tabs.tsx:36:27
   const tabsClass = getClassName([
     'cl-tabs',
     className,
-    { 'cl-tabs_vertical': mode === OrientationMode.Vertical },
+    { 'cl-tabs_vertical': mode !== OrientationMode.Vertical },
   ]);
 
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
components/organisms/tabs/Tabs.tsx:36:27
   const tabsClass = getClassName([
     'cl-tabs',
     className,
-    { 'cl-tabs_vertical': mode === OrientationMode.Vertical },
+    { 'cl-tabs_vertical': true },
   ]);
 
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] BlockStatement
components/organisms/tabs/Tabs.tsx:39:43
     { 'cl-tabs_vertical': mode === OrientationMode.Vertical },
   ]);
 
-  const handleTabSelect = (id: string) => {
-    setSelectedTabId(id);
-    onTabSelect?.(id);
-  };
+  const handleTabSelect = (id: string) => {};
 
   const handleTabTitleChange = (tabId: string, newTitle: string) => {
killedBy: Tabs should render another tab content when user clicks on tabs
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-labelledby="tab-1"
  class="cl-tab-content"
  data-testid="tab-content"
  id="tabpanel_tab-1"
  role="tabpanel"

[Killed] OptionalChaining
components/organisms/tabs/Tabs.tsx:41:5
 
   const handleTabSelect = (id: string) => {
     setSelectedTabId(id);
-    onTabSelect?.(id);
+    onTabSelect(id);
   };
 
killedBy: Tabs Extendable Tabs should call onTabDelete callback when tab is deleted
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab-3' ]

Number of calls: 0

[Killed] BlockStatement
components/organisms/tabs/Tabs.tsx:44:69
     onTabSelect?.(id);
   };
 
-  const handleTabTitleChange = (tabId: string, newTitle: string) => {
-    setTabs((prevTabs) =>
-      prevTabs.map((tab) => (tab.id === tabId ? { ...tab, title: newTitle } : tab)),
-    );
-    onTabTitleChange?.(tabId, newTitle);
-  };
+  const handleTabTitleChange = (tabId: string, newTitle: string) => {};
 
   const handleTabAdd = () => {
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab-1', 'New Title' ]

Number of calls: 0

[Killed] ArrowFunction
components/organisms/tabs/Tabs.tsx:45:13
   };
 
   const handleTabTitleChange = (tabId: string, newTitle: string) => {
-    setTabs((prevTabs) =>
-      prevTabs.map((tab) => (tab.id === tabId ? { ...tab, title: newTitle } : tab)),
+    setTabs(() => undefined,
     );
     onTabTitleChange?.(tabId, newTitle);
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
components/organisms/tabs/Tabs.tsx:46:20
 
   const handleTabTitleChange = (tabId: string, newTitle: string) => {
     setTabs((prevTabs) =>
-      prevTabs.map((tab) => (tab.id === tabId ? { ...tab, title: newTitle } : tab)),
+      prevTabs.map(() => undefined),
     );
     onTabTitleChange?.(tabId, newTitle);
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
components/organisms/tabs/Tabs.tsx:46:30
 
   const handleTabTitleChange = (tabId: string, newTitle: string) => {
     setTabs((prevTabs) =>
-      prevTabs.map((tab) => (tab.id === tabId ? { ...tab, title: newTitle } : tab)),
+      prevTabs.map((tab) => (tab.id !== tabId ? { ...tab, title: newTitle } : tab)),
     );
     onTabTitleChange?.(tabId, newTitle);
killedBy: Tabs Editable Tabs should update tab title internally when edited
statusReason: Found multiple elements with the text: Custom Title

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-controls="tabpanel_tab-1"
  aria-selected="false"

[Killed] OptionalChaining
components/organisms/tabs/Tabs.tsx:48:5
     setTabs((prevTabs) =>
       prevTabs.map((tab) => (tab.id === tabId ? { ...tab, title: newTitle } : tab)),
     );
-    onTabTitleChange?.(tabId, newTitle);
+    onTabTitleChange(tabId, newTitle);
   };
 
killedBy: Tabs Editable Tabs should update tab title internally when edited
statusReason: Unable to find an element with the text: Custom Title. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] BlockStatement
components/organisms/tabs/Tabs.tsx:51:30
     onTabTitleChange?.(tabId, newTitle);
   };
 
-  const handleTabAdd = () => {
-    const newTabId = `added-tab-${tabCounter}`;
-    const newTabTitle = extendedTabLabel || `Tab ${tabCounter}`;
-
-    const newTab: ChopLogicTabItem = {
-      id: newTabId,
-      title: newTabTitle,
-      content: extendedTabContent || <div></div>,
-    };
-
-    setTabs((prevTabs) => [...prevTabs, newTab]);
-    setTabCounter((prev) => prev + 1);
-
-    onTabAdd?.();
-
-    handleTabSelect(newTabId);
-  };
+  const handleTabAdd = () => {};
 
   const handleTabDelete = (tabId: string) => {
killedBy: Tabs Extendable Tabs should add new tab when add button is clicked
statusReason: expected [ …(3) ] to have a length of 4 but got 3

[Killed] ConditionalExpression
components/organisms/tabs/Tabs.tsx:53:25
 
   const handleTabAdd = () => {
     const newTabId = `added-tab-${tabCounter}`;
-    const newTabTitle = extendedTabLabel || `Tab ${tabCounter}`;
+    const newTabTitle = false;
 
     const newTab: ChopLogicTabItem = {
killedBy: Tabs Extendable Tabs should add new tab when add button is clicked
statusReason: expected [ …(3) ] to have a length of 4 but got 3

[Killed] LogicalOperator
components/organisms/tabs/Tabs.tsx:53:25
 
   const handleTabAdd = () => {
     const newTabId = `added-tab-${tabCounter}`;
-    const newTabTitle = extendedTabLabel || `Tab ${tabCounter}`;
+    const newTabTitle = extendedTabLabel && `Tab ${tabCounter}`;
 
     const newTab: ChopLogicTabItem = {
killedBy: Tabs Extendable Tabs should use extendedTabLabel for new tab title
statusReason: Unable to find an element with the text: Custom Tab Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] LogicalOperator
components/organisms/tabs/Tabs.tsx:58:16
     const newTab: ChopLogicTabItem = {
       id: newTabId,
       title: newTabTitle,
-      content: extendedTabContent || <div></div>,
+      content: extendedTabContent && <div></div>,
     };
 
killedBy: Tabs Extendable Tabs should auto-select newly added tab
statusReason: Unable to find an element with the text: New Content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
components/organisms/tabs/Tabs.tsx:58:16
     const newTab: ChopLogicTabItem = {
       id: newTabId,
       title: newTabTitle,
-      content: extendedTabContent || <div></div>,
+      content: true,
     };
 
killedBy: Tabs Extendable Tabs should auto-select newly added tab
statusReason: Unable to find an element with the text: New Content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ArrowFunction
components/organisms/tabs/Tabs.tsx:61:13
       content: extendedTabContent || <div></div>,
     };
 
-    setTabs((prevTabs) => [...prevTabs, newTab]);
+    setTabs(() => undefined);
     setTabCounter((prev) => prev + 1);
 
killedBy: Tabs Extendable Tabs should add new tab when add button is clicked
statusReason: Cannot read properties of undefined (reading 'map')

[Survived] ArrowFunction
components/organisms/tabs/Tabs.tsx:62:19
     };
 
     setTabs((prevTabs) => [...prevTabs, newTab]);
-    setTabCounter((prev) => prev + 1);
+    setTabCounter(() => undefined);
 
     onTabAdd?.();

[Survived] ArithmeticOperator
components/organisms/tabs/Tabs.tsx:62:29
     };
 
     setTabs((prevTabs) => [...prevTabs, newTab]);
-    setTabCounter((prev) => prev + 1);
+    setTabCounter((prev) => prev - 1);
 
     onTabAdd?.();

[Killed] OptionalChaining
components/organisms/tabs/Tabs.tsx:64:5
     setTabs((prevTabs) => [...prevTabs, newTab]);
     setTabCounter((prev) => prev + 1);
 
-    onTabAdd?.();
+    onTabAdd();
 
     handleTabSelect(newTabId);
killedBy: Tabs Extendable Tabs should auto-select newly added tab
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-labelledby="tab-1"
  class="cl-tab-content"
  data-testid="tab-content"
  id="tabpanel_tab-1"
  role="tabpanel"

[Killed] BlockStatement
components/organisms/tabs/Tabs.tsx:69:46
     handleTabSelect(newTabId);
   };
 
-  const handleTabDelete = (tabId: string) => {
-    setTabs((prevTabs) => prevTabs.filter((tab) => tab.id !== tabId));
-
-    if (selectedTabId === tabId) {
-      const tabIndex = tabIds.indexOf(tabId);
-      let newSelectedTabId: string | undefined;
-
-      if (tabIndex > 0) {
-        // Select the previous tab if available
-        newSelectedTabId = tabIds[tabIndex - 1];
-      } else if (tabIds.length > 1) {
-        // If deleting the first tab, select the second tab if available
-        newSelectedTabId = tabIds[1];
-      } else {
-        // No tabs left to select
-        newSelectedTabId = undefined;
-      }
-
-      if (newSelectedTabId) {
-        handleTabSelect(newSelectedTabId);
-      }
-    }
-
-    onTabDelete?.(tabId);
-  };
+  const handleTabDelete = (tabId: string) => {};
 
   return (
killedBy: Tabs Extendable Tabs should delete tab when delete button is clicked
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] MethodExpression
components/organisms/tabs/Tabs.tsx:70:27
   };
 
   const handleTabDelete = (tabId: string) => {
-    setTabs((prevTabs) => prevTabs.filter((tab) => tab.id !== tabId));
+    setTabs((prevTabs) => prevTabs);
 
     if (selectedTabId === tabId) {
killedBy: Tabs Extendable Tabs should delete tab when delete button is clicked
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
components/organisms/tabs/Tabs.tsx:70:52
   };
 
   const handleTabDelete = (tabId: string) => {
-    setTabs((prevTabs) => prevTabs.filter((tab) => tab.id !== tabId));
+    setTabs((prevTabs) => prevTabs.filter((tab) => true));
 
     if (selectedTabId === tabId) {
killedBy: Tabs Extendable Tabs should delete tab when delete button is clicked
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] BlockStatement
components/organisms/tabs/Tabs.tsx:72:34
   const handleTabDelete = (tabId: string) => {
     setTabs((prevTabs) => prevTabs.filter((tab) => tab.id !== tabId));
 
-    if (selectedTabId === tabId) {
-      const tabIndex = tabIds.indexOf(tabId);
-      let newSelectedTabId: string | undefined;
-
-      if (tabIndex > 0) {
-        // Select the previous tab if available
-        newSelectedTabId = tabIds[tabIndex - 1];
-      } else if (tabIds.length > 1) {
-        // If deleting the first tab, select the second tab if available
-        newSelectedTabId = tabIds[1];
-      } else {
-        // No tabs left to select
-        newSelectedTabId = undefined;
-      }
-
-      if (newSelectedTabId) {
-        handleTabSelect(newSelectedTabId);
-      }
-    }
+    if (selectedTabId === tabId) {}
 
     onTabDelete?.(tabId);
killedBy: Tabs Extendable Tabs should select previous tab when current tab is deleted
statusReason: Unable to find an element with the text: Content 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
components/organisms/tabs/Tabs.tsx:72:9
   const handleTabDelete = (tabId: string) => {
     setTabs((prevTabs) => prevTabs.filter((tab) => tab.id !== tabId));
 
-    if (selectedTabId === tabId) {
+    if (false) {
       const tabIndex = tabIds.indexOf(tabId);
       let newSelectedTabId: string | undefined;
killedBy: Tabs Extendable Tabs should select previous tab when current tab is deleted
statusReason: Unable to find an element with the text: Content 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] BlockStatement
components/organisms/tabs/Tabs.tsx:76:25
       const tabIndex = tabIds.indexOf(tabId);
       let newSelectedTabId: string | undefined;
 
-      if (tabIndex > 0) {
-        // Select the previous tab if available
-        newSelectedTabId = tabIds[tabIndex - 1];
-      } else if (tabIds.length > 1) {
+      if (tabIndex > 0) {} else if (tabIds.length > 1) {
         // If deleting the first tab, select the second tab if available
         newSelectedTabId = tabIds[1];
killedBy: Tabs Extendable Tabs should select previous tab when current tab is deleted
statusReason: Unable to find an element with the text: Content 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
components/organisms/tabs/Tabs.tsx:76:11
       const tabIndex = tabIds.indexOf(tabId);
       let newSelectedTabId: string | undefined;
 
-      if (tabIndex > 0) {
+      if (true) {
         // Select the previous tab if available
         newSelectedTabId = tabIds[tabIndex - 1];
killedBy: Tabs Extendable Tabs should select next tab when first tab is deleted
statusReason: Unable to find an element with the text: Content 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ArithmeticOperator
components/organisms/tabs/Tabs.tsx:78:35
 
       if (tabIndex > 0) {
         // Select the previous tab if available
-        newSelectedTabId = tabIds[tabIndex - 1];
+        newSelectedTabId = tabIds[tabIndex + 1];
       } else if (tabIds.length > 1) {
         // If deleting the first tab, select the second tab if available
killedBy: Tabs Extendable Tabs should select previous tab when current tab is deleted
statusReason: Unable to find an element with the text: Content 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] EqualityOperator
components/organisms/tabs/Tabs.tsx:79:18
       if (tabIndex > 0) {
         // Select the previous tab if available
         newSelectedTabId = tabIds[tabIndex - 1];
-      } else if (tabIds.length > 1) {
+      } else if (tabIds.length <= 1) {
         // If deleting the first tab, select the second tab if available
         newSelectedTabId = tabIds[1];
killedBy: Tabs Extendable Tabs should select next tab when first tab is deleted
statusReason: Unable to find an element with the text: Content 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] BlockStatement
components/organisms/tabs/Tabs.tsx:79:37
       if (tabIndex > 0) {
         // Select the previous tab if available
         newSelectedTabId = tabIds[tabIndex - 1];
-      } else if (tabIds.length > 1) {
-        // If deleting the first tab, select the second tab if available
-        newSelectedTabId = tabIds[1];
-      } else {
+      } else if (tabIds.length > 1) {} else {
         // No tabs left to select
         newSelectedTabId = undefined;
killedBy: Tabs Extendable Tabs should select next tab when first tab is deleted
statusReason: Unable to find an element with the text: Content 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Survived] BlockStatement
components/organisms/tabs/Tabs.tsx:82:14
       } else if (tabIds.length > 1) {
         // If deleting the first tab, select the second tab if available
         newSelectedTabId = tabIds[1];
-      } else {
-        // No tabs left to select
-        newSelectedTabId = undefined;
-      }
+      } else {}
 
       if (newSelectedTabId) {

[Killed] BlockStatement
components/organisms/tabs/Tabs.tsx:87:29
         newSelectedTabId = undefined;
       }
 
-      if (newSelectedTabId) {
-        handleTabSelect(newSelectedTabId);
-      }
+      if (newSelectedTabId) {}
     }
 
killedBy: Tabs Extendable Tabs should select previous tab when current tab is deleted
statusReason: Unable to find an element with the text: Content 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
components/organisms/tabs/Tabs.tsx:87:11
         newSelectedTabId = undefined;
       }
 
-      if (newSelectedTabId) {
+      if (false) {
         handleTabSelect(newSelectedTabId);
       }
killedBy: Tabs Extendable Tabs should select previous tab when current tab is deleted
statusReason: Unable to find an element with the text: Content 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"
