[NoCoverage] BlockStatement
organisms/tabs/__docs__/Tabs.example.tsx:4:60
 import { Tabs } from '@components/organisms';
 import type { TabsProps } from '@types';
 
-export const TabsExample: React.FC<TabsProps> = (props) => {
-  const handleTabTitleChange = (tabId: string, newTitle: string) => {
-    props.onTabTitleChange?.(tabId, newTitle);
-  };
-
-  const handleTabAdd = () => {
-    props.onTabAdd?.();
-  };
-
-  return (
-    <Tabs
-      {...props}
-      onTabTitleChange={handleTabTitleChange}
-      onTabAdd={props.extendable ? handleTabAdd : undefined}
-    />
-  );
-};
+export const TabsExample: React.FC<TabsProps> = (props) => {};
 

[NoCoverage] BlockStatement
organisms/tabs/__docs__/Tabs.example.tsx:5:69
 import type { TabsProps } from '@types';
 
 export const TabsExample: React.FC<TabsProps> = (props) => {
-  const handleTabTitleChange = (tabId: string, newTitle: string) => {
-    props.onTabTitleChange?.(tabId, newTitle);
-  };
+  const handleTabTitleChange = (tabId: string, newTitle: string) => {};
 
   const handleTabAdd = () => {

[NoCoverage] OptionalChaining
organisms/tabs/__docs__/Tabs.example.tsx:6:5
 
 export const TabsExample: React.FC<TabsProps> = (props) => {
   const handleTabTitleChange = (tabId: string, newTitle: string) => {
-    props.onTabTitleChange?.(tabId, newTitle);
+    props.onTabTitleChange(tabId, newTitle);
   };
 

[NoCoverage] BlockStatement
organisms/tabs/__docs__/Tabs.example.tsx:9:30
     props.onTabTitleChange?.(tabId, newTitle);
   };
 
-  const handleTabAdd = () => {
-    props.onTabAdd?.();
-  };
+  const handleTabAdd = () => {};
 
   return (

[NoCoverage] OptionalChaining
organisms/tabs/__docs__/Tabs.example.tsx:10:5
   };
 
   const handleTabAdd = () => {
-    props.onTabAdd?.();
+    props.onTabAdd();
   };
 
