[NoCoverage] LogicalOperator
organisms/tabs/__docs__/Tabs.stories.tsx:14:11
   return (
     <div style={{ padding: '1rem', border: '2px dashed #ccc', borderRadius: '4px' }}>
       <h3>{title}</h3>
-      <p>{content ?? defaultContent}</p>
+      <p>{content && defaultContent}</p>
     </div>
   );

[NoCoverage] BooleanLiteral
organisms/tabs/__docs__/Tabs.stories.tsx:195:16
     tabs: initialTabs,
     defaultTabId: 'tab1',
     mode: OrientationMode.Horizontal,
-    stretched: false,
+    stretched: true,
     editable: false,
     extendable: false,

[NoCoverage] BooleanLiteral
organisms/tabs/__docs__/Tabs.stories.tsx:196:15
     defaultTabId: 'tab1',
     mode: OrientationMode.Horizontal,
     stretched: false,
-    editable: false,
+    editable: true,
     extendable: false,
     extendedTabLabel: 'New Tab',

[NoCoverage] BooleanLiteral
organisms/tabs/__docs__/Tabs.stories.tsx:197:17
     mode: OrientationMode.Horizontal,
     stretched: false,
     editable: false,
-    extendable: false,
+    extendable: true,
     extendedTabLabel: 'New Tab',
   },

[NoCoverage] BooleanLiteral
organisms/tabs/__docs__/Tabs.stories.tsx:244:16
 export const Stretched: Story = {
   args: {
     mode: OrientationMode.Horizontal,
-    stretched: true,
+    stretched: false,
   },
   parameters: {

[NoCoverage] BooleanLiteral
organisms/tabs/__docs__/Tabs.stories.tsx:257:15
 
 export const Editable: Story = {
   args: {
-    editable: true,
+    editable: false,
     stretched: true,
     onTabTitleChange: (tabId: string, newTitle: string) =>

[NoCoverage] BooleanLiteral
organisms/tabs/__docs__/Tabs.stories.tsx:258:16
 export const Editable: Story = {
   args: {
     editable: true,
-    stretched: true,
+    stretched: false,
     onTabTitleChange: (tabId: string, newTitle: string) =>
       console.log(`Tab ID: ${tabId}, New Title: ${newTitle}`),

[NoCoverage] ArrowFunction
organisms/tabs/__docs__/Tabs.stories.tsx:259:23
   args: {
     editable: true,
     stretched: true,
-    onTabTitleChange: (tabId: string, newTitle: string) =>
-      console.log(`Tab ID: ${tabId}, New Title: ${newTitle}`),
+    onTabTitleChange: () => undefined,
   },
   parameters: {

[NoCoverage] BooleanLiteral
organisms/tabs/__docs__/Tabs.stories.tsx:276:17
   args: {
     editable: true,
     stretched: true,
-    extendable: true,
+    extendable: false,
     onTabTitleChange: (tabId: string, newTitle: string) =>
       console.log(`Tab ID: ${tabId}, New Title: ${newTitle}`),

[NoCoverage] ArrowFunction
organisms/tabs/__docs__/Tabs.stories.tsx:277:23
     editable: true,
     stretched: true,
     extendable: true,
-    onTabTitleChange: (tabId: string, newTitle: string) =>
-      console.log(`Tab ID: ${tabId}, New Title: ${newTitle}`),
+    onTabTitleChange: () => undefined,
     onTabAdd: () => console.log('New tab added!'),
     onTabDelete: (id: string) => console.log(`Tab deleted: ${id}`),

[NoCoverage] ArrowFunction
organisms/tabs/__docs__/Tabs.stories.tsx:279:15
     extendable: true,
     onTabTitleChange: (tabId: string, newTitle: string) =>
       console.log(`Tab ID: ${tabId}, New Title: ${newTitle}`),
-    onTabAdd: () => console.log('New tab added!'),
+    onTabAdd: () => undefined,
     onTabDelete: (id: string) => console.log(`Tab deleted: ${id}`),
     extendedTabLabel: 'New Tab',

[NoCoverage] ArrowFunction
organisms/tabs/__docs__/Tabs.stories.tsx:280:18
     onTabTitleChange: (tabId: string, newTitle: string) =>
       console.log(`Tab ID: ${tabId}, New Title: ${newTitle}`),
     onTabAdd: () => console.log('New tab added!'),
-    onTabDelete: (id: string) => console.log(`Tab deleted: ${id}`),
+    onTabDelete: () => undefined,
     extendedTabLabel: 'New Tab',
     extendedTabContent: (

[NoCoverage] BooleanLiteral
organisms/tabs/__docs__/Tabs.stories.tsx:307:19
       {
         id: 'disabled-tab',
         title: 'Disabled Tab',
-        disabled: true,
+        disabled: false,
         content: <TabContent title="Disabled Tab Content" />,
       },
