[Killed] BooleanLiteral
organisms/tabs/button/TabButton.tsx:31:16
   onTabDelete,
   tabId,
   isSelected,
-  isDisabled = false,
+  isDisabled = true,
   stretched = false,
   editable = false,
killedBy: Tabs Extendable Tabs should handle deleting the only tab
statusReason: Unable to find a label with the text of: Delete tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[NoCoverage] BooleanLiteral
organisms/tabs/button/TabButton.tsx:32:15
   tabId,
   isSelected,
   isDisabled = false,
-  stretched = false,
+  stretched = true,
   editable = false,
   extendable = false,

[Killed] BooleanLiteral
organisms/tabs/button/TabButton.tsx:38:48
   tabPanelId,
   mode,
 }) => {
-  const [isEditMode, setIsEditMode] = useState(false);
+  const [isEditMode, setIsEditMode] = useState(true);
   const [editValue, setEditValue] = useState(title);
   const inputRef = useRef<HTMLInputElement>(null);
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:42:31
   const [editValue, setEditValue] = useState(title);
   const inputRef = useRef<HTMLInputElement>(null);
   const cancelButtonId = useId();
-  const isEditToggleVisible = editable && !isDisabled && isSelected;
+  const isEditToggleVisible = false;
   const isDeleteButtonVisible = extendable && !isDisabled && !!onTabDelete && isSelected;
   const hasAdditionalButtons = isEditToggleVisible || isDeleteButtonVisible;
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Unable to find a label with the text of: Edit tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:42:31
   const [editValue, setEditValue] = useState(title);
   const inputRef = useRef<HTMLInputElement>(null);
   const cancelButtonId = useId();
-  const isEditToggleVisible = editable && !isDisabled && isSelected;
+  const isEditToggleVisible = true;
   const isDeleteButtonVisible = extendable && !isDisabled && !!onTabDelete && isSelected;
   const hasAdditionalButtons = isEditToggleVisible || isDeleteButtonVisible;
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
organisms/tabs/button/TabButton.tsx:43:47
   const inputRef = useRef<HTMLInputElement>(null);
   const cancelButtonId = useId();
   const isEditToggleVisible = editable && !isDisabled && isSelected;
-  const isDeleteButtonVisible = extendable && !isDisabled && !!onTabDelete && isSelected;
+  const isDeleteButtonVisible = extendable && isDisabled && !!onTabDelete && isSelected;
   const hasAdditionalButtons = isEditToggleVisible || isDeleteButtonVisible;
 
killedBy: Tabs Extendable Tabs should show delete buttons on tabs when extendable is true
statusReason: Unable to find a label with the text of: Delete tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:43:33
   const inputRef = useRef<HTMLInputElement>(null);
   const cancelButtonId = useId();
   const isEditToggleVisible = editable && !isDisabled && isSelected;
-  const isDeleteButtonVisible = extendable && !isDisabled && !!onTabDelete && isSelected;
+  const isDeleteButtonVisible = false;
   const hasAdditionalButtons = isEditToggleVisible || isDeleteButtonVisible;
 
killedBy: Tabs Extendable Tabs should show delete buttons on tabs when extendable is true
statusReason: Unable to find a label with the text of: Delete tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:44:32
   const cancelButtonId = useId();
   const isEditToggleVisible = editable && !isDisabled && isSelected;
   const isDeleteButtonVisible = extendable && !isDisabled && !!onTabDelete && isSelected;
-  const hasAdditionalButtons = isEditToggleVisible || isDeleteButtonVisible;
+  const hasAdditionalButtons = true;
 
   const wrapperClass = getClassName([
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:44:32
   const cancelButtonId = useId();
   const isEditToggleVisible = editable && !isDisabled && isSelected;
   const isDeleteButtonVisible = extendable && !isDisabled && !!onTabDelete && isSelected;
-  const hasAdditionalButtons = isEditToggleVisible || isDeleteButtonVisible;
+  const hasAdditionalButtons = false;
 
   const wrapperClass = getClassName([
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Unable to find a label with the text of: Edit tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] EqualityOperator
organisms/tabs/button/TabButton.tsx:50:35
     'cl-tab__wrapper',
     {
       'cl-tab__wrapper_disabled': isDisabled,
-      'cl-tab__wrapper_vertical': mode === OrientationMode.Vertical,
+      'cl-tab__wrapper_vertical': mode !== OrientationMode.Vertical,
       'cl-tab__wrapper_selected': isSelected,
       'cl-tab__wrapper_stretched': stretched,
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:50:35
     'cl-tab__wrapper',
     {
       'cl-tab__wrapper_disabled': isDisabled,
-      'cl-tab__wrapper_vertical': mode === OrientationMode.Vertical,
+      'cl-tab__wrapper_vertical': true,
       'cl-tab__wrapper_selected': isSelected,
       'cl-tab__wrapper_stretched': stretched,
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
organisms/tabs/button/TabButton.tsx:54:35
       'cl-tab__wrapper_selected': isSelected,
       'cl-tab__wrapper_stretched': stretched,
       'cl-tab__wrapper_editable': editable,
-      'cl-tab__wrapper_inactive': !isSelected,
+      'cl-tab__wrapper_inactive': isSelected,
     },
   ]);
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Survived] BlockStatement
organisms/tabs/button/TabButton.tsx:59:19
   ]);
 
   // Focus input when entering edit mode
-  useEffect(() => {
-    if (isEditMode && inputRef.current) {
-      inputRef.current.focus();
-      inputRef.current.select();
-    }
-  }, [isEditMode]);
+  useEffect(() => {}, [isEditMode]);
 
   // Sync edit value with title prop

[Killed] LogicalOperator
organisms/tabs/button/TabButton.tsx:60:9
 
   // Focus input when entering edit mode
   useEffect(() => {
-    if (isEditMode && inputRef.current) {
+    if (isEditMode || inputRef.current) {
       inputRef.current.focus();
       inputRef.current.select();
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Cannot read properties of null (reading 'focus')

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:60:9
 
   // Focus input when entering edit mode
   useEffect(() => {
-    if (isEditMode && inputRef.current) {
+    if (true) {
       inputRef.current.focus();
       inputRef.current.select();
killedBy: Tabs should match the snapshot

[Killed] BlockStatement
organisms/tabs/button/TabButton.tsx:67:19
   }, [isEditMode]);
 
   // Sync edit value with title prop
-  useEffect(() => {
-    setEditValue(title);
-  }, [title]);
+  useEffect(() => {}, [title]);
 
   const toggleEditMode = () => {
killedBy: TabButton updates title when prop changes
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Updated Title
Received:
  Test Tab

[Killed] BlockStatement
organisms/tabs/button/TabButton.tsx:71:32
     setEditValue(title);
   }, [title]);
 
-  const toggleEditMode = () => {
-    if (isDisabled) return;
-    setIsEditMode(!isEditMode);
-  };
+  const toggleEditMode = () => {};
 
   const handleTabClick = () => {
killedBy: TabButton enters edit mode when edit button is clicked
statusReason: Unable to find an element by: [data-testid="tab-edit-input"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      class="cl-tab__wrapper cl-tab__wrapper_selected cl-tab__wrapper_editable"
    >

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:72:9
   }, [title]);
 
   const toggleEditMode = () => {
-    if (isDisabled) return;
+    if (true) return;
     setIsEditMode(!isEditMode);
   };
killedBy: TabButton enters edit mode when edit button is clicked
statusReason: Unable to find an element by: [data-testid="tab-edit-input"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      class="cl-tab__wrapper cl-tab__wrapper_selected cl-tab__wrapper_editable"
    >

[Survived] ConditionalExpression
organisms/tabs/button/TabButton.tsx:72:9
   }, [title]);
 
   const toggleEditMode = () => {
-    if (isDisabled) return;
+    if (false) return;
     setIsEditMode(!isEditMode);
   };

[Killed] BooleanLiteral
organisms/tabs/button/TabButton.tsx:73:19
 
   const toggleEditMode = () => {
     if (isDisabled) return;
-    setIsEditMode(!isEditMode);
+    setIsEditMode(isEditMode);
   };
 
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Unable to find an accessible element with the role "textbox"

Here are the accessible roles:

  tablist:

  Name "":
  <div

[Killed] BlockStatement
organisms/tabs/button/TabButton.tsx:76:32
     setIsEditMode(!isEditMode);
   };
 
-  const handleTabClick = () => {
-    if (isEditMode) return; // Don't select tab while editing
-    onTabSelect(tabId);
-  };
+  const handleTabClick = () => {};
 
   const handleInputChange = (e: React.ChangeEvent<HTMLInputElement>) => {
killedBy: Tabs should render another tab content when user clicks on tabs
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-labelledby="tab-1"
  class="cl-tab-content"
  data-testid="tab-content"
  id="tabpanel_tab-1"
  role="tabpanel"

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:77:9
   };
 
   const handleTabClick = () => {
-    if (isEditMode) return; // Don't select tab while editing
+    if (true) return; // Don't select tab while editing
     onTabSelect(tabId);
   };
killedBy: Tabs should render another tab content when user clicks on tabs
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-labelledby="tab-1"
  class="cl-tab-content"
  data-testid="tab-content"
  id="tabpanel_tab-1"
  role="tabpanel"

[Survived] ConditionalExpression
organisms/tabs/button/TabButton.tsx:77:9
   };
 
   const handleTabClick = () => {
-    if (isEditMode) return; // Don't select tab while editing
+    if (false) return; // Don't select tab while editing
     onTabSelect(tabId);
   };

[Killed] BlockStatement
organisms/tabs/button/TabButton.tsx:81:73
     onTabSelect(tabId);
   };
 
-  const handleInputChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setEditValue(e.target.value);
-  };
+  const handleInputChange = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   const handleInputBlur = (e: React.FocusEvent<HTMLInputElement>) => {
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab-1', 'New Title' ]

Number of calls: 0

[Killed] BlockStatement
organisms/tabs/button/TabButton.tsx:85:70
     setEditValue(e.target.value);
   };
 
-  const handleInputBlur = (e: React.FocusEvent<HTMLInputElement>) => {
-    // Check if the blur was caused by clicking on a cancel button
-    const relatedTarget = e.relatedTarget as HTMLElement;
-    const isBlurCausedByButton = relatedTarget?.id === cancelButtonId;
-
-    // Only call onInputBlur if the blur wasn't caused by a button click
-    if (!isBlurCausedByButton) {
-      saveTitleChange();
-    }
-  };
+  const handleInputBlur = (e: React.FocusEvent<HTMLInputElement>) => {};
 
   const handleInputKeyDown = (e: React.KeyboardEvent<HTMLInputElement>) => {
killedBy: TabButton Input Blur Handling should save title change on blur when relatedTarget is not the cancel button
statusReason: expected "vi.fn()" to be called with arguments: [ 'New Title' ]

Number of calls: 0

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:88:34
   const handleInputBlur = (e: React.FocusEvent<HTMLInputElement>) => {
     // Check if the blur was caused by clicking on a cancel button
     const relatedTarget = e.relatedTarget as HTMLElement;
-    const isBlurCausedByButton = relatedTarget?.id === cancelButtonId;
+    const isBlurCausedByButton = true;
 
     // Only call onInputBlur if the blur wasn't caused by a button click
killedBy: TabButton Input Blur Handling should save title change on blur when relatedTarget is not the cancel button
statusReason: expected "vi.fn()" to be called with arguments: [ 'New Title' ]

Number of calls: 0

[Killed] EqualityOperator
organisms/tabs/button/TabButton.tsx:88:34
   const handleInputBlur = (e: React.FocusEvent<HTMLInputElement>) => {
     // Check if the blur was caused by clicking on a cancel button
     const relatedTarget = e.relatedTarget as HTMLElement;
-    const isBlurCausedByButton = relatedTarget?.id === cancelButtonId;
+    const isBlurCausedByButton = relatedTarget?.id !== cancelButtonId;
 
     // Only call onInputBlur if the blur wasn't caused by a button click
killedBy: TabButton Input Blur Handling should save title change on blur when relatedTarget is not the cancel button
statusReason: expected "vi.fn()" to be called with arguments: [ 'New Title' ]

Number of calls: 0

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:91:9
     const isBlurCausedByButton = relatedTarget?.id === cancelButtonId;
 
     // Only call onInputBlur if the blur wasn't caused by a button click
-    if (!isBlurCausedByButton) {
+    if (false) {
       saveTitleChange();
     }
killedBy: TabButton Input Blur Handling should save title change on blur when relatedTarget is not the cancel button
statusReason: expected "vi.fn()" to be called with arguments: [ 'New Title' ]

Number of calls: 0

[Killed] BooleanLiteral
organisms/tabs/button/TabButton.tsx:91:9
     const isBlurCausedByButton = relatedTarget?.id === cancelButtonId;
 
     // Only call onInputBlur if the blur wasn't caused by a button click
-    if (!isBlurCausedByButton) {
+    if (isBlurCausedByButton) {
       saveTitleChange();
     }
killedBy: Tabs Editable Tabs should cancel tab editing on click cancel button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  aria-controls="tabpanel_tab-2"
  aria-selected="true"
  class="cl-tab"
  id="tab-2"
  role="tab"

[Killed] BlockStatement
organisms/tabs/button/TabButton.tsx:96:76
     }
   };
 
-  const handleInputKeyDown = (e: React.KeyboardEvent<HTMLInputElement>) => {
-    if (e.key === 'Enter') {
-      e.preventDefault();
-      saveTitleChange();
-    } else if (e.key === 'Escape') {
-      e.preventDefault();
-      cancelEdit();
-    }
-  };
+  const handleInputKeyDown = (e: React.KeyboardEvent<HTMLInputElement>) => {};
 
   const saveTitleChange = () => {
killedBy: TabButton Edit Mode saves changes when Enter key is pressed
statusReason: expected "vi.fn()" to be called with arguments: [ 'New Title' ]

Number of calls: 0

[Killed] EqualityOperator
organisms/tabs/button/TabButton.tsx:97:9
   };
 
   const handleInputKeyDown = (e: React.KeyboardEvent<HTMLInputElement>) => {
-    if (e.key === 'Enter') {
+    if (e.key !== 'Enter') {
       e.preventDefault();
       saveTitleChange();
killedBy: TabButton Edit Mode saves changes when Enter key is pressed
statusReason: expected "vi.fn()" to be called with arguments: [ 'New Title' ]

Number of calls: 0

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:97:9
   };
 
   const handleInputKeyDown = (e: React.KeyboardEvent<HTMLInputElement>) => {
-    if (e.key === 'Enter') {
+    if (true) {
       e.preventDefault();
       saveTitleChange();
killedBy: TabButton Edit Mode cancels edit when Escape key is pressed
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "New Title",

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:100:16
     if (e.key === 'Enter') {
       e.preventDefault();
       saveTitleChange();
-    } else if (e.key === 'Escape') {
+    } else if (true) {
       e.preventDefault();
       cancelEdit();
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab-1', 'New Title' ]

Number of calls: 0

[Killed] EqualityOperator
organisms/tabs/button/TabButton.tsx:100:16
     if (e.key === 'Enter') {
       e.preventDefault();
       saveTitleChange();
-    } else if (e.key === 'Escape') {
+    } else if (e.key !== 'Escape') {
       e.preventDefault();
       cancelEdit();
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab-1', 'New Title' ]

Number of calls: 0

[Killed] BlockStatement
organisms/tabs/button/TabButton.tsx:106:33
     }
   };
 
-  const saveTitleChange = () => {
-    if (editValue.trim() && editValue !== title) {
-      onTabTitleChange?.(editValue.trim());
-    } else {
-      // Reset to original title if empty or unchanged
-      setEditValue(title);
-    }
-    setIsEditMode(false);
-  };
+  const saveTitleChange = () => {};
 
   const cancelEdit = () => {
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab-1', 'New Title' ]

Number of calls: 0

[Killed] LogicalOperator
organisms/tabs/button/TabButton.tsx:107:9
   };
 
   const saveTitleChange = () => {
-    if (editValue.trim() && editValue !== title) {
+    if (editValue.trim() || editValue !== title) {
       onTabTitleChange?.(editValue.trim());
     } else {
killedBy: TabButton Edit Mode does not save empty title
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "",

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:107:29
   };
 
   const saveTitleChange = () => {
-    if (editValue.trim() && editValue !== title) {
+    if (editValue.trim() && true) {
       onTabTitleChange?.(editValue.trim());
     } else {
killedBy: TabButton Edit Mode does not save unchanged title
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "Test Tab",

[Killed] MethodExpression
organisms/tabs/button/TabButton.tsx:108:26
 
   const saveTitleChange = () => {
     if (editValue.trim() && editValue !== title) {
-      onTabTitleChange?.(editValue.trim());
+      onTabTitleChange?.(editValue);
     } else {
       // Reset to original title if empty or unchanged
killedBy: Tabs Editable Tabs should trim the entered value
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab-1', 'New Title' ]

Received: 

  1st vi.fn() call:

  [
    "tab-1",

[Survived] OptionalChaining
organisms/tabs/button/TabButton.tsx:108:7
 
   const saveTitleChange = () => {
     if (editValue.trim() && editValue !== title) {
-      onTabTitleChange?.(editValue.trim());
+      onTabTitleChange(editValue.trim());
     } else {
       // Reset to original title if empty or unchanged

[Killed] BlockStatement
organisms/tabs/button/TabButton.tsx:109:12
   const saveTitleChange = () => {
     if (editValue.trim() && editValue !== title) {
       onTabTitleChange?.(editValue.trim());
-    } else {
-      // Reset to original title if empty or unchanged
-      setEditValue(title);
-    }
+    } else {}
     setIsEditMode(false);
   };
killedBy: TabButton Input Blur Handling should reset to original title on blur with empty value
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Test Tab
Received:

[Killed] BooleanLiteral
organisms/tabs/button/TabButton.tsx:113:19
       // Reset to original title if empty or unchanged
       setEditValue(title);
     }
-    setIsEditMode(false);
+    setIsEditMode(true);
   };
 
killedBy: Tabs Editable Tabs should update tab title internally when edited
statusReason: Unable to find an element with the text: Custom Title. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] BlockStatement
organisms/tabs/button/TabButton.tsx:116:28
     setIsEditMode(false);
   };
 
-  const cancelEdit = () => {
-    setEditValue(title);
-    setIsEditMode(false);
-  };
+  const cancelEdit = () => {};
 
   return (
killedBy: Tabs Editable Tabs should cancel tab editing on click cancel button
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] BooleanLiteral
organisms/tabs/button/TabButton.tsx:118:19
 
   const cancelEdit = () => {
     setEditValue(title);
-    setIsEditMode(false);
+    setIsEditMode(true);
   };
 
killedBy: Tabs Editable Tabs should cancel tab editing on click cancel button
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:148:12
           >
             {editValue}
           </button>
-          {hasAdditionalButtons && (
-            <span className="cl-tab__buttons">
-              {isEditToggleVisible && (
-                <Button
-                  view={ButtonView.Icon}
-                  icon={IconName.Edit3}
-                  onClick={toggleEditMode}
-                  label="Edit tab"
-                  tooltip="Edit tab"
-                  iconSize={ElementSize.Small}
-                />
-              )}
-              {isDeleteButtonVisible && (
-                <Button
-                  view={ButtonView.Icon}
-                  icon={IconName.Trash2}
-                  onClick={() => onTabDelete?.(tabId)}
-                  label="Delete tab"
-                  tooltip="Delete tab"
-                  iconSize={ElementSize.Small}
-                />
-              )}
-            </span>
-          )}
+          {true}
         </>
       )}
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Unable to find a label with the text of: Edit tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:148:12
           >
             {editValue}
           </button>
-          {hasAdditionalButtons && (
-            <span className="cl-tab__buttons">
-              {isEditToggleVisible && (
-                <Button
-                  view={ButtonView.Icon}
-                  icon={IconName.Edit3}
-                  onClick={toggleEditMode}
-                  label="Edit tab"
-                  tooltip="Edit tab"
-                  iconSize={ElementSize.Small}
-                />
-              )}
-              {isDeleteButtonVisible && (
-                <Button
-                  view={ButtonView.Icon}
-                  icon={IconName.Trash2}
-                  onClick={() => onTabDelete?.(tabId)}
-                  label="Delete tab"
-                  tooltip="Delete tab"
-                  iconSize={ElementSize.Small}
-                />
-              )}
-            </span>
-          )}
+          {false}
         </>
       )}
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Unable to find a label with the text of: Edit tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:150:16
           </button>
           {hasAdditionalButtons && (
             <span className="cl-tab__buttons">
-              {isEditToggleVisible && (
-                <Button
-                  view={ButtonView.Icon}
-                  icon={IconName.Edit3}
-                  onClick={toggleEditMode}
-                  label="Edit tab"
-                  tooltip="Edit tab"
-                  iconSize={ElementSize.Small}
-                />
-              )}
+              {false}
               {isDeleteButtonVisible && (
                 <Button
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Unable to find a label with the text of: Edit tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:150:16
           </button>
           {hasAdditionalButtons && (
             <span className="cl-tab__buttons">
-              {isEditToggleVisible && (
-                <Button
-                  view={ButtonView.Icon}
-                  icon={IconName.Edit3}
-                  onClick={toggleEditMode}
-                  label="Edit tab"
-                  tooltip="Edit tab"
-                  iconSize={ElementSize.Small}
-                />
-              )}
+              {true}
               {isDeleteButtonVisible && (
                 <Button
killedBy: TabButton shows edit button when editable and selected
statusReason: Unable to find an element by: [data-testid="button-chop-icon__edit-3"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      class="cl-tab__wrapper cl-tab__wrapper_selected cl-tab__wrapper_editable"
    >

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:160:16
                   iconSize={ElementSize.Small}
                 />
               )}
-              {isDeleteButtonVisible && (
-                <Button
-                  view={ButtonView.Icon}
-                  icon={IconName.Trash2}
-                  onClick={() => onTabDelete?.(tabId)}
-                  label="Delete tab"
-                  tooltip="Delete tab"
-                  iconSize={ElementSize.Small}
-                />
-              )}
+              {false}
             </span>
           )}
killedBy: Tabs Extendable Tabs should show delete buttons on tabs when extendable is true
statusReason: Unable to find a label with the text of: Delete tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ConditionalExpression
organisms/tabs/button/TabButton.tsx:160:16
                   iconSize={ElementSize.Small}
                 />
               )}
-              {isDeleteButtonVisible && (
-                <Button
-                  view={ButtonView.Icon}
-                  icon={IconName.Trash2}
-                  onClick={() => onTabDelete?.(tabId)}
-                  label="Delete tab"
-                  tooltip="Delete tab"
-                  iconSize={ElementSize.Small}
-                />
-              )}
+              {true}
             </span>
           )}
killedBy: Tabs Extendable Tabs should show delete buttons on tabs when extendable is true
statusReason: Unable to find a label with the text of: Delete tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] ArrowFunction
organisms/tabs/button/TabButton.tsx:164:28
                 <Button
                   view={ButtonView.Icon}
                   icon={IconName.Trash2}
-                  onClick={() => onTabDelete?.(tabId)}
+                  onClick={() => undefined}
                   label="Delete tab"
                   tooltip="Delete tab"
killedBy: Tabs Extendable Tabs should delete tab when delete button is clicked
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Survived] OptionalChaining
organisms/tabs/button/TabButton.tsx:164:34
                 <Button
                   view={ButtonView.Icon}
                   icon={IconName.Trash2}
-                  onClick={() => onTabDelete?.(tabId)}
+                  onClick={() => onTabDelete(tabId)}
                   label="Delete tab"
                   tooltip="Delete tab"
