[NoCoverage] BooleanLiteral
organisms/tabs/list/TabList.tsx:34:14
   mode,
   tabIds,
   stretched,
-  editable = false,
+  editable = true,
   extendable = false,
   onTabAdd,

[Killed] ArrayDeclaration
organisms/tabs/list/TabList.tsx:39:34
   onTabAdd,
   onTabDelete,
 }) => {
-  const listClass = getClassName([
-    'cl-tab-list',
-    { 'cl-tab-list_vertical': mode === OrientationMode.Vertical },
-  ]);
+  const listClass = getClassName([]);
 
   const handleListKeyDown = (e: KeyboardEvent<HTMLDivElement>) => {
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] EqualityOperator
organisms/tabs/list/TabList.tsx:41:31
 }) => {
   const listClass = getClassName([
     'cl-tab-list',
-    { 'cl-tab-list_vertical': mode === OrientationMode.Vertical },
+    { 'cl-tab-list_vertical': mode !== OrientationMode.Vertical },
   ]);
 
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/tabs/list/TabList.tsx:41:31
 }) => {
   const listClass = getClassName([
     'cl-tab-list',
-    { 'cl-tab-list_vertical': mode === OrientationMode.Vertical },
+    { 'cl-tab-list_vertical': true },
   ]);
 
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/tabs/list/TabList.tsx:48:9
     const currentFocusedTabIndex = tabIds.indexOf(selectedTabId);
 
     // Early return for non-navigation keys
-    if (!['ArrowLeft', 'ArrowUp', 'ArrowRight', 'ArrowDown'].includes(e.key)) {
+    if (true) {
       return;
     }
killedBy: Tabs should render another tab content when user switches tabs via keyboard
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-labelledby="tab-1"
  class="cl-tab-content"
  data-testid="tab-content"
  id="tabpanel_tab-1"
  role="tabpanel"

[Killed] ConditionalExpression
organisms/tabs/list/TabList.tsx:48:9
     const currentFocusedTabIndex = tabIds.indexOf(selectedTabId);
 
     // Early return for non-navigation keys
-    if (!['ArrowLeft', 'ArrowUp', 'ArrowRight', 'ArrowDown'].includes(e.key)) {
+    if (false) {
       return;
     }
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab-1', 'New Title' ]

Number of calls: 0

[Killed] EqualityOperator
organisms/tabs/list/TabList.tsx:56:31
 
     // Check if key should be ignored based on mode
     if (
-      (e.key === 'ArrowUp' && mode === OrientationMode.Horizontal) ||
+      (e.key === 'ArrowUp' && mode !== OrientationMode.Horizontal) ||
       (e.key === 'ArrowLeft' && mode === OrientationMode.Vertical)
     ) {
killedBy: TabList Keyboard Navigation - Vertical Mode navigates to previous tab with ArrowUp
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab1' ]

Number of calls: 0

[Killed] LogicalOperator
organisms/tabs/list/TabList.tsx:56:8
 
     // Check if key should be ignored based on mode
     if (
-      (e.key === 'ArrowUp' && mode === OrientationMode.Horizontal) ||
+      (e.key === 'ArrowUp' || mode === OrientationMode.Horizontal) ||
       (e.key === 'ArrowLeft' && mode === OrientationMode.Vertical)
     ) {
killedBy: TabList Keyboard Navigation - Horizontal Mode navigates to next tab with ArrowRight
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab2' ]

Number of calls: 0

[Killed] EqualityOperator
organisms/tabs/list/TabList.tsx:57:33
     // Check if key should be ignored based on mode
     if (
       (e.key === 'ArrowUp' && mode === OrientationMode.Horizontal) ||
-      (e.key === 'ArrowLeft' && mode === OrientationMode.Vertical)
+      (e.key === 'ArrowLeft' && mode !== OrientationMode.Vertical)
     ) {
       return;
killedBy: TabList Keyboard Navigation - Horizontal Mode navigates to previous tab with ArrowLeft
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab1' ]

Number of calls: 0

[Killed] EqualityOperator
organisms/tabs/list/TabList.tsx:57:8
     // Check if key should be ignored based on mode
     if (
       (e.key === 'ArrowUp' && mode === OrientationMode.Horizontal) ||
-      (e.key === 'ArrowLeft' && mode === OrientationMode.Vertical)
+      (e.key !== 'ArrowLeft' && mode === OrientationMode.Vertical)
     ) {
       return;
killedBy: TabList Keyboard Navigation - Vertical Mode navigates to next tab with ArrowDown
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab2' ]

Number of calls: 0

[NoCoverage] BlockStatement
organisms/tabs/list/TabList.tsx:58:7
     if (
       (e.key === 'ArrowUp' && mode === OrientationMode.Horizontal) ||
       (e.key === 'ArrowLeft' && mode === OrientationMode.Vertical)
-    ) {
-      return;
-    }
+    ) {}
 
     const isPrevious = e.key === 'ArrowLeft' || e.key === 'ArrowUp';

[Killed] EqualityOperator
organisms/tabs/list/TabList.tsx:62:49
       return;
     }
 
-    const isPrevious = e.key === 'ArrowLeft' || e.key === 'ArrowUp';
+    const isPrevious = e.key === 'ArrowLeft' || e.key !== 'ArrowUp';
     const newIndex = isPrevious
       ? getPreviousIndex(currentFocusedTabIndex, tabIds.length)
killedBy: TabList Keyboard Navigation - Horizontal Mode navigates to next tab with ArrowRight
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab2' ]

Received: 

  1st vi.fn() call:

  [
-   "tab2",

[Killed] EqualityOperator
organisms/tabs/list/TabList.tsx:62:24
       return;
     }
 
-    const isPrevious = e.key === 'ArrowLeft' || e.key === 'ArrowUp';
+    const isPrevious = e.key !== 'ArrowLeft' || e.key === 'ArrowUp';
     const newIndex = isPrevious
       ? getPreviousIndex(currentFocusedTabIndex, tabIds.length)
killedBy: TabList Keyboard Navigation - Horizontal Mode navigates to next tab with ArrowRight
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab2' ]

Received: 

  1st vi.fn() call:

  [
-   "tab2",

[Killed] BlockStatement
organisms/tabs/list/TabList.tsx:68:19
       : getNextIndex(currentFocusedTabIndex, tabIds.length);
 
     const newTabId = tabIds[newIndex];
-    if (newTabId) {
-      moveFocusOnElementById(newTabId);
-      onTabSelect(newTabId);
-    }
+    if (newTabId) {}
   };
 
killedBy: TabList Keyboard Navigation - Horizontal Mode navigates to next tab with ArrowRight
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab2' ]

Number of calls: 0

[Killed] ConditionalExpression
organisms/tabs/list/TabList.tsx:68:9
       : getNextIndex(currentFocusedTabIndex, tabIds.length);
 
     const newTabId = tabIds[newIndex];
-    if (newTabId) {
+    if (false) {
       moveFocusOnElementById(newTabId);
       onTabSelect(newTabId);
killedBy: TabList Keyboard Navigation - Horizontal Mode navigates to next tab with ArrowRight
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab2' ]

Number of calls: 0

[Killed] BlockStatement
organisms/tabs/list/TabList.tsx:74:81
     }
   };
 
-  const getPreviousIndex = (currentIndex: number, totalTabs: number): number => {
-    return currentIndex - 1 >= 0 ? currentIndex - 1 : totalTabs - 1;
-  };
+  const getPreviousIndex = (currentIndex: number, totalTabs: number): number => {};
 
   const getNextIndex = (currentIndex: number, totalTabs: number): number => {
killedBy: TabList Keyboard Navigation - Horizontal Mode navigates to previous tab with ArrowLeft
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab1' ]

Number of calls: 0

[Killed] ConditionalExpression
organisms/tabs/list/TabList.tsx:75:12
   };
 
   const getPreviousIndex = (currentIndex: number, totalTabs: number): number => {
-    return currentIndex - 1 >= 0 ? currentIndex - 1 : totalTabs - 1;
+    return true ? currentIndex - 1 : totalTabs - 1;
   };
 
killedBy: TabList Keyboard Navigation - Horizontal Mode wraps to last tab when ArrowLeft on first tab
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab3' ]

Number of calls: 0

[Killed] ArithmeticOperator
organisms/tabs/list/TabList.tsx:75:55
   };
 
   const getPreviousIndex = (currentIndex: number, totalTabs: number): number => {
-    return currentIndex - 1 >= 0 ? currentIndex - 1 : totalTabs - 1;
+    return currentIndex - 1 >= 0 ? currentIndex - 1 : totalTabs + 1;
   };
 
killedBy: TabList Keyboard Navigation - Horizontal Mode wraps to last tab when ArrowLeft on first tab
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab3' ]

Number of calls: 0

[Killed] BlockStatement
organisms/tabs/list/TabList.tsx:78:77
     return currentIndex - 1 >= 0 ? currentIndex - 1 : totalTabs - 1;
   };
 
-  const getNextIndex = (currentIndex: number, totalTabs: number): number => {
-    return currentIndex === totalTabs - 1 ? 0 : currentIndex + 1;
-  };
+  const getNextIndex = (currentIndex: number, totalTabs: number): number => {};
 
   return (
killedBy: TabList Keyboard Navigation - Horizontal Mode navigates to next tab with ArrowRight
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab2' ]

Number of calls: 0

[Killed] ArithmeticOperator
organisms/tabs/list/TabList.tsx:79:49
   };
 
   const getNextIndex = (currentIndex: number, totalTabs: number): number => {
-    return currentIndex === totalTabs - 1 ? 0 : currentIndex + 1;
+    return currentIndex === totalTabs - 1 ? 0 : currentIndex - 1;
   };
 
killedBy: TabList Keyboard Navigation - Horizontal Mode navigates to next tab with ArrowRight
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab2' ]

Number of calls: 0

[Killed] EqualityOperator
organisms/tabs/list/TabList.tsx:79:12
   };
 
   const getNextIndex = (currentIndex: number, totalTabs: number): number => {
-    return currentIndex === totalTabs - 1 ? 0 : currentIndex + 1;
+    return currentIndex !== totalTabs - 1 ? 0 : currentIndex + 1;
   };
 
killedBy: TabList Keyboard Navigation - Horizontal Mode navigates to next tab with ArrowRight
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab2' ]

Received: 

  1st vi.fn() call:

  [
-   "tab2",

[Killed] BlockStatement
organisms/tabs/list/TabList.tsx:84:53
 
   return (
     <div role="tablist" data-testid="tab-list" onKeyDown={handleListKeyDown} className={listClass}>
-      {tabs.map(({ id, title, disabled }, index) => {
-        return (
-          <TabButton
-            key={id}
-            title={title}
-            onTabSelect={onTabSelect}
-            onTabTitleChange={
-              onTabTitleChange ? (newTitle) => onTabTitleChange(id, newTitle) : undefined
-            }
-            tabId={id}
-            isSelected={id === selectedTabId}
-            isDisabled={disabled}
-            tabPanelId={tabPanelIds[index]}
-            mode={mode}
-            stretched={stretched}
-            editable={editable}
-            extendable={extendable}
-            onTabDelete={onTabDelete}
-          />
-        );
-      })}
+      {tabs.map(({ id, title, disabled }, index) => {})}
       {extendable && (
         <Button
killedBy: TabList renders all tab buttons
statusReason: Unable to find an element by: [data-testid="tab-button-tab1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="tab-list"
      role="tablist"

[Killed] ArrowFunction
organisms/tabs/list/TabList.tsx:91:34
             title={title}
             onTabSelect={onTabSelect}
             onTabTitleChange={
-              onTabTitleChange ? (newTitle) => onTabTitleChange(id, newTitle) : undefined
+              onTabTitleChange ? () => undefined : undefined
             }
             tabId={id}
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: expected "vi.fn()" to be called with arguments: [ 'tab-1', 'New Title' ]

Number of calls: 0

[Killed] EqualityOperator
organisms/tabs/list/TabList.tsx:94:25
               onTabTitleChange ? (newTitle) => onTabTitleChange(id, newTitle) : undefined
             }
             tabId={id}
-            isSelected={id === selectedTabId}
+            isSelected={id !== selectedTabId}
             isDisabled={disabled}
             tabPanelId={tabPanelIds[index]}
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/tabs/list/TabList.tsx:94:25
               onTabTitleChange ? (newTitle) => onTabTitleChange(id, newTitle) : undefined
             }
             tabId={id}
-            isSelected={id === selectedTabId}
+            isSelected={true}
             isDisabled={disabled}
             tabPanelId={tabPanelIds[index]}
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/tabs/list/TabList.tsx:105:8
           />
         );
       })}
-      {extendable && (
-        <Button
-          label="Add Tab"
-          tooltip="Add Tab"
-          view={ButtonView.Icon}
-          icon={IconName.PlusCircle}
-          onClick={onTabAdd}
-        />
-      )}
+      {false}
     </div>
   );
killedBy: Tabs Extendable Tabs should show add button when extendable is true
statusReason: Unable to find a label with the text of: Add Tab

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-tabs test-class"
      id="tabs-id"

[Killed] LogicalOperator
organisms/tabs/list/TabList.tsx:105:8
           />
         );
       })}
-      {extendable && (
-        <Button
-          label="Add Tab"
-          tooltip="Add Tab"
-          view={ButtonView.Icon}
-          icon={IconName.PlusCircle}
-          onClick={onTabAdd}
-        />
-      )}
+      {extendable || <Button label="Add Tab" tooltip="Add Tab" view={ButtonView.Icon} icon={IconName.PlusCircle} onClick={onTabAdd} />}
     </div>
   );
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched
