[NoCoverage] BooleanLiteral
hooks/use-auto-close/__docs__/use-auto-close.example.tsx:8:44
 import { type FC, useState } from 'react';
 
 export const UseAutoCloseExample: FC = () => {
-  const [isOpened, setIsOpened] = useState(false);
+  const [isOpened, setIsOpened] = useState(true);
 
   const handleOpen = () => setIsOpened(true);

[NoCoverage] BlockStatement
hooks/use-auto-close/__docs__/use-auto-close.example.tsx:11:29
   const [isOpened, setIsOpened] = useState(false);
 
   const handleOpen = () => setIsOpened(true);
-  const handleClose = () => {
-    setIsOpened(false);
-  };
+  const handleClose = () => {};
 
   useAutoClose({
