[NoCoverage] BooleanLiteral
src/hooks/use-auto-close/use-auto-close.ts:6:15
 export const useAutoClose = ({
   isOpened,
   onClose,
-  autoClose = true,
+  autoClose = false,
   autoCloseDelay = 3000,
 }: {

[Killed] BlockStatement
src/hooks/use-auto-close/use-auto-close.ts:13:7
   onClose: () => void;
   autoClose?: boolean;
   autoCloseDelay?: number;
-}) => {
-  useEffect(() => {
-    if (!isOpened || !autoClose) return;
-
-    const timer = setTimeout(() => {
-      onClose();
-    }, autoCloseDelay);
-
-    return () => clearTimeout(timer);
-  }, [isOpened, autoClose, autoCloseDelay, onClose]);
-};
+}) => {};
 
killedBy: useAutoClose hook should call onClose after default delay (3000ms)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/hooks/use-auto-close/use-auto-close.ts:14:19
   autoClose?: boolean;
   autoCloseDelay?: number;
 }) => {
-  useEffect(() => {
-    if (!isOpened || !autoClose) return;
-
-    const timer = setTimeout(() => {
-      onClose();
-    }, autoCloseDelay);
-
-    return () => clearTimeout(timer);
-  }, [isOpened, autoClose, autoCloseDelay, onClose]);
+  useEffect(() => {}, [isOpened, autoClose, autoCloseDelay, onClose]);
 };
 
killedBy: useAutoClose hook should call onClose after default delay (3000ms)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/hooks/use-auto-close/use-auto-close.ts:15:22
   autoCloseDelay?: number;
 }) => {
   useEffect(() => {
-    if (!isOpened || !autoClose) return;
+    if (!isOpened || autoClose) return;
 
     const timer = setTimeout(() => {
killedBy: useAutoClose hook should not call onClose when autoClose is false
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[Killed] ConditionalExpression
src/hooks/use-auto-close/use-auto-close.ts:15:9
   autoCloseDelay?: number;
 }) => {
   useEffect(() => {
-    if (!isOpened || !autoClose) return;
+    if (true) return;
 
     const timer = setTimeout(() => {
killedBy: useAutoClose hook should call onClose after default delay (3000ms)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/hooks/use-auto-close/use-auto-close.ts:17:36
   useEffect(() => {
     if (!isOpened || !autoClose) return;
 
-    const timer = setTimeout(() => {
-      onClose();
-    }, autoCloseDelay);
+    const timer = setTimeout(() => {}, autoCloseDelay);
 
     return () => clearTimeout(timer);
killedBy: useAutoClose hook should call onClose after default delay (3000ms)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/hooks/use-auto-close/use-auto-close.ts:21:12
       onClose();
     }, autoCloseDelay);
 
-    return () => clearTimeout(timer);
+    return () => undefined;
   }, [isOpened, autoClose, autoCloseDelay, onClose]);
 };
killedBy: useAutoClose hook should clear timeout when unmounted
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []
