[NoCoverage] BlockStatement
hooks/use-click-outside/__docs__/use-click-outside.example.tsx:6:45
 
 import { useClickOutside } from '../use-click-outside';
 
-export const UseClickOutsideExample = () => {
-  const ref = useRef(null);
-  useClickOutside({
-    ref,
-    onClickOutsideHandler: () => alert('Clicked outside!'),
-  });
-
-  return (
-    <div className="container" ref={ref}>
-      Click outside this box to trigger the handler.
-    </div>
-  );
-};
+export const UseClickOutsideExample = () => {};
 

[NoCoverage] ArrowFunction
hooks/use-click-outside/__docs__/use-click-outside.example.tsx:10:28
   const ref = useRef(null);
   useClickOutside({
     ref,
-    onClickOutsideHandler: () => alert('Clicked outside!'),
+    onClickOutsideHandler: () => undefined,
   });
 
