[NoCoverage] BlockStatement
hooks/use-container-dimensions/__docs__/use-container-dimensions.example.tsx:6:52
 
 import { useContainerDimensions } from '../use-container-dimensions';
 
-export const UseContainerDimensionsExample = () => {
-  const ref = useRef(null);
-  const { width, height } = useContainerDimensions({ ref, isVisible: true });
-
-  return (
-    <div ref={ref} className="container">
-      Width: {width}px, Height: {height}px
-    </div>
-  );
-};
+export const UseContainerDimensionsExample = () => {};
 

[NoCoverage] BooleanLiteral
hooks/use-container-dimensions/__docs__/use-container-dimensions.example.tsx:8:70
 
 export const UseContainerDimensionsExample = () => {
   const ref = useRef(null);
-  const { width, height } = useContainerDimensions({ ref, isVisible: true });
+  const { width, height } = useContainerDimensions({ ref, isVisible: false });
 
   return (
