[NoCoverage] ArrowFunction
hooks/use-debounce/__docs__/use-debounce.example.tsx:27:21
           id={typeInputId}
           type="text"
           value={inputValue}
-          onChange={(e) => setInputValue(e.target.value)}
+          onChange={() => undefined}
           placeholder="Start typing..."
           style={{

[NoCoverage] ArrowFunction
hooks/use-debounce/__docs__/use-debounce.example.tsx:50:21
           max="2000"
           step="100"
           value={delay}
-          onChange={(e) => setDelay(Number(e.target.value))}
+          onChange={() => undefined}
           style={{ width: '100%', maxWidth: '300px' }}
         />

[NoCoverage] ConditionalExpression
hooks/use-debounce/__docs__/use-debounce.example.tsx:80:69
           >
             Instant Value
           </div>
-          <div style={{ fontWeight: 'bold', minHeight: '1.5rem' }}>{inputValue || '(empty)'}</div>
+          <div style={{ fontWeight: 'bold', minHeight: '1.5rem' }}>{false}</div>
         </div>
         <div

[NoCoverage] LogicalOperator
hooks/use-debounce/__docs__/use-debounce.example.tsx:80:69
           >
             Instant Value
           </div>
-          <div style={{ fontWeight: 'bold', minHeight: '1.5rem' }}>{inputValue || '(empty)'}</div>
+          <div style={{ fontWeight: 'bold', minHeight: '1.5rem' }}>{inputValue && '(empty)'}</div>
         </div>
         <div

[NoCoverage] ConditionalExpression
hooks/use-debounce/__docs__/use-debounce.example.tsx:106:14
               color: '#2196f3',
             }}
           >
-            {debouncedValue || '(empty)'}
+            {true}
           </div>
         </div>

[NoCoverage] LogicalOperator
hooks/use-debounce/__docs__/use-debounce.example.tsx:106:14
               color: '#2196f3',
             }}
           >
-            {debouncedValue || '(empty)'}
+            {debouncedValue && '(empty)'}
           </div>
         </div>
