[NoCoverage] ArrowFunction
hooks/use-debounce/__docs__/use-debounce.stories.tsx:31:11
 type Story = StoryObj<typeof InteractiveDebounceDemo>;
 
 export const InteractiveDemo: Story = {
-  render: () => <InteractiveDebounceDemo delay={500} value={0} />,
+  render: () => undefined,
   parameters: {
     docs: {
