[NoCoverage] ArrowFunction
hooks/use-is-hovered/__docs__/use-is-hovered.example.tsx:50:19
         id={toggleId}
         label="Enable hover tracking"
         name={toggleId}
-        onChange={(e) => setIsMounted(e.target.checked)}
+        onChange={() => undefined}
         style={{ justifyContent: 'center' }}
         defaultChecked={isMounted}
