[NoCoverage] BooleanLiteral
hooks/use-is-hovered/__docs__/use-is-hovered.stories.tsx:24:50
 type Story = StoryObj<typeof InteractiveHoverDemo>;
 
 export const InteractiveDemo: Story = {
-  render: () => <InteractiveHoverDemo isMounted={true} />,
+  render: () => <InteractiveHoverDemo isMounted={false} />,
   parameters: {
     docs: {

[NoCoverage] ArrowFunction
hooks/use-is-hovered/__docs__/use-is-hovered.stories.tsx:24:11
 type Story = StoryObj<typeof InteractiveHoverDemo>;
 
 export const InteractiveDemo: Story = {
-  render: () => <InteractiveHoverDemo isMounted={true} />,
+  render: () => undefined,
   parameters: {
     docs: {
