[NoCoverage] BooleanLiteral
hooks/use-is-mounted/__docs__/use-is-mounted.example.tsx:9:44
 import { useIsMounted } from '../use-is-mounted';
 
 export const UseIsMountedExample = () => {
-  const [isOpened, setIsOpened] = useState(false);
+  const [isOpened, setIsOpened] = useState(true);
   const isMounted = useIsMounted(isOpened, 1000);
 

[NoCoverage] ArrowFunction
hooks/use-is-mounted/__docs__/use-is-mounted.example.tsx:23:18
     >
       <Button
         text="Toggle component"
-        onClick={() => setIsOpened(!isOpened)}
+        onClick={() => undefined}
         view={ButtonView.Secondary}
       />

[NoCoverage] BooleanLiteral
hooks/use-is-mounted/__docs__/use-is-mounted.example.tsx:23:36
     >
       <Button
         text="Toggle component"
-        onClick={() => setIsOpened(!isOpened)}
+        onClick={() => setIsOpened(isOpened)}
         view={ButtonView.Secondary}
       />

[NoCoverage] ConditionalExpression
hooks/use-is-mounted/__docs__/use-is-mounted.example.tsx:26:8
         onClick={() => setIsOpened(!isOpened)}
         view={ButtonView.Secondary}
       />
-      {isMounted && (
-        <div className="container">
-          New component is mounted! After the second click on the Toggle button it will be unmounted
-          in 1 second.
-        </div>
-      )}
+      {true}
     </div>
   );

[NoCoverage] ConditionalExpression
hooks/use-is-mounted/__docs__/use-is-mounted.example.tsx:26:8
         onClick={() => setIsOpened(!isOpened)}
         view={ButtonView.Secondary}
       />
-      {isMounted && (
-        <div className="container">
-          New component is mounted! After the second click on the Toggle button it will be unmounted
-          in 1 second.
-        </div>
-      )}
+      {false}
     </div>
   );
