[NoCoverage] BlockStatement
hooks/use-is-overflow/__docs__/use-is-overflow.example.tsx:15:73
   padding: '1em',
 };
 
-export const UseIsOverflowExample: FC<{ text: string }> = ({ text }) => {
-  const containerRef = useRef<HTMLDivElement>(null);
-  const isWidthOverflow = useIsOverflow({ ref: containerRef, dimension: 'width', isMounted: true });
-
-  return (
-    <div className="container">
-      <div style={containerStyles} ref={containerRef}>
-        {text}
-      </div>
-      {isWidthOverflow && <p>Text overflows the container.</p>}
-    </div>
-  );
-};
+export const UseIsOverflowExample: FC<{ text: string }> = ({ text }) => {};
 

[NoCoverage] BooleanLiteral
hooks/use-is-overflow/__docs__/use-is-overflow.example.tsx:17:93
 
 export const UseIsOverflowExample: FC<{ text: string }> = ({ text }) => {
   const containerRef = useRef<HTMLDivElement>(null);
-  const isWidthOverflow = useIsOverflow({ ref: containerRef, dimension: 'width', isMounted: true });
+  const isWidthOverflow = useIsOverflow({ ref: containerRef, dimension: 'width', isMounted: false });
 
   return (

[NoCoverage] ConditionalExpression
hooks/use-is-overflow/__docs__/use-is-overflow.example.tsx:24:8
       <div style={containerStyles} ref={containerRef}>
         {text}
       </div>
-      {isWidthOverflow && <p>Text overflows the container.</p>}
+      {true}
     </div>
   );

[NoCoverage] ConditionalExpression
hooks/use-is-overflow/__docs__/use-is-overflow.example.tsx:24:8
       <div style={containerStyles} ref={containerRef}>
         {text}
       </div>
-      {isWidthOverflow && <p>Text overflows the container.</p>}
+      {false}
     </div>
   );
