[NoCoverage] BlockStatement
hooks/use-key-press/__docs__/use-key-press.example.tsx:5:41
 import { useKeyPress } from '@hooks';
 import { useRef } from 'react';
 
-export const UseKeyPressExample = () => {
-  const ref = useRef(null);
-
-  const handleKeyPress = () => {
-    alert('Space Key pressed!');
-  };
-
-  useKeyPress({ ref, keyCode: 'Space', onKeyPress: handleKeyPress });
-
-  return (
-    <div className="container">
-      <input type="text" ref={ref} placeholder="Focus and Press Space key" />
-    </div>
-  );
-};
+export const UseKeyPressExample = () => {};
 

[NoCoverage] BlockStatement
hooks/use-key-press/__docs__/use-key-press.example.tsx:8:32
 export const UseKeyPressExample = () => {
   const ref = useRef(null);
 
-  const handleKeyPress = () => {
-    alert('Space Key pressed!');
-  };
+  const handleKeyPress = () => {};
 
   useKeyPress({ ref, keyCode: 'Space', onKeyPress: handleKeyPress });
