[NoCoverage] BlockStatement
hooks/use-modal-focus-trap/__docs__/use-modal-focus-trap.example.tsx:8:47
 
 import { useModalFocusTrap } from '../use-modal-focus-trap';
 
-export const UseModalFocusTrapExample = () => {
-  const modalRef = useRef<HTMLDivElement>(null);
-  const [isOpened, setIsOpened] = useState(false);
-
-  useModalFocusTrap({ modalRef, isOpened });
-
-  return (
-    <div style={{ padding: '1rem' }}>
-      <Button onClick={() => setIsOpened(true)} text="Open modal" view={ButtonView.Secondary} />
-      {isOpened && (
-        <div ref={modalRef} tabIndex={-1} className="container">
-          <button type="button" onClick={() => setIsOpened(false)}>
-            Close Modal
-          </button>
-          <input type="text" placeholder="Focusable Input" />
-        </div>
-      )}
-    </div>
-  );
-};
+export const UseModalFocusTrapExample = () => {};
 

[NoCoverage] BooleanLiteral
hooks/use-modal-focus-trap/__docs__/use-modal-focus-trap.example.tsx:10:44
 
 export const UseModalFocusTrapExample = () => {
   const modalRef = useRef<HTMLDivElement>(null);
-  const [isOpened, setIsOpened] = useState(false);
+  const [isOpened, setIsOpened] = useState(true);
 
   useModalFocusTrap({ modalRef, isOpened });

[NoCoverage] BooleanLiteral
hooks/use-modal-focus-trap/__docs__/use-modal-focus-trap.example.tsx:16:42
 
   return (
     <div style={{ padding: '1rem' }}>
-      <Button onClick={() => setIsOpened(true)} text="Open modal" view={ButtonView.Secondary} />
+      <Button onClick={() => setIsOpened(false)} text="Open modal" view={ButtonView.Secondary} />
       {isOpened && (
         <div ref={modalRef} tabIndex={-1} className="container">

[NoCoverage] ArrowFunction
hooks/use-modal-focus-trap/__docs__/use-modal-focus-trap.example.tsx:16:24
 
   return (
     <div style={{ padding: '1rem' }}>
-      <Button onClick={() => setIsOpened(true)} text="Open modal" view={ButtonView.Secondary} />
+      <Button onClick={() => undefined} text="Open modal" view={ButtonView.Secondary} />
       {isOpened && (
         <div ref={modalRef} tabIndex={-1} className="container">

[NoCoverage] ConditionalExpression
hooks/use-modal-focus-trap/__docs__/use-modal-focus-trap.example.tsx:17:8
   return (
     <div style={{ padding: '1rem' }}>
       <Button onClick={() => setIsOpened(true)} text="Open modal" view={ButtonView.Secondary} />
-      {isOpened && (
-        <div ref={modalRef} tabIndex={-1} className="container">
-          <button type="button" onClick={() => setIsOpened(false)}>
-            Close Modal
-          </button>
-          <input type="text" placeholder="Focusable Input" />
-        </div>
-      )}
+      {true}
     </div>
   );

[NoCoverage] LogicalOperator
hooks/use-modal-focus-trap/__docs__/use-modal-focus-trap.example.tsx:17:8
   return (
     <div style={{ padding: '1rem' }}>
       <Button onClick={() => setIsOpened(true)} text="Open modal" view={ButtonView.Secondary} />
-      {isOpened && (
-        <div ref={modalRef} tabIndex={-1} className="container">
-          <button type="button" onClick={() => setIsOpened(false)}>
-            Close Modal
-          </button>
-          <input type="text" placeholder="Focusable Input" />
-        </div>
-      )}
+      {isOpened || <div ref={modalRef} tabIndex={-1} className="container">
+          <button type="button" onClick={() => setIsOpened(false)}>
+            Close Modal
+          </button>
+          <input type="text" placeholder="Focusable Input" />
+        </div>}
     </div>
   );

[NoCoverage] UnaryOperator
hooks/use-modal-focus-trap/__docs__/use-modal-focus-trap.example.tsx:18:39
     <div style={{ padding: '1rem' }}>
       <Button onClick={() => setIsOpened(true)} text="Open modal" view={ButtonView.Secondary} />
       {isOpened && (
-        <div ref={modalRef} tabIndex={-1} className="container">
+        <div ref={modalRef} tabIndex={+1} className="container">
           <button type="button" onClick={() => setIsOpened(false)}>
             Close Modal

[NoCoverage] ArrowFunction
hooks/use-modal-focus-trap/__docs__/use-modal-focus-trap.example.tsx:19:42
       <Button onClick={() => setIsOpened(true)} text="Open modal" view={ButtonView.Secondary} />
       {isOpened && (
         <div ref={modalRef} tabIndex={-1} className="container">
-          <button type="button" onClick={() => setIsOpened(false)}>
+          <button type="button" onClick={() => undefined}>
             Close Modal
           </button>

[NoCoverage] BooleanLiteral
hooks/use-modal-focus-trap/__docs__/use-modal-focus-trap.example.tsx:19:60
       <Button onClick={() => setIsOpened(true)} text="Open modal" view={ButtonView.Secondary} />
       {isOpened && (
         <div ref={modalRef} tabIndex={-1} className="container">
-          <button type="button" onClick={() => setIsOpened(false)}>
+          <button type="button" onClick={() => setIsOpened(true)}>
             Close Modal
           </button>
