[NoCoverage] BooleanLiteral
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:20:15
   const delayInputId = useId();
 
   const remainingPercentage = useRemainingTimer({
-    isOpened: !!alerts.id,
+    isOpened: !alerts.id,
     isHovered: alerts.hoveredId === alerts.id,
     onClose: () => setAlerts({ id: '', hoveredId: null }),

[NoCoverage] ConditionalExpression
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:21:16
 
   const remainingPercentage = useRemainingTimer({
     isOpened: !!alerts.id,
-    isHovered: alerts.hoveredId === alerts.id,
+    isHovered: false,
     onClose: () => setAlerts({ id: '', hoveredId: null }),
     autoCloseDelay,

[NoCoverage] ConditionalExpression
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:21:16
 
   const remainingPercentage = useRemainingTimer({
     isOpened: !!alerts.id,
-    isHovered: alerts.hoveredId === alerts.id,
+    isHovered: true,
     onClose: () => setAlerts({ id: '', hoveredId: null }),
     autoCloseDelay,

[NoCoverage] ArrowFunction
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:22:14
   const remainingPercentage = useRemainingTimer({
     isOpened: !!alerts.id,
     isHovered: alerts.hoveredId === alerts.id,
-    onClose: () => setAlerts({ id: '', hoveredId: null }),
+    onClose: () => undefined,
     autoCloseDelay,
   });

[NoCoverage] BlockStatement
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:26:27
     autoCloseDelay,
   });
 
-  const openAlert = () => {
-    setAlerts({ id: Date.now().toString(), hoveredId: null });
-  };
+  const openAlert = () => {};
 
   return (

[NoCoverage] ArrowFunction
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:45:21
           max={10000}
           step={500}
           value={autoCloseDelay}
-          onChange={(e) => setAutoCloseDelay(Number(e.target.value))}
+          onChange={() => undefined}
           onIncrement={() => setAutoCloseDelay(autoCloseDelay + 500)}
           onDecrement={() => setAutoCloseDelay(autoCloseDelay - 500)}

[NoCoverage] ArithmeticOperator
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:46:48
           step={500}
           value={autoCloseDelay}
           onChange={(e) => setAutoCloseDelay(Number(e.target.value))}
-          onIncrement={() => setAutoCloseDelay(autoCloseDelay + 500)}
+          onIncrement={() => setAutoCloseDelay(autoCloseDelay - 500)}
           onDecrement={() => setAutoCloseDelay(autoCloseDelay - 500)}
         />

[NoCoverage] ArrowFunction
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:46:24
           step={500}
           value={autoCloseDelay}
           onChange={(e) => setAutoCloseDelay(Number(e.target.value))}
-          onIncrement={() => setAutoCloseDelay(autoCloseDelay + 500)}
+          onIncrement={() => undefined}
           onDecrement={() => setAutoCloseDelay(autoCloseDelay - 500)}
         />

[NoCoverage] ArithmeticOperator
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:47:48
           value={autoCloseDelay}
           onChange={(e) => setAutoCloseDelay(Number(e.target.value))}
           onIncrement={() => setAutoCloseDelay(autoCloseDelay + 500)}
-          onDecrement={() => setAutoCloseDelay(autoCloseDelay - 500)}
+          onDecrement={() => setAutoCloseDelay(autoCloseDelay + 500)}
         />
       </div>

[NoCoverage] ArrowFunction
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:47:24
           value={autoCloseDelay}
           onChange={(e) => setAutoCloseDelay(Number(e.target.value))}
           onIncrement={() => setAutoCloseDelay(autoCloseDelay + 500)}
-          onDecrement={() => setAutoCloseDelay(autoCloseDelay - 500)}
+          onDecrement={() => undefined}
         />
       </div>

[NoCoverage] ArrowFunction
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:55:41
 
       {alerts.id && (
         <div
-          onMouseEnter={() => setAlerts((prev) => ({ ...prev, hoveredId: prev.id }))}
+          onMouseEnter={() => setAlerts(() => undefined)}
           onMouseLeave={() => setAlerts((prev) => ({ ...prev, hoveredId: null }))}
           style={{

[NoCoverage] ArrowFunction
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:55:25
 
       {alerts.id && (
         <div
-          onMouseEnter={() => setAlerts((prev) => ({ ...prev, hoveredId: prev.id }))}
+          onMouseEnter={() => undefined}
           onMouseLeave={() => setAlerts((prev) => ({ ...prev, hoveredId: null }))}
           style={{

[NoCoverage] ArrowFunction
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:56:25
       {alerts.id && (
         <div
           onMouseEnter={() => setAlerts((prev) => ({ ...prev, hoveredId: prev.id }))}
-          onMouseLeave={() => setAlerts((prev) => ({ ...prev, hoveredId: null }))}
+          onMouseLeave={() => undefined}
           style={{
             padding: '1rem',

[NoCoverage] ArrowFunction
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:56:41
       {alerts.id && (
         <div
           onMouseEnter={() => setAlerts((prev) => ({ ...prev, hoveredId: prev.id }))}
-          onMouseLeave={() => setAlerts((prev) => ({ ...prev, hoveredId: null }))}
+          onMouseLeave={() => setAlerts(() => undefined)}
           style={{
             padding: '1rem',

[NoCoverage] EqualityOperator
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:69:16
           <div style={{ marginBottom: '0.5rem' }}>
             <strong>Alert Message</strong>
             <div style={{ fontSize: '0.875rem', color: '#666', marginTop: '0.25rem' }}>
-              {alerts.hoveredId === alerts.id ? '⏸️ Timer paused (hovering)' : '⏱️ Timer running'}
+              {alerts.hoveredId !== alerts.id ? '⏸️ Timer paused (hovering)' : '⏱️ Timer running'}
             </div>
           </div>

[NoCoverage] ConditionalExpression
hooks/use-remaining-timer/__docs__/use-remaining-timer.example.tsx:69:16
           <div style={{ marginBottom: '0.5rem' }}>
             <strong>Alert Message</strong>
             <div style={{ fontSize: '0.875rem', color: '#666', marginTop: '0.25rem' }}>
-              {alerts.hoveredId === alerts.id ? '⏸️ Timer paused (hovering)' : '⏱️ Timer running'}
+              {true ? '⏸️ Timer paused (hovering)' : '⏱️ Timer running'}
             </div>
           </div>
