[NoCoverage] ArrowFunction
hooks/use-remaining-timer/__docs__/use-remaining-timer.stories.tsx:24:11
 type Story = StoryObj<typeof InteractiveRemainingTimerDemo>;
 
 export const InteractiveDemo: Story = {
-  render: () => <InteractiveRemainingTimerDemo autoCloseDelay={5000} />,
+  render: () => undefined,
   parameters: {
     docs: {
