[Killed] BooleanLiteral
src/hooks/use-remaining-timer/use-remaining-timer.ts:24:9
   const animationFrameRef = useRef<number>(0);
 
   useEffect(() => {
-    if (!autoClose) return;
+    if (autoClose) return;
 
     if (!isOpened) {
killedBy: useRemainingTimer calls onClose after delay
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:24:9
   const animationFrameRef = useRef<number>(0);
 
   useEffect(() => {
-    if (!autoClose) return;
+    if (true) return;
 
     if (!isOpened) {
killedBy: useRemainingTimer calls onClose after delay
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/hooks/use-remaining-timer/use-remaining-timer.ts:26:9
   useEffect(() => {
     if (!autoClose) return;
 
-    if (!isOpened) {
+    if (isOpened) {
       setRemainingPercentage(100);
       elapsedTimeRef.current = 0;
killedBy: Alert should update progress bar value over time
statusReason: expected 100 to be less than 100

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div>

[Killed] ConditionalExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:26:9
   useEffect(() => {
     if (!autoClose) return;
 
-    if (!isOpened) {
+    if (false) {
       setRemainingPercentage(100);
       elapsedTimeRef.current = 0;
killedBy: useRemainingTimer resets when closed
statusReason: expected 50.4 to be 100 // Object.is equality

[Survived] BlockStatement
src/hooks/use-remaining-timer/use-remaining-timer.ts:29:38
     if (!isOpened) {
       setRemainingPercentage(100);
       elapsedTimeRef.current = 0;
-      if (animationFrameRef.current) {
-        cancelAnimationFrame(animationFrameRef.current);
-      }
+      if (animationFrameRef.current) {}
       return;
     }

[Survived] ConditionalExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:29:11
     if (!isOpened) {
       setRemainingPercentage(100);
       elapsedTimeRef.current = 0;
-      if (animationFrameRef.current) {
+      if (false) {
         cancelAnimationFrame(animationFrameRef.current);
       }

[Killed] ConditionalExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:35:9
       return;
     }
 
-    if (isHovered) {
+    if (true) {
       if (animationFrameRef.current) {
         cancelAnimationFrame(animationFrameRef.current);
killedBy: Alert should update progress bar value over time
statusReason: expected 100 to be less than 100

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div>

[Killed] BlockStatement
src/hooks/use-remaining-timer/use-remaining-timer.ts:35:20
       return;
     }
 
-    if (isHovered) {
-      if (animationFrameRef.current) {
-        cancelAnimationFrame(animationFrameRef.current);
-      }
-      return;
-    }
+    if (isHovered) {}
 
     startTimeRef.current = Date.now() - elapsedTimeRef.current;
killedBy: useRemainingTimer pauses timer when hovered
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[NoCoverage] BlockStatement
src/hooks/use-remaining-timer/use-remaining-timer.ts:36:38
     }
 
     if (isHovered) {
-      if (animationFrameRef.current) {
-        cancelAnimationFrame(animationFrameRef.current);
-      }
+      if (animationFrameRef.current) {}
       return;
     }

[Survived] ConditionalExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:36:11
     }
 
     if (isHovered) {
-      if (animationFrameRef.current) {
+      if (false) {
         cancelAnimationFrame(animationFrameRef.current);
       }

[Survived] ArithmeticOperator
src/hooks/use-remaining-timer/use-remaining-timer.ts:42:28
       return;
     }
 
-    startTimeRef.current = Date.now() - elapsedTimeRef.current;
+    startTimeRef.current = Date.now() + elapsedTimeRef.current;
 
     const updateTimer = () => {

[Killed] BlockStatement
src/hooks/use-remaining-timer/use-remaining-timer.ts:44:31
 
     startTimeRef.current = Date.now() - elapsedTimeRef.current;
 
-    const updateTimer = () => {
-      const elapsed = Date.now() - startTimeRef.current;
-      elapsedTimeRef.current = elapsed;
-
-      const percentage = Math.max(0, 100 - (elapsed / autoCloseDelay) * 100);
-      setRemainingPercentage(percentage);
-
-      if (elapsed >= autoCloseDelay) {
-        onClose();
-        return;
-      }
-
-      animationFrameRef.current = requestAnimationFrame(updateTimer);
-    };
+    const updateTimer = () => {};
 
     animationFrameRef.current = requestAnimationFrame(updateTimer);
killedBy: Alert should update progress bar value over time
statusReason: expected 100 to be less than 100

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div>

[Survived] ArithmeticOperator
src/hooks/use-remaining-timer/use-remaining-timer.ts:45:23
     startTimeRef.current = Date.now() - elapsedTimeRef.current;
 
     const updateTimer = () => {
-      const elapsed = Date.now() - startTimeRef.current;
+      const elapsed = Date.now() + startTimeRef.current;
       elapsedTimeRef.current = elapsed;
 

[Killed] ArithmeticOperator
src/hooks/use-remaining-timer/use-remaining-timer.ts:48:38
       const elapsed = Date.now() - startTimeRef.current;
       elapsedTimeRef.current = elapsed;
 
-      const percentage = Math.max(0, 100 - (elapsed / autoCloseDelay) * 100);
+      const percentage = Math.max(0, 100 + elapsed / autoCloseDelay * 100);
       setRemainingPercentage(percentage);
 
killedBy: Alert should update progress bar value over time
statusReason: expected 100 to be less than 100

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div>

[Survived] MethodExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:48:26
       const elapsed = Date.now() - startTimeRef.current;
       elapsedTimeRef.current = elapsed;
 
-      const percentage = Math.max(0, 100 - (elapsed / autoCloseDelay) * 100);
+      const percentage = Math.min(0, 100 - elapsed / autoCloseDelay * 100);
       setRemainingPercentage(percentage);
 

[Killed] ConditionalExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:51:11
       const percentage = Math.max(0, 100 - (elapsed / autoCloseDelay) * 100);
       setRemainingPercentage(percentage);
 
-      if (elapsed >= autoCloseDelay) {
+      if (false) {
         onClose();
         return;
killedBy: useRemainingTimer calls onClose after delay
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/hooks/use-remaining-timer/use-remaining-timer.ts:51:38
       const percentage = Math.max(0, 100 - (elapsed / autoCloseDelay) * 100);
       setRemainingPercentage(percentage);
 
-      if (elapsed >= autoCloseDelay) {
-        onClose();
-        return;
-      }
+      if (elapsed >= autoCloseDelay) {}
 
       animationFrameRef.current = requestAnimationFrame(updateTimer);
killedBy: useRemainingTimer calls onClose after delay
statusReason: expected "vi.fn()" to be called at least once

[Survived] BlockStatement
src/hooks/use-remaining-timer/use-remaining-timer.ts:61:18
 
     animationFrameRef.current = requestAnimationFrame(updateTimer);
 
-    return () => {
-      if (animationFrameRef.current) {
-        cancelAnimationFrame(animationFrameRef.current);
-      }
-    };
+    return () => {};
   }, [isOpened, isHovered, onClose, autoCloseDelay, autoClose]);
 

[Survived] ConditionalExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:62:11
     animationFrameRef.current = requestAnimationFrame(updateTimer);
 
     return () => {
-      if (animationFrameRef.current) {
+      if (false) {
         cancelAnimationFrame(animationFrameRef.current);
       }

[Survived] ConditionalExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:62:11
     animationFrameRef.current = requestAnimationFrame(updateTimer);
 
     return () => {
-      if (animationFrameRef.current) {
+      if (true) {
         cancelAnimationFrame(animationFrameRef.current);
       }
