[NoCoverage] BooleanLiteral
hooks/use-tooltip-position/__docs__/use-tooltip-position.example.tsx:7:44
 import { useTooltipPosition } from '../use-tooltip-position';
 
 export const UseTooltipPositionExample = () => {
-  const [isOpened, setIsOpened] = useState(false);
+  const [isOpened, setIsOpened] = useState(true);
   const wrapperRef = useRef(null);
   const tooltipRef = useRef(null);

[NoCoverage] BooleanLiteral
hooks/use-tooltip-position/__docs__/use-tooltip-position.example.tsx:18:56
 
   return (
     <div>
-      <button type="button" onClick={() => setIsOpened(!isOpened)} ref={wrapperRef}>
+      <button type="button" onClick={() => setIsOpened(isOpened)} ref={wrapperRef}>
         Click me
       </button>

[NoCoverage] ArrowFunction
hooks/use-tooltip-position/__docs__/use-tooltip-position.example.tsx:18:38
 
   return (
     <div>
-      <button type="button" onClick={() => setIsOpened(!isOpened)} ref={wrapperRef}>
+      <button type="button" onClick={() => undefined} ref={wrapperRef}>
         Click me
       </button>

[NoCoverage] ConditionalExpression
hooks/use-tooltip-position/__docs__/use-tooltip-position.example.tsx:21:8
       <button type="button" onClick={() => setIsOpened(!isOpened)} ref={wrapperRef}>
         Click me
       </button>
-      {isOpened && (
-        <div
-          className="container"
-          ref={tooltipRef}
-          style={{ position: 'absolute', top: `${top}px`, left: `${left}px` }}
-        >
-          Tooltip Content
-        </div>
-      )}
+      {true}
     </div>
   );

[NoCoverage] LogicalOperator
hooks/use-tooltip-position/__docs__/use-tooltip-position.example.tsx:21:8
       <button type="button" onClick={() => setIsOpened(!isOpened)} ref={wrapperRef}>
         Click me
       </button>
-      {isOpened && (
-        <div
-          className="container"
-          ref={tooltipRef}
-          style={{ position: 'absolute', top: `${top}px`, left: `${left}px` }}
-        >
-          Tooltip Content
-        </div>
-      )}
+      {isOpened || <div className="container" ref={tooltipRef} style={{
+  position: 'absolute',
+  top: `${top}px`,
+  left: `${left}px`
+}}>
+          Tooltip Content
+        </div>}
     </div>
   );
