[Killed] ConditionalExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:25:9
   });
 
   useEffect(() => {
-    if (!isOpened || !wrapperRef?.current) {
+    if (true) {
       return;
     }
killedBy: useTooltipPosition should calculate correct position when tooltip fits within viewport
statusReason: expected { top: +0, left: +0 } to deeply equal { top: 158, left: 100 }

[Killed] BooleanLiteral
src/hooks/use-tooltip-position/use-tooltip-position.ts:25:22
   });
 
   useEffect(() => {
-    if (!isOpened || !wrapperRef?.current) {
+    if (!isOpened || wrapperRef?.current) {
       return;
     }
killedBy: useTooltipPosition should calculate correct position when tooltip fits within viewport
statusReason: expected { top: +0, left: +0 } to deeply equal { top: 158, left: 100 }

[Killed] BlockStatement
src/hooks/use-tooltip-position/use-tooltip-position.ts:29:34
       return;
     }
 
-    const updatePosition = () => {
-      const rect = wrapperRef.current?.getBoundingClientRect();
-      if (!rect) return;
-
-      let top = Math.round(rect.bottom + spacing);
-      let left = Math.round(rect.left);
-
-      // Adjust position if tooltip goes beyond the viewport
-      if (top + tooltipHeight > window.innerHeight) {
-        top = Math.round(rect.top - tooltipHeight - spacing);
-      }
-      if (left + tooltipWidth > window.innerWidth) {
-        left = Math.round(window.innerWidth - tooltipWidth - spacing);
-      }
-      if (left < 0) {
-        left = spacing;
-      }
-
-      setPosition({ top, left });
-    };
+    const updatePosition = () => {};
 
     // Initial position calculation
killedBy: useTooltipPosition should calculate correct position when tooltip fits within viewport
statusReason: expected { top: +0, left: +0 } to deeply equal { top: 158, left: 100 }

[Survived] OptionalChaining
src/hooks/use-tooltip-position/use-tooltip-position.ts:30:20
     }
 
     const updatePosition = () => {
-      const rect = wrapperRef.current?.getBoundingClientRect();
+      const rect = wrapperRef.current.getBoundingClientRect();
       if (!rect) return;
 

[Killed] BooleanLiteral
src/hooks/use-tooltip-position/use-tooltip-position.ts:31:11
 
     const updatePosition = () => {
       const rect = wrapperRef.current?.getBoundingClientRect();
-      if (!rect) return;
+      if (rect) return;
 
       let top = Math.round(rect.bottom + spacing);
killedBy: useTooltipPosition should calculate correct position when tooltip fits within viewport
statusReason: expected { top: +0, left: +0 } to deeply equal { top: 158, left: 100 }

[Killed] ConditionalExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:31:11
 
     const updatePosition = () => {
       const rect = wrapperRef.current?.getBoundingClientRect();
-      if (!rect) return;
+      if (true) return;
 
       let top = Math.round(rect.bottom + spacing);
killedBy: useTooltipPosition should calculate correct position when tooltip fits within viewport
statusReason: expected { top: +0, left: +0 } to deeply equal { top: 158, left: 100 }

[Killed] ArithmeticOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:33:28
       const rect = wrapperRef.current?.getBoundingClientRect();
       if (!rect) return;
 
-      let top = Math.round(rect.bottom + spacing);
+      let top = Math.round(rect.bottom - spacing);
       let left = Math.round(rect.left);
 
killedBy: useTooltipPosition should calculate correct position when tooltip fits within viewport
statusReason: expected { top: 142, left: 100 } to deeply equal { top: 158, left: 100 }

[Killed] ConditionalExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:37:11
       let left = Math.round(rect.left);
 
       // Adjust position if tooltip goes beyond the viewport
-      if (top + tooltipHeight > window.innerHeight) {
+      if (true) {
         top = Math.round(rect.top - tooltipHeight - spacing);
       }
killedBy: useTooltipPosition should calculate correct position when tooltip fits within viewport
statusReason: expected { top: NaN, left: 100 } to deeply equal { top: 158, left: 100 }

[Killed] EqualityOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:37:11
       let left = Math.round(rect.left);
 
       // Adjust position if tooltip goes beyond the viewport
-      if (top + tooltipHeight > window.innerHeight) {
+      if (top + tooltipHeight <= window.innerHeight) {
         top = Math.round(rect.top - tooltipHeight - spacing);
       }
killedBy: useTooltipPosition should recalculate position when window is resized
statusReason: expected { top: 92, left: 100 } to deeply equal { top: 158, left: 100 }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[NoCoverage] ArithmeticOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:38:26
 
       // Adjust position if tooltip goes beyond the viewport
       if (top + tooltipHeight > window.innerHeight) {
-        top = Math.round(rect.top - tooltipHeight - spacing);
+        top = Math.round(rect.top - tooltipHeight + spacing);
       }
       if (left + tooltipWidth > window.innerWidth) {

[NoCoverage] ArithmeticOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:38:26
 
       // Adjust position if tooltip goes beyond the viewport
       if (top + tooltipHeight > window.innerHeight) {
-        top = Math.round(rect.top - tooltipHeight - spacing);
+        top = Math.round(rect.top + tooltipHeight - spacing);
       }
       if (left + tooltipWidth > window.innerWidth) {

[Killed] ConditionalExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:40:11
       if (top + tooltipHeight > window.innerHeight) {
         top = Math.round(rect.top - tooltipHeight - spacing);
       }
-      if (left + tooltipWidth > window.innerWidth) {
+      if (true) {
         left = Math.round(window.innerWidth - tooltipWidth - spacing);
       }
killedBy: useTooltipPosition should calculate correct position when tooltip fits within viewport
statusReason: expected { top: 158, left: NaN } to deeply equal { top: 158, left: 100 }

[Killed] EqualityOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:40:11
       if (top + tooltipHeight > window.innerHeight) {
         top = Math.round(rect.top - tooltipHeight - spacing);
       }
-      if (left + tooltipWidth > window.innerWidth) {
+      if (left + tooltipWidth <= window.innerWidth) {
         left = Math.round(window.innerWidth - tooltipWidth - spacing);
       }
killedBy: useTooltipPosition should recalculate position when window is resized
statusReason: expected { top: 158, left: 392 } to deeply equal { top: 158, left: 100 }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[NoCoverage] ArithmeticOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:41:27
         top = Math.round(rect.top - tooltipHeight - spacing);
       }
       if (left + tooltipWidth > window.innerWidth) {
-        left = Math.round(window.innerWidth - tooltipWidth - spacing);
+        left = Math.round(window.innerWidth + tooltipWidth - spacing);
       }
       if (left < 0) {

[NoCoverage] ArithmeticOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:41:27
         top = Math.round(rect.top - tooltipHeight - spacing);
       }
       if (left + tooltipWidth > window.innerWidth) {
-        left = Math.round(window.innerWidth - tooltipWidth - spacing);
+        left = Math.round(window.innerWidth - tooltipWidth + spacing);
       }
       if (left < 0) {

[Killed] ConditionalExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:43:11
       if (left + tooltipWidth > window.innerWidth) {
         left = Math.round(window.innerWidth - tooltipWidth - spacing);
       }
-      if (left < 0) {
+      if (true) {
         left = spacing;
       }
killedBy: useTooltipPosition should calculate correct position when tooltip fits within viewport
statusReason: expected { top: 158, left: 8 } to deeply equal { top: 158, left: 100 }

[Killed] EqualityOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:43:11
       if (left + tooltipWidth > window.innerWidth) {
         left = Math.round(window.innerWidth - tooltipWidth - spacing);
       }
-      if (left < 0) {
+      if (left >= 0) {
         left = spacing;
       }
killedBy: useTooltipPosition should calculate correct position when tooltip fits within viewport
statusReason: expected { top: 158, left: 8 } to deeply equal { top: 158, left: 100 }

[Killed] BlockStatement
src/hooks/use-tooltip-position/use-tooltip-position.ts:57:18
     const resizeObserver = new ResizeObserver(updatePosition);
     resizeObserver.observe(document.documentElement);
 
-    return () => {
-      resizeObserver.disconnect();
-    };
+    return () => {};
   }, [isOpened, wrapperRef, tooltipHeight, tooltipWidth, spacing]);
 
killedBy: useTooltipPosition should set up and clean up ResizeObserver when opened
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ArrayDeclaration
src/hooks/use-tooltip-position/use-tooltip-position.ts:60:6
     return () => {
       resizeObserver.disconnect();
     };
-  }, [isOpened, wrapperRef, tooltipHeight, tooltipWidth, spacing]);
+  }, []);
 
   return position;
killedBy: useTooltipPosition should set up and clean up ResizeObserver when opened
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times
