[NoCoverage] BlockStatement
hooks/use-window-dimensions/__docs__/use-window-dimensions.example.tsx:5:49
 
 import { useWindowDimensions } from '../use-window-dimensions';
 
-export const UseWindowDimensionsExample = () => {
-  const { width, height } = useWindowDimensions();
-
-  return (
-    <div className="container">
-      <p>Window width: {width}px;</p>
-      <p>Window height: {height}px;</p>
-    </div>
-  );
-};
+export const UseWindowDimensionsExample = () => {};
 
