[Survived] BooleanLiteral
components/atoms/button/Button.tsx:17:14
   text,
   icon,
   tooltip,
-  extended = false,
+  extended = true,
   view = ButtonView.Primary,
   label,

[Survived] ConditionalExpression
components/atoms/button/Button.tsx:27:5
   const extendedClass = getClassName([className, 'cl-button', { 'cl-button_extended': extended }]);
 
   switch (view) {
-    case ButtonView.Primary:
-      return (
-        <PrimaryButton
-          className={extendedClass}
-          icon={icon}
-          text={text}
-          aria-label={label}
-          iconSize={iconSize}
-          {...rest}
-        />
-      );
+    case ButtonView.Primary:
     case ButtonView.Secondary:
       return (

[Killed] ConditionalExpression
components/atoms/button/Button.tsx:38:5
           {...rest}
         />
       );
-    case ButtonView.Secondary:
-      return (
-        <SecondaryButton
-          className={extendedClass}
-          icon={icon}
-          text={text}
-          aria-label={label}
-          iconSize={iconSize}
-          {...rest}
-        />
-      );
+    case ButtonView.Secondary:
     case ButtonView.Icon:
       return (
killedBy: Form should reset entered values to initial values
statusReason: Unable to find an element with the text: Reset. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class="cl-form form-class"
      id="form-id"

[Survived] ConditionalExpression
components/atoms/button/Button.tsx:49:5
           {...rest}
         />
       );
-    case ButtonView.Icon:
-      return (
-        <IconButton label={label} icon={icon} iconSize={iconSize} {...rest} className={className} />
-      );
+    case ButtonView.Icon:
     case ButtonView.Inner:
       return (

[Killed] ConditionalExpression
components/atoms/button/Button.tsx:53:5
       return (
         <IconButton label={label} icon={icon} iconSize={iconSize} {...rest} className={className} />
       );
-    case ButtonView.Inner:
-      return (
-        <InnerButton
-          label={label}
-          icon={icon}
-          iconSize={iconSize}
-          {...rest}
-          className={className}
-        ></InnerButton>
-      );
+    case ButtonView.Inner:
     default:
       return null;
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched

[Survived] ConditionalExpression
components/atoms/button/Button.tsx:63:5
           className={className}
         ></InnerButton>
       );
-    default:
-      return null;
+    default:
   }
 };
