[Killed] ArrowFunction
atoms/button/icon-button/IconButton.tsx:9:58
 import { ElementSize } from '@enums';
 import type { ButtonProps } from '@types';
 
-export const IconButton: FC<Omit<ButtonProps, 'text'>> = ({
-  icon,
-  className,
-  label,
-  iconSize = ElementSize.Medium,
-  ...rest
-}) => (
-  <button {...rest} aria-label={label} className={getClassName(['cl-icon-button', className])}>
-    {icon && <Icon name={icon} className="cl-icon-button__icon" size={iconSize} />}
-  </button>
-);
+export const IconButton: FC<Omit<ButtonProps, 'text'>> = () => undefined;
 
killedBy: Alert should call onClose when the close button is clicked
statusReason: Unable to find an accessible element with the role "button" and name `/close/i`

Here are the accessible roles:

  banner:

  Name "":
  <header />

[Survived] LogicalOperator
atoms/button/icon-button/IconButton.tsx:17:6
   ...rest
 }) => (
   <button {...rest} aria-label={label} className={getClassName(['cl-icon-button', className])}>
-    {icon && <Icon name={icon} className="cl-icon-button__icon" size={iconSize} />}
+    {icon || <Icon name={icon} className="cl-icon-button__icon" size={iconSize} />}
   </button>
 );

[Survived] ConditionalExpression
atoms/button/icon-button/IconButton.tsx:17:6
   ...rest
 }) => (
   <button {...rest} aria-label={label} className={getClassName(['cl-icon-button', className])}>
-    {icon && <Icon name={icon} className="cl-icon-button__icon" size={iconSize} />}
+    {false}
   </button>
 );
