[Killed] BlockStatement
atoms/button/inner-button/InnerButton.tsx:16:7
   className,
   iconSize = ElementSize.Small,
   ...rest
-}) => {
-  return (
-    <button
-      className={getClassName(['cl-inner-button', className])}
-      onClick={onClick}
-      aria-label={label}
-      type="button"
-      disabled={disabled}
-      {...rest}
-    >
-      <Icon name={icon} size={iconSize} className="cl-inner-button__icon" />
-    </button>
-  );
-};
+}) => {};
 
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched
