[Killed] ArrowFunction
atoms/button/primary-button/PrimaryButton.tsx:8:47
 import { ElementSize } from '@enums';
 import type { ButtonProps } from '@types';
 
-export const PrimaryButton: FC<ButtonProps> = ({
-  icon,
-  text,
-  className,
-  iconSize = ElementSize.Small,
-  ...rest
-}) => (
-  <button {...rest} className={getClassName(['cl-primary-button', className])}>
-    {icon && <Icon name={icon} className="cl-primary-button__icon" size={iconSize} />}
-    <span className="cl-primary-button__text">{text}</span>
-  </button>
-);
+export const PrimaryButton: FC<ButtonProps> = () => undefined;
 
killedBy: Form should call onSubmit handler
statusReason: Unable to find an element with the text: Submit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class="cl-form form-class"
      id="form-id"

[Survived] LogicalOperator
atoms/button/primary-button/PrimaryButton.tsx:16:6
   ...rest
 }) => (
   <button {...rest} className={getClassName(['cl-primary-button', className])}>
-    {icon && <Icon name={icon} className="cl-primary-button__icon" size={iconSize} />}
+    {icon || <Icon name={icon} className="cl-primary-button__icon" size={iconSize} />}
     <span className="cl-primary-button__text">{text}</span>
   </button>

[Survived] ConditionalExpression
atoms/button/primary-button/PrimaryButton.tsx:16:6
   ...rest
 }) => (
   <button {...rest} className={getClassName(['cl-primary-button', className])}>
-    {icon && <Icon name={icon} className="cl-primary-button__icon" size={iconSize} />}
+    {true}
     <span className="cl-primary-button__text">{text}</span>
   </button>
