[Killed] ArrowFunction
atoms/button/secondary-button/SecondaryButton.tsx:8:49
 import { ElementSize } from '@enums';
 import type { ButtonProps } from '@types';
 
-export const SecondaryButton: FC<ButtonProps> = ({
-  icon,
-  text,
-  className,
-  iconSize = ElementSize.Small,
-  ...rest
-}) => (
-  <button {...rest} className={getClassName(['cl-secondary-button', className])}>
-    {icon && <Icon name={icon} className="cl-secondary-button__icon" size={iconSize} />}
-    <span className="cl-secondary-button__text">{text}</span>
-  </button>
-);
+export const SecondaryButton: FC<ButtonProps> = () => undefined;
 
killedBy: Form should reset entered values to initial values
statusReason: Unable to find an element with the text: Reset. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class="cl-form form-class"
      id="form-id"

[Killed] ArrayDeclaration
atoms/button/secondary-button/SecondaryButton.tsx:15:45
   iconSize = ElementSize.Small,
   ...rest
 }) => (
-  <button {...rest} className={getClassName(['cl-secondary-button', className])}>
+  <button {...rest} className={getClassName([])}>
     {icon && <Icon name={icon} className="cl-secondary-button__icon" size={iconSize} />}
     <span className="cl-secondary-button__text">{text}</span>
killedBy: SecondaryButton should have the passed className
statusReason: expect(element).toHaveClass("button-class")

Expected the element to have class:
  button-class
Received:

[Survived] ConditionalExpression
atoms/button/secondary-button/SecondaryButton.tsx:16:6
   ...rest
 }) => (
   <button {...rest} className={getClassName(['cl-secondary-button', className])}>
-    {icon && <Icon name={icon} className="cl-secondary-button__icon" size={iconSize} />}
+    {true}
     <span className="cl-secondary-button__text">{text}</span>
   </button>

[Survived] LogicalOperator
atoms/button/secondary-button/SecondaryButton.tsx:16:6
   ...rest
 }) => (
   <button {...rest} className={getClassName(['cl-secondary-button', className])}>
-    {icon && <Icon name={icon} className="cl-secondary-button__icon" size={iconSize} />}
+    {icon || <Icon name={icon} className="cl-secondary-button__icon" size={iconSize} />}
     <span className="cl-secondary-button__text">{text}</span>
   </button>
