[Killed] BlockStatement
components/atoms/editable-text/EditView.tsx:25:7
   className,
   inputRef,
   ...rest
-}) => {
-  const InputComponent = multiline ? 'textarea' : 'input';
-
-  const handleChange = useCallback(
-    (event: React.ChangeEvent<HTMLTextAreaElement | HTMLInputElement>) => {
-      onChange(event.target.value);
-    },
-    [onChange],
-  );
-
-  return (
-    <InputComponent
-      ref={inputRef as unknown as RefObject<HTMLTextAreaElement & HTMLInputElement>}
-      value={value}
-      onChange={handleChange}
-      onBlur={onBlur}
-      onKeyDown={onKeyDown}
-      placeholder={placeholder}
-      className={className}
-      rows={multiline ? 3 : undefined}
-      {...rest}
-    />
-  );
-};
+}) => {};
 
killedBy: EditableText renders an input when the text is clicked
statusReason: Unable to find an accessible element with the role "textbox"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
components/atoms/editable-text/EditView.tsx:29:75
   const InputComponent = multiline ? 'textarea' : 'input';
 
   const handleChange = useCallback(
-    (event: React.ChangeEvent<HTMLTextAreaElement | HTMLInputElement>) => {
-      onChange(event.target.value);
-    },
+    (event: React.ChangeEvent<HTMLTextAreaElement | HTMLInputElement>) => {},
     [onChange],
   );
killedBy: EditableText allows to change the text by typing in a new value
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  aria-label="Editable text"
  class="cl-editable-text"
  role="button"
  tabindex="0"
>
