[Survived] BooleanLiteral
components/atoms/editable-text/EditableText.tsx:17:30
   onChange,
   onClick,
   className,
-  autoSelectTextOnEditMode = false,
+  autoSelectTextOnEditMode = true,
   multiline = false,
   placeholder = 'Click to edit...',

[Survived] BooleanLiteral
components/atoms/editable-text/EditableText.tsx:18:15
   onClick,
   className,
   autoSelectTextOnEditMode = false,
-  multiline = false,
+  multiline = true,
   placeholder = 'Click to edit...',
   readOnly = false,

[Killed] BooleanLiteral
components/atoms/editable-text/EditableText.tsx:20:14
   autoSelectTextOnEditMode = false,
   multiline = false,
   placeholder = 'Click to edit...',
-  readOnly = false,
+  readOnly = true,
   ...rest
 }) => {
killedBy: EditableText renders ReadView by default
statusReason: Snapshot `EditableText > renders ReadView by default 1` mismatched

[Killed] BlockStatement
components/atoms/editable-text/EditableText.tsx:30:34
   useInputFocus(inputRef, editMode, autoSelectTextOnEditMode, readOnly);
 
   const handleClick = useCallback(
-    (event: React.MouseEvent) => {
-      onClick?.(event);
-      enterEditMode();
-    },
+    (event: React.MouseEvent) => {},
     [onClick, enterEditMode],
   );
killedBy: EditableText renders an input when the text is clicked
statusReason: Unable to find an accessible element with the role "textbox"

Here are the accessible roles:

  button:

  Name "Editable text":
  <span

[Survived] OptionalChaining
components/atoms/editable-text/EditableText.tsx:31:7
 
   const handleClick = useCallback(
     (event: React.MouseEvent) => {
-      onClick?.(event);
+      onClick(event);
       enterEditMode();
     },

[Killed] BlockStatement
components/atoms/editable-text/EditableText.tsx:37:40
     [onClick, enterEditMode],
   );
 
-  const handleBlur = useCallback(() => {
-    exitEditMode();
-    commitValue();
-  }, [exitEditMode, commitValue]);
+  const handleBlur = useCallback(() => {}, [exitEditMode, commitValue]);
 
   const handleKeyDown = useCallback(
killedBy: EditableText allows to change the text by typing in a new value
statusReason: Unable to find an element with the text: test. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <input
      class="cl-editable-text cl-editable-text_edit-mode"
      placeholder="Click to edit..."

[Killed] BlockStatement
components/atoms/editable-text/EditableText.tsx:43:37
   }, [exitEditMode, commitValue]);
 
   const handleKeyDown = useCallback(
-    (event: React.KeyboardEvent) => {
-      if (event.key === 'Enter' && !multiline) {
-        event.preventDefault();
-        handleBlur();
-      }
-      if (event.key === 'Escape') {
-        resetValue();
-        exitEditMode();
-      }
-    },
+    (event: React.KeyboardEvent) => {},
     [multiline, handleBlur, resetValue, exitEditMode],
   );
killedBy: EditableText handles Enter key press to commit value
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="cl-editable-text cl-editable-text_edit-mode"
  placeholder="Click to edit..."
  value="Initial Value"
/> instead

[Killed] EqualityOperator
components/atoms/editable-text/EditableText.tsx:44:11
 
   const handleKeyDown = useCallback(
     (event: React.KeyboardEvent) => {
-      if (event.key === 'Enter' && !multiline) {
+      if (event.key !== 'Enter' && !multiline) {
         event.preventDefault();
         handleBlur();
killedBy: EditableText allows to change the text by typing in a new value
statusReason: Unable to find an element with the text: test. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-label="Editable text"
      class="cl-editable-text cl-editable-text_empty"

[Killed] ConditionalExpression
components/atoms/editable-text/EditableText.tsx:44:11
 
   const handleKeyDown = useCallback(
     (event: React.KeyboardEvent) => {
-      if (event.key === 'Enter' && !multiline) {
+      if (true) {
         event.preventDefault();
         handleBlur();
killedBy: EditableText allows to change the text by typing in a new value
statusReason: Unable to find an element with the text: test. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-label="Editable text"
      class="cl-editable-text cl-editable-text_empty"

[Killed] BlockStatement
components/atoms/editable-text/EditableText.tsx:48:35
         event.preventDefault();
         handleBlur();
       }
-      if (event.key === 'Escape') {
-        resetValue();
-        exitEditMode();
-      }
+      if (event.key === 'Escape') {}
     },
     [multiline, handleBlur, resetValue, exitEditMode],
killedBy: EditableText handles Escape key press to reset value
statusReason: Unable to find an element with the text: Initial Value. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <input
      class="cl-editable-text cl-editable-text_edit-mode"
      placeholder="Click to edit..."

[Killed] ConditionalExpression
components/atoms/editable-text/EditableText.tsx:48:11
         event.preventDefault();
         handleBlur();
       }
-      if (event.key === 'Escape') {
+      if (false) {
         resetValue();
         exitEditMode();
killedBy: EditableText handles Escape key press to reset value
statusReason: Unable to find an element with the text: Initial Value. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <input
      class="cl-editable-text cl-editable-text_edit-mode"
      placeholder="Click to edit..."

[Killed] BooleanLiteral
components/atoms/editable-text/EditableText.tsx:62:33
     {
       'cl-editable-text_edit-mode': editMode,
       'cl-editable-text_read-only': readOnly,
-      'cl-editable-text_empty': !internalValue,
+      'cl-editable-text_empty': internalValue,
     },
   ]);
killedBy: EditableText renders ReadView by default
statusReason: Snapshot `EditableText > renders ReadView by default 1` mismatched

[Killed] ConditionalExpression
components/atoms/editable-text/EditableText.tsx:66:7
     },
   ]);
 
-  if (editMode && !readOnly) {
+  if (false) {
     return (
       <EditView
killedBy: EditableText renders an input when the text is clicked
statusReason: Unable to find an accessible element with the role "textbox"

Here are the accessible roles:

  button:

  Name "Editable text":
  <span

[Killed] LogicalOperator
components/atoms/editable-text/EditableText.tsx:66:7
     },
   ]);
 
-  if (editMode && !readOnly) {
+  if (editMode || !readOnly) {
     return (
       <EditView
killedBy: EditableText renders ReadView by default
statusReason: Snapshot `EditableText > renders ReadView by default 1` mismatched
