[Killed] BlockStatement
components/atoms/editable-text/ReadView.tsx:17:7
   onClick,
   className,
   ...rest
-}) => {
-  const handleKeyDown = (e: React.KeyboardEvent) => {
-    if (e.key === 'Enter' || e.key === ' ') {
-      e.preventDefault();
-      onClick(e as unknown as React.MouseEvent);
-    }
-  };
-
-  return (
-    <span
-      onClick={onClick}
-      className={className}
-      role="button"
-      tabIndex={0}
-      onKeyDown={handleKeyDown}
-      aria-label="Editable text"
-      {...rest}
-    >
-      {value || placeholder}
-    </span>
-  );
-};
+}) => {};
 
killedBy: EditableText renders ReadView by default
statusReason: Snapshot `EditableText > renders ReadView by default 1` mismatched

[Killed] BlockStatement
components/atoms/editable-text/ReadView.tsx:18:53
   className,
   ...rest
 }) => {
-  const handleKeyDown = (e: React.KeyboardEvent) => {
-    if (e.key === 'Enter' || e.key === ' ') {
-      e.preventDefault();
-      onClick(e as unknown as React.MouseEvent);
-    }
-  };
+  const handleKeyDown = (e: React.KeyboardEvent) => {};
 
   return (
killedBy: EditableText > ReadView calls onClick when Enter key is pressed
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/atoms/editable-text/ReadView.tsx:19:30
   ...rest
 }) => {
   const handleKeyDown = (e: React.KeyboardEvent) => {
-    if (e.key === 'Enter' || e.key === ' ') {
+    if (e.key === 'Enter' || false) {
       e.preventDefault();
       onClick(e as unknown as React.MouseEvent);
killedBy: EditableText > ReadView calls onClick when Space key is pressed
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/atoms/editable-text/ReadView.tsx:19:9
   ...rest
 }) => {
   const handleKeyDown = (e: React.KeyboardEvent) => {
-    if (e.key === 'Enter' || e.key === ' ') {
+    if (false) {
       e.preventDefault();
       onClick(e as unknown as React.MouseEvent);
killedBy: EditableText > ReadView calls onClick when Enter key is pressed
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/atoms/editable-text/ReadView.tsx:35:8
       aria-label="Editable text"
       {...rest}
     >
-      {value || placeholder}
+      {true}
     </span>
   );
killedBy: EditableText > ReadView renders with provided value
statusReason: Unable to find an element with the text: Test Value. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-label="Editable text"
      class="test-class"

[Killed] ConditionalExpression
components/atoms/editable-text/ReadView.tsx:35:8
       aria-label="Editable text"
       {...rest}
     >
-      {value || placeholder}
+      {false}
     </span>
   );
killedBy: EditableText > ReadView renders with provided value
statusReason: Unable to find an element with the text: Test Value. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-label="Editable text"
      class="test-class"
