[Killed] BlockStatement
components/atoms/editable-text/useEditModeState.ts:3:87
 import { useState } from 'react';
 
-export const useEditModeState = (controlledEditMode?: boolean, readOnly?: boolean) => {
-  const [isEditMode, setIsEditMode] = useState(false);
-  const [isControlled] = useState(controlledEditMode !== undefined);
-
-  const editMode = isControlled ? !!controlledEditMode : isEditMode;
-
-  const enterEditMode = () => {
-    if (!isControlled && !readOnly) {
-      setIsEditMode(true);
-    }
-  };
-
-  const exitEditMode = () => {
-    if (!isControlled) {
-      setIsEditMode(false);
-    }
-  };
-
-  return {
-    editMode,
-    enterEditMode,
-    exitEditMode,
-    isControlled,
-  };
-};
+export const useEditModeState = (controlledEditMode?: boolean, readOnly?: boolean) => {};
 
killedBy: EditableText renders ReadView by default
statusReason: Cannot destructure property 'editMode' of '(0 , __vite_ssr_import_6__.useEditModeState)(...)' as it is undefined.

[Killed] BooleanLiteral
components/atoms/editable-text/useEditModeState.ts:4:48
 import { useState } from 'react';
 
 export const useEditModeState = (controlledEditMode?: boolean, readOnly?: boolean) => {
-  const [isEditMode, setIsEditMode] = useState(false);
+  const [isEditMode, setIsEditMode] = useState(true);
   const [isControlled] = useState(controlledEditMode !== undefined);
 
killedBy: EditableText renders ReadView by default
statusReason: Snapshot `EditableText > renders ReadView by default 1` mismatched

[Killed] ConditionalExpression
components/atoms/editable-text/useEditModeState.ts:5:35
 
 export const useEditModeState = (controlledEditMode?: boolean, readOnly?: boolean) => {
   const [isEditMode, setIsEditMode] = useState(false);
-  const [isControlled] = useState(controlledEditMode !== undefined);
+  const [isControlled] = useState(true);
 
   const editMode = isControlled ? !!controlledEditMode : isEditMode;
killedBy: EditableText renders an input when the text is clicked
statusReason: Unable to find an accessible element with the role "textbox"

Here are the accessible roles:

  button:

  Name "Editable text":
  <span

[Killed] EqualityOperator
components/atoms/editable-text/useEditModeState.ts:5:35
 
 export const useEditModeState = (controlledEditMode?: boolean, readOnly?: boolean) => {
   const [isEditMode, setIsEditMode] = useState(false);
-  const [isControlled] = useState(controlledEditMode !== undefined);
+  const [isControlled] = useState(controlledEditMode === undefined);
 
   const editMode = isControlled ? !!controlledEditMode : isEditMode;
killedBy: useEditModeState should initialize with editMode false when uncontrolled
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
components/atoms/editable-text/useEditModeState.ts:7:35
   const [isEditMode, setIsEditMode] = useState(false);
   const [isControlled] = useState(controlledEditMode !== undefined);
 
-  const editMode = isControlled ? !!controlledEditMode : isEditMode;
+  const editMode = isControlled ? !controlledEditMode : isEditMode;
 
   const enterEditMode = () => {
killedBy: useEditModeState should use controlled value when provided
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
components/atoms/editable-text/useEditModeState.ts:9:31
 
   const editMode = isControlled ? !!controlledEditMode : isEditMode;
 
-  const enterEditMode = () => {
-    if (!isControlled && !readOnly) {
-      setIsEditMode(true);
-    }
-  };
+  const enterEditMode = () => {};
 
   const exitEditMode = () => {
killedBy: useEditModeState should enter edit mode when uncontrolled and not read-only
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
components/atoms/editable-text/useEditModeState.ts:10:26
   const editMode = isControlled ? !!controlledEditMode : isEditMode;
 
   const enterEditMode = () => {
-    if (!isControlled && !readOnly) {
+    if (!isControlled && readOnly) {
       setIsEditMode(true);
     }
killedBy: useEditModeState should enter edit mode when uncontrolled and not read-only
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
components/atoms/editable-text/useEditModeState.ts:10:9
   const editMode = isControlled ? !!controlledEditMode : isEditMode;
 
   const enterEditMode = () => {
-    if (!isControlled && !readOnly) {
+    if (isControlled && !readOnly) {
       setIsEditMode(true);
     }
killedBy: useEditModeState should enter edit mode when uncontrolled and not read-only
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
components/atoms/editable-text/useEditModeState.ts:11:21
 
   const enterEditMode = () => {
     if (!isControlled && !readOnly) {
-      setIsEditMode(true);
+      setIsEditMode(false);
     }
   };
killedBy: useEditModeState should enter edit mode when uncontrolled and not read-only
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
components/atoms/editable-text/useEditModeState.ts:15:30
     }
   };
 
-  const exitEditMode = () => {
-    if (!isControlled) {
-      setIsEditMode(false);
-    }
-  };
+  const exitEditMode = () => {};
 
   return {
killedBy: useEditModeState should exit edit mode when uncontrolled
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
components/atoms/editable-text/useEditModeState.ts:16:24
   };
 
   const exitEditMode = () => {
-    if (!isControlled) {
-      setIsEditMode(false);
-    }
+    if (!isControlled) {}
   };
 
killedBy: EditableText allows to change the text by typing in a new value
statusReason: Unable to find an element with the text: test. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <input
      class="cl-editable-text cl-editable-text_edit-mode"
      placeholder="Click to edit..."

[Killed] BooleanLiteral
components/atoms/editable-text/useEditModeState.ts:16:9
   };
 
   const exitEditMode = () => {
-    if (!isControlled) {
+    if (isControlled) {
       setIsEditMode(false);
     }
killedBy: useEditModeState should exit edit mode when uncontrolled
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
components/atoms/editable-text/useEditModeState.ts:17:21
 
   const exitEditMode = () => {
     if (!isControlled) {
-      setIsEditMode(false);
+      setIsEditMode(true);
     }
   };
killedBy: EditableText allows to change the text by typing in a new value
statusReason: Unable to find an element with the text: test. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <input
      class="cl-editable-text cl-editable-text_edit-mode"
      placeholder="Click to edit..."
