[Killed] BlockStatement
components/atoms/editable-text/useValueState.ts:6:19
 export const useValueState = (value: string, onChange?: (value: string) => void) => {
   const [internalValue, setInternalValue] = useState(value);
 
-  useEffect(() => {
-    setInternalValue(value);
-  }, [value]);
+  useEffect(() => {}, [value]);
 
   const updateValue = (newValue: string) => {
killedBy: useValueState should sync internal value when prop value changes
statusReason: expected 'initial' to be 'updated' // Object.is equality

[Killed] ArrayDeclaration
components/atoms/editable-text/useValueState.ts:8:6
 
   useEffect(() => {
     setInternalValue(value);
-  }, [value]);
+  }, []);
 
   const updateValue = (newValue: string) => {
killedBy: useValueState should sync internal value when prop value changes
statusReason: expected 'initial' to be 'updated' // Object.is equality

[Killed] BlockStatement
components/atoms/editable-text/useValueState.ts:10:45
     setInternalValue(value);
   }, [value]);
 
-  const updateValue = (newValue: string) => {
-    setInternalValue(newValue);
-  };
+  const updateValue = (newValue: string) => {};
 
   const commitValue = () => {
killedBy: useValueState should update internal value
statusReason: expected 'initial' to be 'new value' // Object.is equality

[Killed] BlockStatement
components/atoms/editable-text/useValueState.ts:14:29
     setInternalValue(newValue);
   };
 
-  const commitValue = () => {
-    if (internalValue !== value) {
-      onChange?.(internalValue);
-    }
-  };
+  const commitValue = () => {};
 
   const resetValue = () => {
killedBy: useValueState should commit value when changed
statusReason: expected "vi.fn()" to be called with arguments: [ 'new value' ]

Number of calls: 0

[Killed] ConditionalExpression
components/atoms/editable-text/useValueState.ts:15:9
   };
 
   const commitValue = () => {
-    if (internalValue !== value) {
+    if (true) {
       onChange?.(internalValue);
     }
killedBy: useValueState should not commit value when unchanged
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "initial",

[Killed] ConditionalExpression
components/atoms/editable-text/useValueState.ts:15:9
   };
 
   const commitValue = () => {
-    if (internalValue !== value) {
+    if (false) {
       onChange?.(internalValue);
     }
killedBy: useValueState should commit value when changed
statusReason: expected "vi.fn()" to be called with arguments: [ 'new value' ]

Number of calls: 0

[Killed] OptionalChaining
components/atoms/editable-text/useValueState.ts:16:7
 
   const commitValue = () => {
     if (internalValue !== value) {
-      onChange?.(internalValue);
+      onChange(internalValue);
     }
   };
killedBy: useValueState should handle undefined onChange callback
statusReason: expected [Function] to not throw an error but 'TypeError: onChange is not a function' was thrown

[Killed] BlockStatement
components/atoms/editable-text/useValueState.ts:20:28
     }
   };
 
-  const resetValue = () => {
-    setInternalValue(value);
-  };
+  const resetValue = () => {};
 
   return {
killedBy: useValueState should reset to original value
statusReason: expected 'modified' to be 'initial' // Object.is equality
