[Survived] BooleanLiteral
components/atoms/error-message/ErrorMessage.tsx:17:13
   errorId,
   testId,
   message = 'Error!',
-  visible = false,
+  visible = true,
   className,
 }) => {

[Killed] BlockStatement
components/atoms/error-message/ErrorMessage.tsx:19:7
   message = 'Error!',
   visible = false,
   className,
-}) => {
-  const errorClass = getClassName([
-    'cl-error-message',
-    className,
-    { 'cl-error-message_visible': visible },
-  ]);
-
-  return (
-    <span
-      id={errorId}
-      className={errorClass}
-      data-testid={testId}
-      aria-hidden={!visible}
-      aria-live="polite"
-    >
-      {message}
-    </span>
-  );
-};
+}) => {};
 
 export default ErrorMessage;
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] BooleanLiteral
components/atoms/error-message/ErrorMessage.tsx:31:20
       id={errorId}
       className={errorClass}
       data-testid={testId}
-      aria-hidden={!visible}
+      aria-hidden={visible}
       aria-live="polite"
     >
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched
