[Killed] BlockStatement
components/atoms/header/Header.tsx:6:88
 import type { FC } from 'react';
 import './Header.css';
 
-const Header: FC<HeaderProps> = ({ as = 'h1', icon, children, className, ...rest }) => {
-  const HeaderTag = as;
-  const headerClass = getClassName([
-    className,
-    'cl-header',
-    icon,
-    {
-      'cl-header__h1': as === 'h1',
-      'cl-header__h2': as === 'h2',
-      'cl-header__h3': as === 'h3',
-      'cl-header__h4': as === 'h4',
-      'cl-header__h5': as === 'h5',
-      'cl-header__h6': as === 'h6',
-    },
-  ]);
-
-  return (
-    <HeaderTag className={headerClass} {...rest}>
-      {children}
-    </HeaderTag>
-  );
-};
+const Header: FC<HeaderProps> = ({ as = 'h1', icon, children, className, ...rest }) => {};
 
 export default Header;
killedBy: Alert should render the alert when opened
statusReason: Unable to find an element with the text: For your information. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <div
      class="cl-alert cl-alert_info"

[Survived] EqualityOperator
components/atoms/header/Header.tsx:13:24
     'cl-header',
     icon,
     {
-      'cl-header__h1': as === 'h1',
+      'cl-header__h1': as !== 'h1',
       'cl-header__h2': as === 'h2',
       'cl-header__h3': as === 'h3',

[Survived] ConditionalExpression
components/atoms/header/Header.tsx:13:24
     'cl-header',
     icon,
     {
-      'cl-header__h1': as === 'h1',
+      'cl-header__h1': true,
       'cl-header__h2': as === 'h2',
       'cl-header__h3': as === 'h3',

[Survived] ConditionalExpression
components/atoms/header/Header.tsx:14:24
     icon,
     {
       'cl-header__h1': as === 'h1',
-      'cl-header__h2': as === 'h2',
+      'cl-header__h2': true,
       'cl-header__h3': as === 'h3',
       'cl-header__h4': as === 'h4',

[Survived] ConditionalExpression
components/atoms/header/Header.tsx:14:24
     icon,
     {
       'cl-header__h1': as === 'h1',
-      'cl-header__h2': as === 'h2',
+      'cl-header__h2': false,
       'cl-header__h3': as === 'h3',
       'cl-header__h4': as === 'h4',

[Survived] ConditionalExpression
components/atoms/header/Header.tsx:15:24
     {
       'cl-header__h1': as === 'h1',
       'cl-header__h2': as === 'h2',
-      'cl-header__h3': as === 'h3',
+      'cl-header__h3': false,
       'cl-header__h4': as === 'h4',
       'cl-header__h5': as === 'h5',

[Survived] EqualityOperator
components/atoms/header/Header.tsx:15:24
     {
       'cl-header__h1': as === 'h1',
       'cl-header__h2': as === 'h2',
-      'cl-header__h3': as === 'h3',
+      'cl-header__h3': as !== 'h3',
       'cl-header__h4': as === 'h4',
       'cl-header__h5': as === 'h5',

[Survived] ConditionalExpression
components/atoms/header/Header.tsx:16:24
       'cl-header__h1': as === 'h1',
       'cl-header__h2': as === 'h2',
       'cl-header__h3': as === 'h3',
-      'cl-header__h4': as === 'h4',
+      'cl-header__h4': false,
       'cl-header__h5': as === 'h5',
       'cl-header__h6': as === 'h6',

[Survived] ConditionalExpression
components/atoms/header/Header.tsx:16:24
       'cl-header__h1': as === 'h1',
       'cl-header__h2': as === 'h2',
       'cl-header__h3': as === 'h3',
-      'cl-header__h4': as === 'h4',
+      'cl-header__h4': true,
       'cl-header__h5': as === 'h5',
       'cl-header__h6': as === 'h6',

[Survived] ConditionalExpression
components/atoms/header/Header.tsx:17:24
       'cl-header__h2': as === 'h2',
       'cl-header__h3': as === 'h3',
       'cl-header__h4': as === 'h4',
-      'cl-header__h5': as === 'h5',
+      'cl-header__h5': false,
       'cl-header__h6': as === 'h6',
     },

[Survived] ConditionalExpression
components/atoms/header/Header.tsx:17:24
       'cl-header__h2': as === 'h2',
       'cl-header__h3': as === 'h3',
       'cl-header__h4': as === 'h4',
-      'cl-header__h5': as === 'h5',
+      'cl-header__h5': true,
       'cl-header__h6': as === 'h6',
     },

[Survived] ConditionalExpression
components/atoms/header/Header.tsx:18:24
       'cl-header__h3': as === 'h3',
       'cl-header__h4': as === 'h4',
       'cl-header__h5': as === 'h5',
-      'cl-header__h6': as === 'h6',
+      'cl-header__h6': false,
     },
   ]);

[Survived] EqualityOperator
components/atoms/header/Header.tsx:18:24
       'cl-header__h3': as === 'h3',
       'cl-header__h4': as === 'h4',
       'cl-header__h5': as === 'h5',
-      'cl-header__h6': as === 'h6',
+      'cl-header__h6': as !== 'h6',
     },
   ]);
