[Killed] BlockStatement
components/atoms/icon/Icon.tsx:21:7
   hidden,
   size = ElementSize.Medium,
   ...rest
-}) => {
-  if (!name) return null;
-
-  const iconClass = getClassName([
-    className,
-    'cl-icon',
-    name,
-    {
-      'cl-icon_extra-small': size === ElementSize.ExtraSmall,
-      'cl-icon_small': size === ElementSize.Small,
-      'cl-icon_medium': size === ElementSize.Medium,
-      'cl-icon_large': size === ElementSize.Large,
-      'cl-icon_xlarge': size === ElementSize.ExtraLarge,
-      'cl-icon_2xlarge': size === ElementSize.ExtraExtraLarge,
-    },
-  ]);
-
-  return <span data-testid={testId} className={iconClass} aria-hidden={hidden} {...rest}></span>;
-};
+}) => {};
 
 export default Icon;
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:22:7
   size = ElementSize.Medium,
   ...rest
 }) => {
-  if (!name) return null;
+  if (false) return null;
 
   const iconClass = getClassName([
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Snapshot `Menu Component > renders a menu bar with the correct role 1` mismatched

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:22:7
   size = ElementSize.Medium,
   ...rest
 }) => {
-  if (!name) return null;
+  if (true) return null;
 
   const iconClass = getClassName([
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:29:30
     'cl-icon',
     name,
     {
-      'cl-icon_extra-small': size === ElementSize.ExtraSmall,
+      'cl-icon_extra-small': false,
       'cl-icon_small': size === ElementSize.Small,
       'cl-icon_medium': size === ElementSize.Medium,
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:29:30
     'cl-icon',
     name,
     {
-      'cl-icon_extra-small': size === ElementSize.ExtraSmall,
+      'cl-icon_extra-small': true,
       'cl-icon_small': size === ElementSize.Small,
       'cl-icon_medium': size === ElementSize.Medium,
killedBy: Menu Component renders a menu bar with the correct role
statusReason: Snapshot `Menu Component > renders a menu bar with the correct role 1` mismatched

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:30:24
     name,
     {
       'cl-icon_extra-small': size === ElementSize.ExtraSmall,
-      'cl-icon_small': size === ElementSize.Small,
+      'cl-icon_small': true,
       'cl-icon_medium': size === ElementSize.Medium,
       'cl-icon_large': size === ElementSize.Large,
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] EqualityOperator
components/atoms/icon/Icon.tsx:30:24
     name,
     {
       'cl-icon_extra-small': size === ElementSize.ExtraSmall,
-      'cl-icon_small': size === ElementSize.Small,
+      'cl-icon_small': size !== ElementSize.Small,
       'cl-icon_medium': size === ElementSize.Medium,
       'cl-icon_large': size === ElementSize.Large,
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:31:25
     {
       'cl-icon_extra-small': size === ElementSize.ExtraSmall,
       'cl-icon_small': size === ElementSize.Small,
-      'cl-icon_medium': size === ElementSize.Medium,
+      'cl-icon_medium': true,
       'cl-icon_large': size === ElementSize.Large,
       'cl-icon_xlarge': size === ElementSize.ExtraLarge,
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:31:25
     {
       'cl-icon_extra-small': size === ElementSize.ExtraSmall,
       'cl-icon_small': size === ElementSize.Small,
-      'cl-icon_medium': size === ElementSize.Medium,
+      'cl-icon_medium': false,
       'cl-icon_large': size === ElementSize.Large,
       'cl-icon_xlarge': size === ElementSize.ExtraLarge,
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:32:24
       'cl-icon_extra-small': size === ElementSize.ExtraSmall,
       'cl-icon_small': size === ElementSize.Small,
       'cl-icon_medium': size === ElementSize.Medium,
-      'cl-icon_large': size === ElementSize.Large,
+      'cl-icon_large': true,
       'cl-icon_xlarge': size === ElementSize.ExtraLarge,
       'cl-icon_2xlarge': size === ElementSize.ExtraExtraLarge,
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:32:24
       'cl-icon_extra-small': size === ElementSize.ExtraSmall,
       'cl-icon_small': size === ElementSize.Small,
       'cl-icon_medium': size === ElementSize.Medium,
-      'cl-icon_large': size === ElementSize.Large,
+      'cl-icon_large': false,
       'cl-icon_xlarge': size === ElementSize.ExtraLarge,
       'cl-icon_2xlarge': size === ElementSize.ExtraExtraLarge,
killedBy: Icon should render icon with large size class
statusReason: expect(element).toHaveClass("cl-icon_large")

Expected the element to have class:
  cl-icon_large
Received:
  cl-icon chop-icon__activity

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:33:25
       'cl-icon_small': size === ElementSize.Small,
       'cl-icon_medium': size === ElementSize.Medium,
       'cl-icon_large': size === ElementSize.Large,
-      'cl-icon_xlarge': size === ElementSize.ExtraLarge,
+      'cl-icon_xlarge': false,
       'cl-icon_2xlarge': size === ElementSize.ExtraExtraLarge,
     },
killedBy: Icon should render icon with extra-large size class
statusReason: expect(element).toHaveClass("cl-icon_xlarge")

Expected the element to have class:
  cl-icon_xlarge
Received:
  cl-icon chop-icon__activity

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:33:25
       'cl-icon_small': size === ElementSize.Small,
       'cl-icon_medium': size === ElementSize.Medium,
       'cl-icon_large': size === ElementSize.Large,
-      'cl-icon_xlarge': size === ElementSize.ExtraLarge,
+      'cl-icon_xlarge': true,
       'cl-icon_2xlarge': size === ElementSize.ExtraExtraLarge,
     },
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] ConditionalExpression
components/atoms/icon/Icon.tsx:34:26
       'cl-icon_medium': size === ElementSize.Medium,
       'cl-icon_large': size === ElementSize.Large,
       'cl-icon_xlarge': size === ElementSize.ExtraLarge,
-      'cl-icon_2xlarge': size === ElementSize.ExtraExtraLarge,
+      'cl-icon_2xlarge': false,
     },
   ]);
killedBy: Icon should render icon with extra-extra-large size class
statusReason: expect(element).toHaveClass("cl-icon_2xlarge")

Expected the element to have class:
  cl-icon_2xlarge
Received:
  cl-icon chop-icon__activity

[Killed] EqualityOperator
components/atoms/icon/Icon.tsx:34:26
       'cl-icon_medium': size === ElementSize.Medium,
       'cl-icon_large': size === ElementSize.Large,
       'cl-icon_xlarge': size === ElementSize.ExtraLarge,
-      'cl-icon_2xlarge': size === ElementSize.ExtraExtraLarge,
+      'cl-icon_2xlarge': size !== ElementSize.ExtraExtraLarge,
     },
   ]);
killedBy: Icon should render icon with extra-extra-large size class
statusReason: expect(element).toHaveClass("cl-icon_2xlarge")

Expected the element to have class:
  cl-icon_2xlarge
Received:
  cl-icon chop-icon__activity
