[Killed] BlockStatement
components/atoms/image/BasicImage.tsx:23:7
   loading = 'lazy',
   decoding = 'async',
   onError,
-}) => {
-  return (
-    <img
-      src={src}
-      alt={alt}
-      width={width}
-      height={height}
-      loading={loading}
-      decoding={decoding}
-      sizes={sizes}
-      className="cl-image__img"
-      onError={onError}
-    />
-  );
-};
+}) => {};
 
killedBy: Image renders normal image initially
statusReason: Unable to find an accessible element with the role "img"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div
