[Killed] BooleanLiteral
components/atoms/image/Image.tsx:14:16
   alt,
   sources = [],
   className,
-  decorative = false,
+  decorative = true,
   onError,
   ...rest
killedBy: Image renders normal image initially
statusReason: Unable to find an accessible element with the role "img"

Here are the accessible roles:

  presentation:

  Name "":
  <img

[Killed] BlockStatement
components/atoms/image/Image.tsx:17:7
   decorative = false,
   onError,
   ...rest
-}) => {
-  const [hasError, setHasError] = useState(false);
-  const wrapperClass = getClassName(['cl-image', className]);
-  const hasResponsiveSources = sources.length > 0;
-  const finalAlt = decorative ? '' : alt;
-
-  const handleError = (event: React.SyntheticEvent<HTMLImageElement, Event>) => {
-    setHasError(true);
-    onError?.(event);
-  };
-
-  if (hasError) {
-    return <FallbackImage />;
-  }
-
-  return hasResponsiveSources ? (
-    <ResponsivePicture alt={finalAlt} sources={sources} onError={handleError} {...rest} />
-  ) : (
-    <div className={wrapperClass}>
-      <BasicImage alt={finalAlt} onError={handleError} {...rest} />
-    </div>
-  );
-};
+}) => {};
 
 const Image = withFigureCaption(ImageContainer);
killedBy: Image renders normal image initially
statusReason: Unable to find an accessible element with the role "img"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
components/atoms/image/Image.tsx:18:44
   onError,
   ...rest
 }) => {
-  const [hasError, setHasError] = useState(false);
+  const [hasError, setHasError] = useState(true);
   const wrapperClass = getClassName(['cl-image', className]);
   const hasResponsiveSources = sources.length > 0;
killedBy: Image renders normal image initially
statusReason: Unable to find an accessible element with the role "img"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] ConditionalExpression
components/atoms/image/Image.tsx:20:32
 }) => {
   const [hasError, setHasError] = useState(false);
   const wrapperClass = getClassName(['cl-image', className]);
-  const hasResponsiveSources = sources.length > 0;
+  const hasResponsiveSources = false;
   const finalAlt = decorative ? '' : alt;
 
killedBy: Image should apply cl-image__picture BEM class to picture element
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
components/atoms/image/Image.tsx:20:32
 }) => {
   const [hasError, setHasError] = useState(false);
   const wrapperClass = getClassName(['cl-image', className]);
-  const hasResponsiveSources = sources.length > 0;
+  const hasResponsiveSources = true;
   const finalAlt = decorative ? '' : alt;
 
killedBy: Image should apply cl-image BEM class to wrapper
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] BlockStatement
components/atoms/image/Image.tsx:23:81
   const hasResponsiveSources = sources.length > 0;
   const finalAlt = decorative ? '' : alt;
 
-  const handleError = (event: React.SyntheticEvent<HTMLImageElement, Event>) => {
-    setHasError(true);
-    onError?.(event);
-  };
+  const handleError = (event: React.SyntheticEvent<HTMLImageElement, Event>) => {};
 
   if (hasError) {
killedBy: Image shows fallback when basic image fails to load
statusReason: Unable to find an element by: [data-testid="fallback-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-image"
    >

[Killed] BooleanLiteral
components/atoms/image/Image.tsx:24:17
   const finalAlt = decorative ? '' : alt;
 
   const handleError = (event: React.SyntheticEvent<HTMLImageElement, Event>) => {
-    setHasError(true);
+    setHasError(false);
     onError?.(event);
   };
killedBy: Image shows fallback when basic image fails to load
statusReason: Unable to find an element by: [data-testid="fallback-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-image"
    >

[Killed] ConditionalExpression
components/atoms/image/Image.tsx:28:7
     onError?.(event);
   };
 
-  if (hasError) {
+  if (true) {
     return <FallbackImage />;
   }
killedBy: Image renders normal image initially
statusReason: Unable to find an accessible element with the role "img"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] BlockStatement
components/atoms/image/Image.tsx:28:17
     onError?.(event);
   };
 
-  if (hasError) {
-    return <FallbackImage />;
-  }
+  if (hasError) {}
 
   return hasResponsiveSources ? (
killedBy: Image shows fallback when basic image fails to load
statusReason: Unable to find an element by: [data-testid="fallback-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-image"
    >
