[Killed] BooleanLiteral
components/atoms/label/Label.tsx:26:18
   inputId,
   icon,
   iconPosition,
-  isTextHidden = false,
+  isTextHidden = true,
   iconSize = ElementSize.ExtraSmall,
   disabled = false,
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] BooleanLiteral
components/atoms/label/Label.tsx:28:14
   iconPosition,
   isTextHidden = false,
   iconSize = ElementSize.ExtraSmall,
-  disabled = false,
+  disabled = true,
   className,
   testId,
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] BlockStatement
components/atoms/label/Label.tsx:31:7
   disabled = false,
   className,
   testId,
-}) => {
-  const isLeftIconVisible = !!icon && iconPosition === 'left';
-  const isRightIconVisible = !!icon && iconPosition === 'right';
-  const IconElement = <Icon name={icon} size={iconSize} />;
-  const labelClass = getClassName(['cl-label', className, { 'cl-label_disabled': disabled }]);
-
-  return (
-    <label className={labelClass} htmlFor={inputId} data-testid={testId}>
-      {isLeftIconVisible && IconElement}
-      {!isTextHidden && (
-        <span className="cl-label__text">
-          {label}
-          {required && (
-            <abbr className="cl-label__required" title="required">
-              *
-            </abbr>
-          )}
-        </span>
-      )}
-      {isRightIconVisible && IconElement}
-    </label>
-  );
-};
+}) => {};
 
 export default Label;
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] BooleanLiteral
components/atoms/label/Label.tsx:32:29
   className,
   testId,
 }) => {
-  const isLeftIconVisible = !!icon && iconPosition === 'left';
+  const isLeftIconVisible = !icon && iconPosition === 'left';
   const isRightIconVisible = !!icon && iconPosition === 'right';
   const IconElement = <Icon name={icon} size={iconSize} />;
killedBy: Label should render left icon
statusReason: Snapshot `Label > should render left icon 1` mismatched

[Killed] ConditionalExpression
components/atoms/label/Label.tsx:32:29
   className,
   testId,
 }) => {
-  const isLeftIconVisible = !!icon && iconPosition === 'left';
+  const isLeftIconVisible = true;
   const isRightIconVisible = !!icon && iconPosition === 'right';
   const IconElement = <Icon name={icon} size={iconSize} />;
killedBy: Label should render right icon
statusReason: Snapshot `Label > should render right icon 1` mismatched

[Killed] LogicalOperator
components/atoms/label/Label.tsx:33:30
   testId,
 }) => {
   const isLeftIconVisible = !!icon && iconPosition === 'left';
-  const isRightIconVisible = !!icon && iconPosition === 'right';
+  const isRightIconVisible = !!icon || iconPosition === 'right';
   const IconElement = <Icon name={icon} size={iconSize} />;
   const labelClass = getClassName(['cl-label', className, { 'cl-label_disabled': disabled }]);
killedBy: Label should render left icon
statusReason: Snapshot `Label > should render left icon 1` mismatched

[Killed] EqualityOperator
components/atoms/label/Label.tsx:33:40
   testId,
 }) => {
   const isLeftIconVisible = !!icon && iconPosition === 'left';
-  const isRightIconVisible = !!icon && iconPosition === 'right';
+  const isRightIconVisible = !!icon && iconPosition !== 'right';
   const IconElement = <Icon name={icon} size={iconSize} />;
   const labelClass = getClassName(['cl-label', className, { 'cl-label_disabled': disabled }]);
killedBy: Label should render left icon
statusReason: Snapshot `Label > should render left icon 1` mismatched

[Killed] ConditionalExpression
components/atoms/label/Label.tsx:39:8
 
   return (
     <label className={labelClass} htmlFor={inputId} data-testid={testId}>
-      {isLeftIconVisible && IconElement}
+      {true}
       {!isTextHidden && (
         <span className="cl-label__text">
killedBy: Label should render left icon
statusReason: Snapshot `Label > should render left icon 1` mismatched

[Killed] ConditionalExpression
components/atoms/label/Label.tsx:39:8
 
   return (
     <label className={labelClass} htmlFor={inputId} data-testid={testId}>
-      {isLeftIconVisible && IconElement}
+      {false}
       {!isTextHidden && (
         <span className="cl-label__text">
killedBy: Label should render left icon
statusReason: Snapshot `Label > should render left icon 1` mismatched

[Killed] ConditionalExpression
components/atoms/label/Label.tsx:40:8
   return (
     <label className={labelClass} htmlFor={inputId} data-testid={testId}>
       {isLeftIconVisible && IconElement}
-      {!isTextHidden && (
-        <span className="cl-label__text">
-          {label}
-          {required && (
-            <abbr className="cl-label__required" title="required">
-              *
-            </abbr>
-          )}
-        </span>
-      )}
+      {true}
       {isRightIconVisible && IconElement}
     </label>
killedBy: Label should render correctly as required label
statusReason: Snapshot `Label > should render correctly as required label 1` mismatched

[Killed] ConditionalExpression
components/atoms/label/Label.tsx:40:8
   return (
     <label className={labelClass} htmlFor={inputId} data-testid={testId}>
       {isLeftIconVisible && IconElement}
-      {!isTextHidden && (
-        <span className="cl-label__text">
-          {label}
-          {required && (
-            <abbr className="cl-label__required" title="required">
-              *
-            </abbr>
-          )}
-        </span>
-      )}
+      {false}
       {isRightIconVisible && IconElement}
     </label>
killedBy: Label should render correctly as required label
statusReason: Snapshot `Label > should render correctly as required label 1` mismatched

[Killed] ConditionalExpression
components/atoms/label/Label.tsx:43:12
       {!isTextHidden && (
         <span className="cl-label__text">
           {label}
-          {required && (
-            <abbr className="cl-label__required" title="required">
-              *
-            </abbr>
-          )}
+          {true}
         </span>
       )}
killedBy: Label should render correctly as required label
statusReason: Snapshot `Label > should render correctly as required label 1` mismatched

[Killed] LogicalOperator
components/atoms/label/Label.tsx:43:12
       {!isTextHidden && (
         <span className="cl-label__text">
           {label}
-          {required && (
-            <abbr className="cl-label__required" title="required">
-              *
-            </abbr>
-          )}
+          {required || <abbr className="cl-label__required" title="required">
+              *
+            </abbr>}
         </span>
       )}
killedBy: Label should render correctly as required label
statusReason: Snapshot `Label > should render correctly as required label 1` mismatched

[Killed] LogicalOperator
components/atoms/label/Label.tsx:50:8
           )}
         </span>
       )}
-      {isRightIconVisible && IconElement}
+      {isRightIconVisible || IconElement}
     </label>
   );
killedBy: Label should render left icon
statusReason: Snapshot `Label > should render left icon 1` mismatched

[Killed] ConditionalExpression
components/atoms/label/Label.tsx:50:8
           )}
         </span>
       )}
-      {isRightIconVisible && IconElement}
+      {true}
     </label>
   );
killedBy: Label should render right icon
statusReason: Snapshot `Label > should render right icon 1` mismatched
