[Killed] BooleanLiteral
components/atoms/link/Link.tsx:14:14
   children,
   icon,
   iconPosition = 'left',
-  external = false,
+  external = true,
   disabled = false,
   className,
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] BooleanLiteral
components/atoms/link/Link.tsx:15:14
   icon,
   iconPosition = 'left',
   external = false,
-  disabled = false,
+  disabled = true,
   className,
   target,
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] ArrayDeclaration
components/atoms/link/Link.tsx:20:34
   target,
   ...rest
 }) => {
-  const linkClass = getClassName(['cl-link', className, { 'cl-link_disabled': disabled }]);
+  const linkClass = getClassName([]);
   const isExternal = external || href.startsWith('http') || href.startsWith('//');
   const linkTarget = isExternal ? target || '_blank' : target;
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:21:22
   ...rest
 }) => {
   const linkClass = getClassName(['cl-link', className, { 'cl-link_disabled': disabled }]);
-  const isExternal = external || href.startsWith('http') || href.startsWith('//');
+  const isExternal = false;
   const linkTarget = isExternal ? target || '_blank' : target;
   const iconElement = icon ? (
killedBy: Link target handling sets _blank target for external links without explicit target
statusReason: expect(element).toHaveAttribute("target", "_blank") // element.getAttribute("target") === "_blank"

Expected the element to have attribute:
  target="_blank"
Received:
  null

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:21:22
   ...rest
 }) => {
   const linkClass = getClassName(['cl-link', className, { 'cl-link_disabled': disabled }]);
-  const isExternal = external || href.startsWith('http') || href.startsWith('//');
+  const isExternal = false || href.startsWith('//');
   const linkTarget = isExternal ? target || '_blank' : target;
   const iconElement = icon ? (
killedBy: Link target handling sets _blank target for external links without explicit target
statusReason: expect(element).toHaveAttribute("target", "_blank") // element.getAttribute("target") === "_blank"

Expected the element to have attribute:
  target="_blank"
Received:
  null

[Killed] LogicalOperator
components/atoms/link/Link.tsx:22:35
 }) => {
   const linkClass = getClassName(['cl-link', className, { 'cl-link_disabled': disabled }]);
   const isExternal = external || href.startsWith('http') || href.startsWith('//');
-  const linkTarget = isExternal ? target || '_blank' : target;
+  const linkTarget = isExternal ? target && '_blank' : target;
   const iconElement = icon ? (
     <Icon name={icon} className="cl-link__icon" hidden size={ElementSize.Small} />
killedBy: Link target handling sets _blank target for external links without explicit target
statusReason: expect(element).toHaveAttribute("target", "_blank") // element.getAttribute("target") === "_blank"

Expected the element to have attribute:
  target="_blank"
Received:
  null

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:22:35
 }) => {
   const linkClass = getClassName(['cl-link', className, { 'cl-link_disabled': disabled }]);
   const isExternal = external || href.startsWith('http') || href.startsWith('//');
-  const linkTarget = isExternal ? target || '_blank' : target;
+  const linkTarget = isExternal ? false : target;
   const iconElement = icon ? (
     <Icon name={icon} className="cl-link__icon" hidden size={ElementSize.Small} />
killedBy: Link applies target and rel attributes
statusReason: expect(element).toHaveAttribute("target", "_blank") // element.getAttribute("target") === "_blank"

Expected the element to have attribute:
  target="_blank"
Received:
  null

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:26:22
   const iconElement = icon ? (
     <Icon name={icon} className="cl-link__icon" hidden size={ElementSize.Small} />
   ) : null;
-  const isLeftIcon = icon && iconPosition === 'left';
+  const isLeftIcon = false;
   const isRightIcon = icon && iconPosition === 'right';
 
killedBy: Link icon rendering renders icon on the left by default
statusReason: Unable to find an element by: [data-testid="mock-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <a
      aria-disabled="false"
      aria-label="With Icon (opens in new window)"

[Killed] EqualityOperator
components/atoms/link/Link.tsx:26:30
   const iconElement = icon ? (
     <Icon name={icon} className="cl-link__icon" hidden size={ElementSize.Small} />
   ) : null;
-  const isLeftIcon = icon && iconPosition === 'left';
+  const isLeftIcon = icon && iconPosition !== 'left';
   const isRightIcon = icon && iconPosition === 'right';
 
killedBy: Link icon rendering renders icon on the left by default
statusReason: Unable to find an element by: [data-testid="mock-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <a
      aria-disabled="false"
      aria-label="With Icon (opens in new window)"

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:27:23
     <Icon name={icon} className="cl-link__icon" hidden size={ElementSize.Small} />
   ) : null;
   const isLeftIcon = icon && iconPosition === 'left';
-  const isRightIcon = icon && iconPosition === 'right';
+  const isRightIcon = false;
 
   return (
killedBy: Link icon rendering renders icon on the right when specified
statusReason: Unable to find an element by: [data-testid="mock-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <a
      aria-disabled="false"
      aria-label="With Icon (opens in new window)"

[Killed] EqualityOperator
components/atoms/link/Link.tsx:27:31
     <Icon name={icon} className="cl-link__icon" hidden size={ElementSize.Small} />
   ) : null;
   const isLeftIcon = icon && iconPosition === 'left';
-  const isRightIcon = icon && iconPosition === 'right';
+  const isRightIcon = icon && iconPosition !== 'right';
 
   return (
killedBy: Link icon rendering renders icon on the left by default
statusReason: Found multiple elements by: [data-testid="mock-icon"]

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  aria-hidden="true"
  class="cl-link__icon"

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:34:12
       href={href}
       className={linkClass}
       target={linkTarget}
-      {...(isExternal && {
-        'aria-label':
-          typeof children === 'string'
-            ? `${children} (opens in new window)`
-            : 'Opens in new window',
-      })}
+      {...(false)}
       aria-disabled={disabled}
       {...rest}
killedBy: Link aria-label handling adds (opens in new window) to aria-label for string children
statusReason: expect(element).toHaveAttribute("aria-label", "Visit Site (opens in new window)") // element.getAttribute("aria-label") === "Visit Site (opens in new window)"

Expected the element to have attribute:
  aria-label="Visit Site (opens in new window)"
Received:
  null

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:34:12
       href={href}
       className={linkClass}
       target={linkTarget}
-      {...(isExternal && {
-        'aria-label':
-          typeof children === 'string'
-            ? `${children} (opens in new window)`
-            : 'Opens in new window',
-      })}
+      {...(true)}
       aria-disabled={disabled}
       {...rest}
killedBy: Link aria-label handling adds (opens in new window) to aria-label for string children
statusReason: expect(element).toHaveAttribute("aria-label", "Visit Site (opens in new window)") // element.getAttribute("aria-label") === "Visit Site (opens in new window)"

Expected the element to have attribute:
  aria-label="Visit Site (opens in new window)"
Received:
  null

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:36:11
       target={linkTarget}
       {...(isExternal && {
         'aria-label':
-          typeof children === 'string'
+          false
             ? `${children} (opens in new window)`
             : 'Opens in new window',
killedBy: Link aria-label handling adds (opens in new window) to aria-label for string children
statusReason: expect(element).toHaveAttribute("aria-label", "Visit Site (opens in new window)") // element.getAttribute("aria-label") === "Visit Site (opens in new window)"

Expected the element to have attribute:
  aria-label="Visit Site (opens in new window)"
Received:
  aria-label="Opens in new window"

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:36:11
       target={linkTarget}
       {...(isExternal && {
         'aria-label':
-          typeof children === 'string'
+          true
             ? `${children} (opens in new window)`
             : 'Opens in new window',
killedBy: Link aria-label handling uses generic aria-label for non-string children
statusReason: expect(element).toHaveAttribute("aria-label", "Opens in new window") // element.getAttribute("aria-label") === "Opens in new window"

Expected the element to have attribute:
  aria-label="Opens in new window"
Received:
  aria-label="[object Object] (opens in new window)"

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:43:8
       aria-disabled={disabled}
       {...rest}
     >
-      {isLeftIcon && iconElement}
+      {false}
       <span className="cl-link__text">{children}</span>
       {isRightIcon && iconElement}
killedBy: Link icon rendering renders icon on the left by default
statusReason: Unable to find an element by: [data-testid="mock-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <a
      aria-disabled="false"
      aria-label="With Icon (opens in new window)"

[Killed] LogicalOperator
components/atoms/link/Link.tsx:43:8
       aria-disabled={disabled}
       {...rest}
     >
-      {isLeftIcon && iconElement}
+      {isLeftIcon || iconElement}
       <span className="cl-link__text">{children}</span>
       {isRightIcon && iconElement}
killedBy: Link icon rendering renders icon on the left by default
statusReason: Unable to find an element by: [data-testid="mock-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <a
      aria-disabled="false"
      aria-label="With Icon (opens in new window)"

[Killed] LogicalOperator
components/atoms/link/Link.tsx:45:8
     >
       {isLeftIcon && iconElement}
       <span className="cl-link__text">{children}</span>
-      {isRightIcon && iconElement}
+      {isRightIcon || iconElement}
     </a>
   );
killedBy: Link icon rendering renders icon on the left by default
statusReason: Found multiple elements by: [data-testid="mock-icon"]

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  aria-hidden="true"
  class="cl-link__icon"

[Killed] ConditionalExpression
components/atoms/link/Link.tsx:45:8
     >
       {isLeftIcon && iconElement}
       <span className="cl-link__text">{children}</span>
-      {isRightIcon && iconElement}
+      {false}
     </a>
   );
killedBy: Link icon rendering renders icon on the right when specified
statusReason: Unable to find an element by: [data-testid="mock-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <a
      aria-disabled="false"
      aria-label="With Icon (opens in new window)"
