[Killed] BlockStatement
components/atoms/portal/Portal.tsx:4:75
 import { type ReactElement, type ReactPortal, useEffect, useState } from 'react';
 import ReactDOM from 'react-dom';
 
-const Portal = ({ children }: { children: ReactElement }): ReactPortal => {
-  const [container] = useState(() => document.createElement('div'));
-
-  useEffect(() => {
-    // Append a new portal at the end of the body element on mount
-    document.body.appendChild(container);
-
-    // Remove the portal on unmount
-    return () => {
-      container.remove();
-    };
-  }, [container]);
-
-  return ReactDOM.createPortal(children, container);
-};
+const Portal = ({ children }: { children: ReactElement }): ReactPortal => {};
 
 export default Portal;
killedBy: Tooltip should show and hide tooltip on hover
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ArrowFunction
components/atoms/portal/Portal.tsx:5:32
 import ReactDOM from 'react-dom';
 
 const Portal = ({ children }: { children: ReactElement }): ReactPortal => {
-  const [container] = useState(() => document.createElement('div'));
+  const [container] = useState(() => undefined);
 
   useEffect(() => {
killedBy: Tooltip should show and hide tooltip on hover
statusReason: Target container is not a DOM element.

[Killed] BlockStatement
components/atoms/portal/Portal.tsx:7:19
 const Portal = ({ children }: { children: ReactElement }): ReactPortal => {
   const [container] = useState(() => document.createElement('div'));
 
-  useEffect(() => {
-    // Append a new portal at the end of the body element on mount
-    document.body.appendChild(container);
-
-    // Remove the portal on unmount
-    return () => {
-      container.remove();
-    };
-  }, [container]);
+  useEffect(() => {}, [container]);
 
   return ReactDOM.createPortal(children, container);
killedBy: Tooltip should show and hide tooltip on hover
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Survived] BlockStatement
components/atoms/portal/Portal.tsx:12:18
     document.body.appendChild(container);
 
     // Remove the portal on unmount
-    return () => {
-      container.remove();
-    };
+    return () => {};
   }, [container]);
 

[Survived] ArrayDeclaration
components/atoms/portal/Portal.tsx:15:6
     return () => {
       container.remove();
     };
-  }, [container]);
+  }, []);
 
   return ReactDOM.createPortal(children, container);
