[Killed] BooleanLiteral
components/atoms/tooltip/Tooltip.controller.ts:17:44
 };
 
 export const useTooltipController = ({ id, autoClose, autoCloseDelay }: Params) => {
-  const [isOpened, setIsOpened] = useState(false);
+  const [isOpened, setIsOpened] = useState(true);
   const wrapperRef = useRef(null);
   const tooltipRef = useRef<HTMLDivElement>(null);
killedBy: Tooltip should show and hide tooltip on click
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ArrowFunction
components/atoms/tooltip/Tooltip.controller.ts:23:24
   const { top, left } = useTooltipPosition({ wrapperRef, tooltipRef, isOpened });
   const { elementId } = useElementIds(id);
 
-  const closeTooltip = () => setIsOpened(false);
+  const closeTooltip = () => undefined;
   const openTooltip = () => setIsOpened(true);
   const toggleTooltip = () => setIsOpened(!isOpened);
killedBy: Tooltip should show and hide tooltip on hover
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] BooleanLiteral
components/atoms/tooltip/Tooltip.controller.ts:23:42
   const { top, left } = useTooltipPosition({ wrapperRef, tooltipRef, isOpened });
   const { elementId } = useElementIds(id);
 
-  const closeTooltip = () => setIsOpened(false);
+  const closeTooltip = () => setIsOpened(true);
   const openTooltip = () => setIsOpened(true);
   const toggleTooltip = () => setIsOpened(!isOpened);
killedBy: Tooltip should show and hide tooltip on hover
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] BooleanLiteral
components/atoms/tooltip/Tooltip.controller.ts:24:41
   const { elementId } = useElementIds(id);
 
   const closeTooltip = () => setIsOpened(false);
-  const openTooltip = () => setIsOpened(true);
+  const openTooltip = () => setIsOpened(false);
   const toggleTooltip = () => setIsOpened(!isOpened);
   const handleContextMenu = (e: MouseEvent) => {
killedBy: Tooltip should show and hide tooltip on hover
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ArrowFunction
components/atoms/tooltip/Tooltip.controller.ts:24:23
   const { elementId } = useElementIds(id);
 
   const closeTooltip = () => setIsOpened(false);
-  const openTooltip = () => setIsOpened(true);
+  const openTooltip = () => undefined;
   const toggleTooltip = () => setIsOpened(!isOpened);
   const handleContextMenu = (e: MouseEvent) => {
killedBy: Tooltip should show and hide tooltip on hover
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] BooleanLiteral
components/atoms/tooltip/Tooltip.controller.ts:25:43
 
   const closeTooltip = () => setIsOpened(false);
   const openTooltip = () => setIsOpened(true);
-  const toggleTooltip = () => setIsOpened(!isOpened);
+  const toggleTooltip = () => setIsOpened(isOpened);
   const handleContextMenu = (e: MouseEvent) => {
     e.preventDefault();
killedBy: Tooltip should show and hide tooltip on click
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ArrowFunction
components/atoms/tooltip/Tooltip.controller.ts:25:25
 
   const closeTooltip = () => setIsOpened(false);
   const openTooltip = () => setIsOpened(true);
-  const toggleTooltip = () => setIsOpened(!isOpened);
+  const toggleTooltip = () => undefined;
   const handleContextMenu = (e: MouseEvent) => {
     e.preventDefault();
killedBy: Tooltip should show and hide tooltip on click
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] BlockStatement
components/atoms/tooltip/Tooltip.controller.ts:26:48
   const closeTooltip = () => setIsOpened(false);
   const openTooltip = () => setIsOpened(true);
   const toggleTooltip = () => setIsOpened(!isOpened);
-  const handleContextMenu = (e: MouseEvent) => {
-    e.preventDefault();
-    toggleTooltip();
-  };
+  const handleContextMenu = (e: MouseEvent) => {};
 
   useKeyPress({ keyCode: 'Escape', ref: tooltipRef, onKeyPress: closeTooltip });
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"
