[Survived] BooleanLiteral
components/atoms/tooltip/Tooltip.tsx:17:15
   className,
   containerTag = TooltipContainer.Span,
   visibleOn = 'hover',
-  autoClose = false,
+  autoClose = true,
   autoCloseDelay = 3000,
   color = SemanticColor.Default,

[Survived] ConditionalExpression
components/atoms/tooltip/Tooltip.tsx:38:32
   const tooltipClass = getClassName([
     'cl-tooltip',
     className,
-    { [`cl-tooltip_${color}`]: color !== SemanticColor.Default },
+    { [`cl-tooltip_${color}`]: false },
   ]);
 

[Survived] EqualityOperator
components/atoms/tooltip/Tooltip.tsx:38:32
   const tooltipClass = getClassName([
     'cl-tooltip',
     className,
-    { [`cl-tooltip_${color}`]: color !== SemanticColor.Default },
+    { [`cl-tooltip_${color}`]: color === SemanticColor.Default },
   ]);
 

[Killed] EqualityOperator
components/atoms/tooltip/Tooltip.tsx:44:16
   return (
     <ContainerComponent
       style={{ position: 'relative', cursor: 'pointer' }}
-      onClick={visibleOn === 'click' ? toggleTooltip : undefined}
+      onClick={visibleOn !== 'click' ? toggleTooltip : undefined}
       onMouseOver={visibleOn === 'hover' ? openTooltip : undefined}
       onMouseLeave={visibleOn === 'hover' ? closeTooltip : undefined}
killedBy: Tooltip should show and hide tooltip on click
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ConditionalExpression
components/atoms/tooltip/Tooltip.tsx:44:16
   return (
     <ContainerComponent
       style={{ position: 'relative', cursor: 'pointer' }}
-      onClick={visibleOn === 'click' ? toggleTooltip : undefined}
+      onClick={false ? toggleTooltip : undefined}
       onMouseOver={visibleOn === 'hover' ? openTooltip : undefined}
       onMouseLeave={visibleOn === 'hover' ? closeTooltip : undefined}
killedBy: Tooltip should show and hide tooltip on click
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] EqualityOperator
components/atoms/tooltip/Tooltip.tsx:45:20
     <ContainerComponent
       style={{ position: 'relative', cursor: 'pointer' }}
       onClick={visibleOn === 'click' ? toggleTooltip : undefined}
-      onMouseOver={visibleOn === 'hover' ? openTooltip : undefined}
+      onMouseOver={visibleOn !== 'hover' ? openTooltip : undefined}
       onMouseLeave={visibleOn === 'hover' ? closeTooltip : undefined}
       onFocus={visibleOn === 'focus' ? openTooltip : undefined}
killedBy: Tooltip should show and hide tooltip on hover
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ConditionalExpression
components/atoms/tooltip/Tooltip.tsx:45:20
     <ContainerComponent
       style={{ position: 'relative', cursor: 'pointer' }}
       onClick={visibleOn === 'click' ? toggleTooltip : undefined}
-      onMouseOver={visibleOn === 'hover' ? openTooltip : undefined}
+      onMouseOver={false ? openTooltip : undefined}
       onMouseLeave={visibleOn === 'hover' ? closeTooltip : undefined}
       onFocus={visibleOn === 'focus' ? openTooltip : undefined}
killedBy: Tooltip should show and hide tooltip on hover
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ConditionalExpression
components/atoms/tooltip/Tooltip.tsx:46:21
       style={{ position: 'relative', cursor: 'pointer' }}
       onClick={visibleOn === 'click' ? toggleTooltip : undefined}
       onMouseOver={visibleOn === 'hover' ? openTooltip : undefined}
-      onMouseLeave={visibleOn === 'hover' ? closeTooltip : undefined}
+      onMouseLeave={false ? closeTooltip : undefined}
       onFocus={visibleOn === 'focus' ? openTooltip : undefined}
       onBlur={visibleOn === 'focus' ? closeTooltip : undefined}
killedBy: Tooltip should show and hide tooltip on hover
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] EqualityOperator
components/atoms/tooltip/Tooltip.tsx:46:21
       style={{ position: 'relative', cursor: 'pointer' }}
       onClick={visibleOn === 'click' ? toggleTooltip : undefined}
       onMouseOver={visibleOn === 'hover' ? openTooltip : undefined}
-      onMouseLeave={visibleOn === 'hover' ? closeTooltip : undefined}
+      onMouseLeave={visibleOn !== 'hover' ? closeTooltip : undefined}
       onFocus={visibleOn === 'focus' ? openTooltip : undefined}
       onBlur={visibleOn === 'focus' ? closeTooltip : undefined}
killedBy: Tooltip should show and hide tooltip on hover
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] EqualityOperator
components/atoms/tooltip/Tooltip.tsx:47:16
       onClick={visibleOn === 'click' ? toggleTooltip : undefined}
       onMouseOver={visibleOn === 'hover' ? openTooltip : undefined}
       onMouseLeave={visibleOn === 'hover' ? closeTooltip : undefined}
-      onFocus={visibleOn === 'focus' ? openTooltip : undefined}
+      onFocus={visibleOn !== 'focus' ? openTooltip : undefined}
       onBlur={visibleOn === 'focus' ? closeTooltip : undefined}
       onContextMenu={
killedBy: Tooltip should show and hide tooltip on click
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ConditionalExpression
components/atoms/tooltip/Tooltip.tsx:47:16
       onClick={visibleOn === 'click' ? toggleTooltip : undefined}
       onMouseOver={visibleOn === 'hover' ? openTooltip : undefined}
       onMouseLeave={visibleOn === 'hover' ? closeTooltip : undefined}
-      onFocus={visibleOn === 'focus' ? openTooltip : undefined}
+      onFocus={false ? openTooltip : undefined}
       onBlur={visibleOn === 'focus' ? closeTooltip : undefined}
       onContextMenu={
killedBy: Tooltip should show and hide tooltip on focus
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ConditionalExpression
components/atoms/tooltip/Tooltip.tsx:48:15
       onMouseOver={visibleOn === 'hover' ? openTooltip : undefined}
       onMouseLeave={visibleOn === 'hover' ? closeTooltip : undefined}
       onFocus={visibleOn === 'focus' ? openTooltip : undefined}
-      onBlur={visibleOn === 'focus' ? closeTooltip : undefined}
+      onBlur={false ? closeTooltip : undefined}
       onContextMenu={
         visibleOn === 'contextmenu' ? (e: MouseEvent) => handleContextMenu(e) : undefined
killedBy: Tooltip should show and hide tooltip on focus
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] EqualityOperator
components/atoms/tooltip/Tooltip.tsx:48:15
       onMouseOver={visibleOn === 'hover' ? openTooltip : undefined}
       onMouseLeave={visibleOn === 'hover' ? closeTooltip : undefined}
       onFocus={visibleOn === 'focus' ? openTooltip : undefined}
-      onBlur={visibleOn === 'focus' ? closeTooltip : undefined}
+      onBlur={visibleOn !== 'focus' ? closeTooltip : undefined}
       onContextMenu={
         visibleOn === 'contextmenu' ? (e: MouseEvent) => handleContextMenu(e) : undefined
killedBy: Tooltip should show and hide tooltip on focus
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] EqualityOperator
components/atoms/tooltip/Tooltip.tsx:50:9
       onFocus={visibleOn === 'focus' ? openTooltip : undefined}
       onBlur={visibleOn === 'focus' ? closeTooltip : undefined}
       onContextMenu={
-        visibleOn === 'contextmenu' ? (e: MouseEvent) => handleContextMenu(e) : undefined
+        visibleOn !== 'contextmenu' ? (e: MouseEvent) => handleContextMenu(e) : undefined
       }
       tabIndex={-1}
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ConditionalExpression
components/atoms/tooltip/Tooltip.tsx:50:9
       onFocus={visibleOn === 'focus' ? openTooltip : undefined}
       onBlur={visibleOn === 'focus' ? closeTooltip : undefined}
       onContextMenu={
-        visibleOn === 'contextmenu' ? (e: MouseEvent) => handleContextMenu(e) : undefined
+        false ? (e: MouseEvent) => handleContextMenu(e) : undefined
       }
       tabIndex={-1}
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Survived] UnaryOperator
components/atoms/tooltip/Tooltip.tsx:52:17
       onContextMenu={
         visibleOn === 'contextmenu' ? (e: MouseEvent) => handleContextMenu(e) : undefined
       }
-      tabIndex={-1}
+      tabIndex={+1}
       ref={wrapperRef}
       aria-describedby={elementId}

[Killed] ConditionalExpression
components/atoms/tooltip/Tooltip.tsx:57:8
       aria-describedby={elementId}
     >
       {children}
-      {isOpened && (
-        <Portal>
-          <div
-            style={{ ...style, top, left }}
-            ref={tooltipRef}
-            role="tooltip"
-            id={elementId}
-            {...rest}
-            className={tooltipClass}
-          >
-            {tooltipContent}
-          </div>
-        </Portal>
-      )}
+      {true}
     </ContainerComponent>
   );
killedBy: Tooltip should show and hide tooltip on hover
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"

[Killed] ConditionalExpression
components/atoms/tooltip/Tooltip.tsx:57:8
       aria-describedby={elementId}
     >
       {children}
-      {isOpened && (
-        <Portal>
-          <div
-            style={{ ...style, top, left }}
-            ref={tooltipRef}
-            role="tooltip"
-            id={elementId}
-            {...rest}
-            className={tooltipClass}
-          >
-            {tooltipContent}
-          </div>
-        </Portal>
-      )}
+      {false}
     </ContainerComponent>
   );
killedBy: Tooltip should show and hide tooltip on hover
statusReason: Unable to find an element with the text: Tooltip content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      aria-describedby="test-tooltip-id"
      style="position: relative; cursor: pointer;"
