[Killed] BlockStatement
components/contexts/theme/ThemeProvider.tsx:13:7
 export const ThemeProvider: FC<{ children: ReactNode; injectedMode?: ThemeMode }> = ({
   children,
   injectedMode,
-}) => {
-  const [mode, setMode] = useState<ThemeMode>(CL_LIGHT_THEME_CLASS);
-
-  useEffect(() => {
-    if (mode && typeof mode === 'string') {
-      document.body.classList.remove(CL_LIGHT_THEME_CLASS, CL_DARK_THEME_CLASS);
-      document.body.classList.add(mode);
-    }
-  }, [mode]);
-
-  useEffect(() => {
-    if (injectedMode && typeof injectedMode === 'string') {
-      document.body.classList.remove(CL_LIGHT_THEME_CLASS, CL_DARK_THEME_CLASS);
-      document.body.classList.add(injectedMode);
-    }
-  }, [injectedMode]);
-
-  const providerValue = useMemo(() => ({ mode, setMode }), [mode]);
-
-  return <ThemeContext.Provider value={providerValue}>{children}</ThemeContext.Provider>;
-};
+}) => {};
 
killedBy: useTheme should return the current theme mode
statusReason: Unable to find an element by: [data-testid="current-mode"]

Ignored nodes: comments, script, style
<body
  class=""
>
  <div />
</body>

[Killed] BlockStatement
components/contexts/theme/ThemeProvider.tsx:16:19
 }) => {
   const [mode, setMode] = useState<ThemeMode>(CL_LIGHT_THEME_CLASS);
 
-  useEffect(() => {
-    if (mode && typeof mode === 'string') {
-      document.body.classList.remove(CL_LIGHT_THEME_CLASS, CL_DARK_THEME_CLASS);
-      document.body.classList.add(mode);
-    }
-  }, [mode]);
+  useEffect(() => {}, [mode]);
 
   useEffect(() => {
killedBy: ThemeProvider applies default light theme on mount
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/contexts/theme/ThemeProvider.tsx:17:9
   const [mode, setMode] = useState<ThemeMode>(CL_LIGHT_THEME_CLASS);
 
   useEffect(() => {
-    if (mode && typeof mode === 'string') {
+    if (false) {
       document.body.classList.remove(CL_LIGHT_THEME_CLASS, CL_DARK_THEME_CLASS);
       document.body.classList.add(mode);
killedBy: ThemeProvider applies default light theme on mount
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
components/contexts/theme/ThemeProvider.tsx:17:17
   const [mode, setMode] = useState<ThemeMode>(CL_LIGHT_THEME_CLASS);
 
   useEffect(() => {
-    if (mode && typeof mode === 'string') {
+    if (mode && typeof mode !== 'string') {
       document.body.classList.remove(CL_LIGHT_THEME_CLASS, CL_DARK_THEME_CLASS);
       document.body.classList.add(mode);
killedBy: ThemeProvider applies default light theme on mount
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
components/contexts/theme/ThemeProvider.tsx:21:6
       document.body.classList.remove(CL_LIGHT_THEME_CLASS, CL_DARK_THEME_CLASS);
       document.body.classList.add(mode);
     }
-  }, [mode]);
+  }, []);
 
   useEffect(() => {
killedBy: ThemeProvider switches theme when setMode is called
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
components/contexts/theme/ThemeProvider.tsx:23:19
     }
   }, [mode]);
 
-  useEffect(() => {
-    if (injectedMode && typeof injectedMode === 'string') {
-      document.body.classList.remove(CL_LIGHT_THEME_CLASS, CL_DARK_THEME_CLASS);
-      document.body.classList.add(injectedMode);
-    }
-  }, [injectedMode]);
+  useEffect(() => {}, [injectedMode]);
 
   const providerValue = useMemo(() => ({ mode, setMode }), [mode]);
killedBy: ThemeProvider applies injectedMode when provided
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
components/contexts/theme/ThemeProvider.tsx:24:25
   }, [mode]);
 
   useEffect(() => {
-    if (injectedMode && typeof injectedMode === 'string') {
+    if (injectedMode && typeof injectedMode !== 'string') {
       document.body.classList.remove(CL_LIGHT_THEME_CLASS, CL_DARK_THEME_CLASS);
       document.body.classList.add(injectedMode);
killedBy: ThemeProvider applies injectedMode when provided
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
components/contexts/theme/ThemeProvider.tsx:24:59
   }, [mode]);
 
   useEffect(() => {
-    if (injectedMode && typeof injectedMode === 'string') {
-      document.body.classList.remove(CL_LIGHT_THEME_CLASS, CL_DARK_THEME_CLASS);
-      document.body.classList.add(injectedMode);
-    }
+    if (injectedMode && typeof injectedMode === 'string') {}
   }, [injectedMode]);
 
killedBy: ThemeProvider applies injectedMode when provided
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
components/contexts/theme/ThemeProvider.tsx:28:6
       document.body.classList.remove(CL_LIGHT_THEME_CLASS, CL_DARK_THEME_CLASS);
       document.body.classList.add(injectedMode);
     }
-  }, [injectedMode]);
+  }, []);
 
   const providerValue = useMemo(() => ({ mode, setMode }), [mode]);
killedBy: ThemeProvider updates body class when injectedMode changes
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
components/contexts/theme/ThemeProvider.tsx:30:33
     }
   }, [injectedMode]);
 
-  const providerValue = useMemo(() => ({ mode, setMode }), [mode]);
+  const providerValue = useMemo(() => undefined, [mode]);
 
   return <ThemeContext.Provider value={providerValue}>{children}</ThemeContext.Provider>;
killedBy: ThemeProvider applies default light theme on mount
statusReason: Cannot destructure property 'mode' of '(0 , __vite_ssr_import_3__.useContext)(...)' as it is undefined.
