[Killed] BlockStatement
components/molecules/accordion/Accordion.tsx:7:65
 import './Accordion.css';
 import { AccordionItem } from './AccordionItem';
 
-const Accordion: FC<AccordionProps> = ({ items, className }) => {
-  const accordionClass = getClassName(['cl-accordion', className]);
-
-  return (
-    <div className={accordionClass}>
-      {items.map((item: AccordionItemProps) => (
-        <AccordionItem key={item.summary} {...item} />
-      ))}
-    </div>
-  );
-};
+const Accordion: FC<AccordionProps> = ({ items, className }) => {};
 
 export default Accordion;
killedBy: Accordion renders correctly with default props
statusReason: Snapshot `Accordion > renders correctly with default props 1` mismatched

[Killed] ArrayDeclaration
components/molecules/accordion/Accordion.tsx:8:39
 import { AccordionItem } from './AccordionItem';
 
 const Accordion: FC<AccordionProps> = ({ items, className }) => {
-  const accordionClass = getClassName(['cl-accordion', className]);
+  const accordionClass = getClassName([]);
 
   return (
killedBy: Accordion renders correctly with default props
statusReason: Snapshot `Accordion > renders correctly with default props 1` mismatched

[Killed] ArrowFunction
components/molecules/accordion/Accordion.tsx:12:18
 
   return (
     <div className={accordionClass}>
-      {items.map((item: AccordionItemProps) => (
-        <AccordionItem key={item.summary} {...item} />
-      ))}
+      {items.map(() => undefined)}
     </div>
   );
killedBy: Accordion renders correctly with default props
statusReason: Snapshot `Accordion > renders correctly with default props 1` mismatched
