[Killed] BlockStatement
components/molecules/alert/Alert.helpers.tsx:3:72
 import { AlertMode, IconName } from '@enums';
 
-export function getAlertTitle(mode: AlertMode, title?: string): string {
-  if (title) return title;
-
-  switch (mode) {
-    case AlertMode.Info:
-      return 'For your information';
-    case AlertMode.Warning:
-      return 'Please pay attention';
-    case AlertMode.Error:
-      return 'Something went wrong';
-    case AlertMode.Success:
-      return 'Everything is okay';
-    case AlertMode.Help:
-      return 'Useful tip';
-    default:
-      return 'Alert';
-  }
-}
+export function getAlertTitle(mode: AlertMode, title?: string): string {}
 
 export function getAlertIcon(mode: AlertMode, icon?: IconName): IconName | undefined {
killedBy: Alert should render the alert when opened
statusReason: Unable to find an element with the text: For your information. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <div
      class="cl-alert cl-alert_info"

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:4:7
 import { AlertMode, IconName } from '@enums';
 
 export function getAlertTitle(mode: AlertMode, title?: string): string {
-  if (title) return title;
+  if (true) return title;
 
   switch (mode) {
killedBy: Alert should render the alert when opened
statusReason: Unable to find an element with the text: For your information. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <div
      class="cl-alert cl-alert_info"

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:4:7
 import { AlertMode, IconName } from '@enums';
 
 export function getAlertTitle(mode: AlertMode, title?: string): string {
-  if (title) return title;
+  if (false) return title;
 
   switch (mode) {
killedBy: Alert.helpers getAlertTitle returns the provided title if given
statusReason: expected 'For your information' to be 'Custom Title' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:7:5
   if (title) return title;
 
   switch (mode) {
-    case AlertMode.Info:
-      return 'For your information';
+    case AlertMode.Info:
     case AlertMode.Warning:
       return 'Please pay attention';
killedBy: Alert.helpers getAlertTitle returns default title based on mode
statusReason: expected 'Please pay attention' to be 'For your information' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:9:5
   switch (mode) {
     case AlertMode.Info:
       return 'For your information';
-    case AlertMode.Warning:
-      return 'Please pay attention';
+    case AlertMode.Warning:
     case AlertMode.Error:
       return 'Something went wrong';
killedBy: Alert.helpers getAlertTitle returns default title based on mode
statusReason: expected 'Something went wrong' to be 'Please pay attention' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:11:5
       return 'For your information';
     case AlertMode.Warning:
       return 'Please pay attention';
-    case AlertMode.Error:
-      return 'Something went wrong';
+    case AlertMode.Error:
     case AlertMode.Success:
       return 'Everything is okay';
killedBy: Alert.helpers getAlertTitle returns default title based on mode
statusReason: expected 'Everything is okay' to be 'Something went wrong' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:13:5
       return 'Please pay attention';
     case AlertMode.Error:
       return 'Something went wrong';
-    case AlertMode.Success:
-      return 'Everything is okay';
+    case AlertMode.Success:
     case AlertMode.Help:
       return 'Useful tip';
killedBy: Alert.helpers getAlertTitle returns default title based on mode
statusReason: expected 'Useful tip' to be 'Everything is okay' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:15:5
       return 'Something went wrong';
     case AlertMode.Success:
       return 'Everything is okay';
-    case AlertMode.Help:
-      return 'Useful tip';
+    case AlertMode.Help:
     default:
       return 'Alert';
killedBy: Alert.helpers getAlertTitle returns default title based on mode
statusReason: expected 'Alert' to be 'Useful tip' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:17:5
       return 'Everything is okay';
     case AlertMode.Help:
       return 'Useful tip';
-    default:
-      return 'Alert';
+    default:
   }
 }
killedBy: Alert.helpers getAlertTitle returns generic title for unknown mode
statusReason: expected undefined to be 'Alert' // Object.is equality

[Killed] BlockStatement
components/molecules/alert/Alert.helpers.tsx:22:86
   }
 }
 
-export function getAlertIcon(mode: AlertMode, icon?: IconName): IconName | undefined {
-  if (icon) {
-    return icon;
-  }
-
-  switch (mode) {
-    case AlertMode.Info:
-      return IconName.Info;
-    case AlertMode.Warning:
-      return IconName.AlertTriangle;
-    case AlertMode.Error:
-      return IconName.XOctagon;
-    case AlertMode.Success:
-      return IconName.CheckCircle;
-    case AlertMode.Help:
-      return IconName.LifeBuoy;
-    default:
-      return;
-  }
-}
+export function getAlertIcon(mode: AlertMode, icon?: IconName): IconName | undefined {}
 
killedBy: Alert.helpers getAlertIcon returns the provided icon if given
statusReason: expected undefined to be 'chop-icon__save' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:23:7
 }
 
 export function getAlertIcon(mode: AlertMode, icon?: IconName): IconName | undefined {
-  if (icon) {
+  if (false) {
     return icon;
   }
killedBy: Alert.helpers getAlertIcon returns the provided icon if given
statusReason: expected 'chop-icon__info' to be 'chop-icon__save' // Object.is equality

[Killed] BlockStatement
components/molecules/alert/Alert.helpers.tsx:23:13
 }
 
 export function getAlertIcon(mode: AlertMode, icon?: IconName): IconName | undefined {
-  if (icon) {
-    return icon;
-  }
+  if (icon) {}
 
   switch (mode) {
killedBy: Alert.helpers getAlertIcon returns the provided icon if given
statusReason: expected 'chop-icon__info' to be 'chop-icon__save' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:28:5
   }
 
   switch (mode) {
-    case AlertMode.Info:
-      return IconName.Info;
+    case AlertMode.Info:
     case AlertMode.Warning:
       return IconName.AlertTriangle;
killedBy: Alert.helpers getAlertIcon returns default icon based on mode
statusReason: expected 'chop-icon__alert-triangle' to be 'chop-icon__info' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:30:5
   switch (mode) {
     case AlertMode.Info:
       return IconName.Info;
-    case AlertMode.Warning:
-      return IconName.AlertTriangle;
+    case AlertMode.Warning:
     case AlertMode.Error:
       return IconName.XOctagon;
killedBy: Alert.helpers getAlertIcon returns default icon based on mode
statusReason: expected 'chop-icon__x-octagon' to be 'chop-icon__alert-triangle' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:32:5
       return IconName.Info;
     case AlertMode.Warning:
       return IconName.AlertTriangle;
-    case AlertMode.Error:
-      return IconName.XOctagon;
+    case AlertMode.Error:
     case AlertMode.Success:
       return IconName.CheckCircle;
killedBy: Alert.helpers getAlertIcon returns default icon based on mode
statusReason: expected 'chop-icon__check-circle' to be 'chop-icon__x-octagon' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:34:5
       return IconName.AlertTriangle;
     case AlertMode.Error:
       return IconName.XOctagon;
-    case AlertMode.Success:
-      return IconName.CheckCircle;
+    case AlertMode.Success:
     case AlertMode.Help:
       return IconName.LifeBuoy;
killedBy: Alert.helpers getAlertIcon returns default icon based on mode
statusReason: expected 'chop-icon__life-buoy' to be 'chop-icon__check-circle' // Object.is equality

[Killed] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:36:5
       return IconName.XOctagon;
     case AlertMode.Success:
       return IconName.CheckCircle;
-    case AlertMode.Help:
-      return IconName.LifeBuoy;
+    case AlertMode.Help:
     default:
       return;
killedBy: Alert.helpers getAlertIcon returns default icon based on mode
statusReason: expected undefined to be 'chop-icon__life-buoy' // Object.is equality

[Survived] ConditionalExpression
components/molecules/alert/Alert.helpers.tsx:38:5
       return IconName.CheckCircle;
     case AlertMode.Help:
       return IconName.LifeBuoy;
-    default:
-      return;
+    default:
   }
 }
