[Killed] BooleanLiteral
components/molecules/alert/Alert.tsx:19:15
   message,
   mode = AlertMode.Info,
   icon,
-  autoClose = false,
+  autoClose = true,
   autoCloseDelay = 3000,
   ...rest
killedBy: Alert should call onClose when the close button is clicked
statusReason: Unable to find an accessible element with the role "button" and name `/close/i`

Here are the accessible roles:

  banner:

  Name "":
  <header />

[Survived] ConditionalExpression
components/molecules/alert/Alert.tsx:24:21
   ...rest
 }) => {
   const isMounted = useIsMounted(isOpened);
-  const isClosing = isMounted && !isOpened;
+  const isClosing = true;
   const containerRef = useRef<HTMLDivElement>(null);
   const isHovered = useIsHovered(containerRef, isMounted);

[Survived] ConditionalExpression
components/molecules/alert/Alert.tsx:24:21
   ...rest
 }) => {
   const isMounted = useIsMounted(isOpened);
-  const isClosing = isMounted && !isOpened;
+  const isClosing = false;
   const containerRef = useRef<HTMLDivElement>(null);
   const isHovered = useIsHovered(containerRef, isMounted);

[Killed] BooleanLiteral
components/molecules/alert/Alert.tsx:27:32
   const isClosing = isMounted && !isOpened;
   const containerRef = useRef<HTMLDivElement>(null);
   const isHovered = useIsHovered(containerRef, isMounted);
-  const isCloseButtonVisible = !autoClose;
+  const isCloseButtonVisible = autoClose;
 
   const remainingPercentage = useRemainingTimer({
killedBy: Alert should call onClose when the close button is clicked
statusReason: Unable to find an accessible element with the role "button" and name `/close/i`

Here are the accessible roles:

  banner:

  Name "":
  <header />

[Killed] ConditionalExpression
components/molecules/alert/Alert.tsx:37:7
     autoClose,
   });
 
-  if (!isMounted) return null;
+  if (true) return null;
 
   const alertTitle = getAlertTitle(mode, title);
killedBy: Alert should render the alert when opened
statusReason: Unable to find an element with the text: This is a test message.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
components/molecules/alert/Alert.tsx:37:7
     autoClose,
   });
 
-  if (!isMounted) return null;
+  if (isMounted) return null;
 
   const alertTitle = getAlertTitle(mode, title);
killedBy: Alert should render nothing when not opened
statusReason: expected <p class="cl-alert__message"></p> to be null

[Survived] ArrayDeclaration
components/molecules/alert/Alert.tsx:41:39
 
   const alertTitle = getAlertTitle(mode, title);
   const alertTitleIcon = getAlertIcon(mode, icon);
-  const alertClassName = getClassName([
-    'cl-alert',
-    `cl-alert_${mode.toLowerCase()}`,
-    { 'cl-alert_closing': isClosing },
-  ]);
+  const alertClassName = getClassName([]);
 
   return (

[Survived] MethodExpression
components/molecules/alert/Alert.tsx:43:17
   const alertTitleIcon = getAlertIcon(mode, icon);
   const alertClassName = getClassName([
     'cl-alert',
-    `cl-alert_${mode.toLowerCase()}`,
+    `cl-alert_${mode.toUpperCase()}`,
     { 'cl-alert_closing': isClosing },
   ]);

[Killed] ConditionalExpression
components/molecules/alert/Alert.tsx:51:12
     <Portal>
       <div ref={containerRef} className={alertClassName}>
         <div {...rest} className="cl-alert__content">
-          {isCloseButtonVisible && (
-            <Button
-              icon={IconName.X}
-              view={ButtonView.Icon}
-              iconSize={ElementSize.Medium}
-              label="Close alert"
-              onClick={onClose}
-              className="cl-alert__button"
-            />
-          )}
+          {true}
           <header>
             <Header icon={alertTitleIcon} as="h3" className="cl-alert__header">
killedBy: Alert should call onClose when the close button is clicked
statusReason: Unable to find an accessible element with the role "button" and name `/close/i`

Here are the accessible roles:

  banner:

  Name "":
  <header />

[Killed] LogicalOperator
components/molecules/alert/Alert.tsx:51:12
     <Portal>
       <div ref={containerRef} className={alertClassName}>
         <div {...rest} className="cl-alert__content">
-          {isCloseButtonVisible && (
-            <Button
-              icon={IconName.X}
-              view={ButtonView.Icon}
-              iconSize={ElementSize.Medium}
-              label="Close alert"
-              onClick={onClose}
-              className="cl-alert__button"
-            />
-          )}
+          {isCloseButtonVisible || <Button icon={IconName.X} view={ButtonView.Icon} iconSize={ElementSize.Medium} label="Close alert" onClick={onClose} className="cl-alert__button" />}
           <header>
             <Header icon={alertTitleIcon} as="h3" className="cl-alert__header">
killedBy: Alert should call onClose when the close button is clicked
statusReason: Unable to find an accessible element with the role "button" and name `/close/i`

Here are the accessible roles:

  banner:

  Name "":
  <header />

[Killed] ConditionalExpression
components/molecules/alert/Alert.tsx:67:12
             </Header>
           </header>
           <p className="cl-alert__message">{message}</p>
-          {autoClose && <AlertProgressBar remainingPercentage={remainingPercentage} />}
+          {true}
         </div>
       </div>
killedBy: Alert should render progress bar when autoClose is true
statusReason: Unable to find an accessible element with the role "progressbar"

Here are the accessible roles:

  banner:

  Name "":
  <header />

[Killed] ConditionalExpression
components/molecules/alert/Alert.tsx:67:12
             </Header>
           </header>
           <p className="cl-alert__message">{message}</p>
-          {autoClose && <AlertProgressBar remainingPercentage={remainingPercentage} />}
+          {false}
         </div>
       </div>
killedBy: Alert should render progress bar when autoClose is true
statusReason: Unable to find an accessible element with the role "progressbar"

Here are the accessible roles:

  banner:

  Name "":
  <header />
