[Killed] BlockStatement
components/molecules/alert/AlertProgressBar.tsx:3:99
 import type { FC } from 'react';
 
-export const AlertProgressBar: FC<{ remainingPercentage: number }> = ({ remainingPercentage }) => {
-  return (
-    <progress
-      className="cl-alert__progress-bar"
-      value={remainingPercentage}
-      max={100}
-      style={{ width: '100%' }}
-    />
-  );
-};
+export const AlertProgressBar: FC<{ remainingPercentage: number }> = ({ remainingPercentage }) => {};
 
killedBy: Alert should render progress bar when autoClose is true
statusReason: Unable to find an accessible element with the role "progressbar"

Here are the accessible roles:

  banner:

  Name "":
  <header />
