[Killed] ConditionalExpression
components/molecules/breadcrumbs/BreadcrumbItem.tsx:10:18
   item: Breadcrumb;
   isLastItem: boolean;
 }> = ({ item, isLastItem }) => {
-  const isLink = !!item.link && !isLastItem;
+  const isLink = true;
 
   return (
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] BooleanLiteral
components/molecules/breadcrumbs/BreadcrumbItem.tsx:10:18
   item: Breadcrumb;
   isLastItem: boolean;
 }> = ({ item, isLastItem }) => {
-  const isLink = !!item.link && !isLastItem;
+  const isLink = !item.link && !isLastItem;
 
   return (
killedBy: BreadcrumbItem should render as a link when item has link and is not the last item
statusReason: Unable to find an accessible element with the role "link"

Here are the accessible roles:

  listitem:

  Name "":
  <li

[Killed] LogicalOperator
components/molecules/breadcrumbs/BreadcrumbItem.tsx:17:19
       <li className="cl-breadcrumbs__item">
         {isLink ? (
           <Link
-            href={item?.link ?? ''}
+            href={item?.link && ''}
             icon={item.icon}
             iconPosition="left"
killedBy: BreadcrumbItem should render as a link when item has link and is not the last item
statusReason: Unable to find an accessible element with the role "link"

Here are the accessible roles:

  listitem:

  Name "":
  <li

[Survived] OptionalChaining
components/molecules/breadcrumbs/BreadcrumbItem.tsx:17:19
       <li className="cl-breadcrumbs__item">
         {isLink ? (
           <Link
-            href={item?.link ?? ''}
+            href={item.link ?? ''}
             icon={item.icon}
             iconPosition="left"

[Killed] LogicalOperator
components/molecules/breadcrumbs/BreadcrumbItem.tsx:26:14
           </Link>
         ) : (
           <span aria-current={isLastItem ? 'page' : undefined} className="cl-breadcrumbs__text">
-            {item.icon && <Icon name={item.icon} hidden />}
+            {item.icon || <Icon name={item.icon} hidden />}
             {item.label}
           </span>
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] ConditionalExpression
components/molecules/breadcrumbs/BreadcrumbItem.tsx:26:14
           </Link>
         ) : (
           <span aria-current={isLastItem ? 'page' : undefined} className="cl-breadcrumbs__text">
-            {item.icon && <Icon name={item.icon} hidden />}
+            {false}
             {item.label}
           </span>
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] ConditionalExpression
components/molecules/breadcrumbs/BreadcrumbItem.tsx:31:8
           </span>
         )}
       </li>
-      {!isLastItem && (
-        <Icon name={IconName.ChevronRight} size={ElementSize.Small} testId="breadcrumb-separator" />
-      )}
+      {true}
     </>
   );
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] ConditionalExpression
components/molecules/breadcrumbs/BreadcrumbItem.tsx:31:8
           </span>
         )}
       </li>
-      {!isLastItem && (
-        <Icon name={IconName.ChevronRight} size={ElementSize.Small} testId="breadcrumb-separator" />
-      )}
+      {false}
     </>
   );
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched
