[Killed] BlockStatement
components/molecules/breadcrumbs/Breadcrumbs.tsx:16:7
   tabIndex,
   title,
   ...rest
-}) => {
-  const breadcrumbsClass = getClassName(['cl-breadcrumbs', className]);
-
-  if (!items || items.length === 0) {
-    return null;
-  }
-
-  return (
-    <nav
-      aria-label="Breadcrumb"
-      className={breadcrumbsClass}
-      id={id}
-      style={style}
-      tabIndex={tabIndex}
-      title={title}
-      {...rest}
-    >
-      <BreadcrumbList items={items} />
-    </nav>
-  );
-};
+}) => {};
 
 export default Breadcrumbs;
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] BooleanLiteral
components/molecules/breadcrumbs/Breadcrumbs.tsx:19:7
 }) => {
   const breadcrumbsClass = getClassName(['cl-breadcrumbs', className]);
 
-  if (!items || items.length === 0) {
+  if (items || items.length === 0) {
     return null;
   }
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] BlockStatement
components/molecules/breadcrumbs/Breadcrumbs.tsx:19:37
 }) => {
   const breadcrumbsClass = getClassName(['cl-breadcrumbs', className]);
 
-  if (!items || items.length === 0) {
-    return null;
-  }
+  if (!items || items.length === 0) {}
 
   return (
killedBy: Breadcrumbs renders null when items array is empty
statusReason: expected <nav aria-label="Breadcrumb" …(1)>…(1)</nav> to be null
