[Killed] BlockStatement
components/molecules/checkbox/Checkbox.controller.ts:33:62
   onChangeFormInputRef.current = onChangeFormInput;
   initialValueRef.current = initialValue;
 
-  const handleChange = (e: ChangeEvent<HTMLInputElement>) => {
-    const checked = e.target.checked;
-    setIsChecked(checked);
-    onChange?.(e);
-    onChangeFormInput?.({ name, value: checked });
-  };
+  const handleChange = (e: ChangeEvent<HTMLInputElement>) => {};
 
   const handleReset = useCallback(() => {
killedBy: Form should accept custom values
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  id="_r_3_"
  name="accepted"
  type="checkbox"
/>

[Survived] ArrayDeclaration
components/molecules/checkbox/Checkbox.controller.ts:43:6
   const handleReset = useCallback(() => {
     setIsChecked(initialValueRef.current);
     onChangeFormInputRef.current?.({ name, value: initialValueRef.current });
-  }, [name]);
+  }, []);
 
   useResetFormInput(handleReset);
