[Killed] BooleanLiteral
components/molecules/checkbox/CheckboxStateful.tsx:16:14
   label,
   disabled,
   noLabel,
-  required = false,
+  required = true,
   iconPosition = 'left',
   defaultChecked,
killedBy: Checkbox should render the input correctly
statusReason: Snapshot `Checkbox > should render the input correctly 1` mismatched

[Killed] BooleanLiteral
components/molecules/checkbox/CheckboxStateful.tsx:31:31
     'cl-checkbox',
     className,
     {
-      'cl-checkbox_disabled': !!disabled,
+      'cl-checkbox_disabled': !disabled,
       'cl-checkbox_checked': checked,
     },
killedBy: Checkbox should render the input correctly
statusReason: Snapshot `Checkbox > should render the input correctly 1` mismatched
