[Survived] LogicalOperator
components/molecules/checkbox/CheckboxStateless.tsx:23:21
   style,
   tabIndex,
 }) => {
-  const elementId = id ?? `checkbox-${name}`;
+  const elementId = id && `checkbox-${name}`;
   const checkboxClass = getClassName([
     'cl-checkbox',

[Survived] BooleanLiteral
components/molecules/checkbox/CheckboxStateless.tsx:29:30
     className,
     {
       'cl-checkbox_disabled': !!disabled,
-      'cl-checkbox_checked': !!checked,
+      'cl-checkbox_checked': !checked,
     },
   ]);

[Killed] LogicalOperator
components/molecules/checkbox/CheckboxStateless.tsx:41:18
         type="checkbox"
         disabled={disabled}
         required={required}
-        checked={checked ?? false}
+        checked={checked && false}
         onChange={onChange}
         aria-label={noLabel ? label : undefined}
killedBy: Checkbox Stateless mode should use stateless checked prop when stateless is true
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  id="test-checkbox-id"
  name="checkbox"
  type="checkbox"
/>

[Killed] BooleanLiteral
components/molecules/checkbox/CheckboxStateless.tsx:41:29
         type="checkbox"
         disabled={disabled}
         required={required}
-        checked={checked ?? false}
+        checked={checked ?? true}
         onChange={onChange}
         aria-label={noLabel ? label : undefined}
killedBy: Checkbox Stateless mode should render correctly with stateless mode and no checked prop
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  id="test-checkbox-id"
  name="checkbox"
  type="checkbox"
