[Killed] ArrowFunction
components/molecules/multi-select/MultiSelect.Combobox.tsx:32:38
   required,
   values,
 }) => {
-  const selectedIds = values?.filter((value) => value.selected).map((value) => value.id);
+  const selectedIds = values?.filter(() => undefined).map((value) => value.id);
   const iconClass = getClassName([
     'cl-select-combobox__icon',
killedBy: MultiSelect should allow the user to select an option
statusReason: expect(element).toHaveValue(583e8b60-0177-4e38-a423-4b1d5d0a2236)

Expected the element to have value:
  583e8b60-0177-4e38-a423-4b1d5d0a2236
Received:

[Killed] MethodExpression
components/molecules/multi-select/MultiSelect.Combobox.tsx:32:23
   required,
   values,
 }) => {
-  const selectedIds = values?.filter((value) => value.selected).map((value) => value.id);
+  const selectedIds = values.map((value) => value.id);
   const iconClass = getClassName([
     'cl-select-combobox__icon',
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched
