[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.Dropdown.tsx:22:7
   onClose,
   onSelect,
   dropdownId,
-}) => {
-  const dropdownClass = getClassName([
-    'cl-select-dropdown',
-    { 'cl-select-dropdown_opened': opened },
-  ]);
-
-  return (
-    <ul
-      role="listbox"
-      id={dropdownId}
-      tabIndex={-1}
-      onKeyDown={(e) => handleDropdownListKeyPress({ e, options, onClose })}
-      className={dropdownClass}
-    >
-      {options.map((item) => (
-        <MultiSelectOption key={item.id} value={item} onSelect={() => onSelect(item.id)} />
-      ))}
-    </ul>
-  );
-};
+}) => {};
 
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] UnaryOperator
components/molecules/multi-select/MultiSelect.Dropdown.tsx:32:17
     <ul
       role="listbox"
       id={dropdownId}
-      tabIndex={-1}
+      tabIndex={+1}
       onKeyDown={(e) => handleDropdownListKeyPress({ e, options, onClose })}
       className={dropdownClass}
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] ArrowFunction
components/molecules/multi-select/MultiSelect.Dropdown.tsx:33:18
       role="listbox"
       id={dropdownId}
       tabIndex={-1}
-      onKeyDown={(e) => handleDropdownListKeyPress({ e, options, onClose })}
+      onKeyDown={() => undefined}
       className={dropdownClass}
     >
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="57b5a856-bc4b-4c2f-8295-9f44434fafc7"
  role="option"

[Killed] ArrowFunction
components/molecules/multi-select/MultiSelect.Dropdown.tsx:36:20
       onKeyDown={(e) => handleDropdownListKeyPress({ e, options, onClose })}
       className={dropdownClass}
     >
-      {options.map((item) => (
-        <MultiSelectOption key={item.id} value={item} onSelect={() => onSelect(item.id)} />
-      ))}
+      {options.map(() => undefined)}
     </ul>
   );
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] ArrowFunction
components/molecules/multi-select/MultiSelect.Dropdown.tsx:37:65
       className={dropdownClass}
     >
       {options.map((item) => (
-        <MultiSelectOption key={item.id} value={item} onSelect={() => onSelect(item.id)} />
+        <MultiSelectOption key={item.id} value={item} onSelect={() => undefined} />
       ))}
     </ul>
killedBy: MultiSelect should call onSelectChange handler
statusReason: expected "vi.fn()" to be called once, but got 0 times
