[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:13:24
   options: SelectValue[];
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
-}): MultiSelectValue[] {
-  return options.map((option) => {
-    let selected = false;
-
-    if (initialValues?.[name] && Array.isArray(initialValues[name])) {
-      const selectedId = initialValues[name].find(
-        (item) => item === option.id || item?.id === option.id,
-      );
-      if (selectedId) selected = true;
-    }
-
-    if (!initialValues?.[name] && Array.isArray(defaultValue)) {
-      const selectedId = defaultValue.find((item) => item === option.id);
-      if (selectedId) selected = true;
-    }
-
-    return { ...option, selected };
-  });
-}
+}): MultiSelectValue[] {}
 
 export const getMultiSelectFormValues = (options: MultiSelectValue[]): string[] => {
killedBy: MultiSelect should render correctly
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:14:34
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
 }): MultiSelectValue[] {
-  return options.map((option) => {
-    let selected = false;
-
-    if (initialValues?.[name] && Array.isArray(initialValues[name])) {
-      const selectedId = initialValues[name].find(
-        (item) => item === option.id || item?.id === option.id,
-      );
-      if (selectedId) selected = true;
-    }
-
-    if (!initialValues?.[name] && Array.isArray(defaultValue)) {
-      const selectedId = defaultValue.find((item) => item === option.id);
-      if (selectedId) selected = true;
-    }
-
-    return { ...option, selected };
-  });
+  return options.map((option) => {});
 }
 
killedBy: MultiSelect should render correctly
statusReason: Cannot read properties of undefined (reading 'selected')

[Killed] BooleanLiteral
components/molecules/multi-select/MultiSelect.helpers.ts:15:20
   defaultValue?: string | number | readonly string[];
 }): MultiSelectValue[] {
   return options.map((option) => {
-    let selected = false;
+    let selected = true;
 
     if (initialValues?.[name] && Array.isArray(initialValues[name])) {
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] OptionalChaining
components/molecules/multi-select/MultiSelect.helpers.ts:17:9
   return options.map((option) => {
     let selected = false;
 
-    if (initialValues?.[name] && Array.isArray(initialValues[name])) {
+    if (initialValues[name] && Array.isArray(initialValues[name])) {
       const selectedId = initialValues[name].find(
         (item) => item === option.id || item?.id === option.id,
killedBy: MultiSelect should render correctly
statusReason: Cannot read properties of undefined (reading 'languages')

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:17:70
   return options.map((option) => {
     let selected = false;
 
-    if (initialValues?.[name] && Array.isArray(initialValues[name])) {
-      const selectedId = initialValues[name].find(
-        (item) => item === option.id || item?.id === option.id,
-      );
-      if (selectedId) selected = true;
-    }
+    if (initialValues?.[name] && Array.isArray(initialValues[name])) {}
 
     if (!initialValues?.[name] && Array.isArray(defaultValue)) {
killedBy: MultiSelect should take an initial value from the form context
statusReason: expect(element).toHaveValue(b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91)

Expected the element to have value:
  b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91
Received:

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelect.helpers.ts:19:19
 
     if (initialValues?.[name] && Array.isArray(initialValues[name])) {
       const selectedId = initialValues[name].find(
-        (item) => item === option.id || item?.id === option.id,
+        (item) => false,
       );
       if (selectedId) selected = true;
killedBy: MultiSelect should take an initial value from the form context
statusReason: expect(element).toHaveValue(b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91)

Expected the element to have value:
  b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91
Received:

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelect.helpers.ts:19:19
 
     if (initialValues?.[name] && Array.isArray(initialValues[name])) {
       const selectedId = initialValues[name].find(
-        (item) => item === option.id || item?.id === option.id,
+        (item) => false || item?.id === option.id,
       );
       if (selectedId) selected = true;
killedBy: getMultiSelectSelectValues should return MultiSelectValue[] with selected true for options in initialValues
statusReason: expected [ { id: '1', …(2) }, …(2) ] to deeply equal [ { id: '1', …(2) }, …(2) ]

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelect.helpers.ts:21:11
       const selectedId = initialValues[name].find(
         (item) => item === option.id || item?.id === option.id,
       );
-      if (selectedId) selected = true;
+      if (true) selected = true;
     }
 
killedBy: MultiSelect should take an initial value from the form context
statusReason: expect(element).toHaveValue(b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91)

Expected the element to have value:
  b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91
Received:
  57b5a856-bc4b-4c2f-8295-9f44434fafc7,583e8b60-0177-4e38-a423-4b1d5d0a2236,b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91

[Killed] BooleanLiteral
components/molecules/multi-select/MultiSelect.helpers.ts:21:34
       const selectedId = initialValues[name].find(
         (item) => item === option.id || item?.id === option.id,
       );
-      if (selectedId) selected = true;
+      if (selectedId) selected = false;
     }
 
killedBy: MultiSelect should take an initial value from the form context
statusReason: expect(element).toHaveValue(b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91)

Expected the element to have value:
  b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91
Received:

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:24:64
       if (selectedId) selected = true;
     }
 
-    if (!initialValues?.[name] && Array.isArray(defaultValue)) {
-      const selectedId = defaultValue.find((item) => item === option.id);
-      if (selectedId) selected = true;
-    }
+    if (!initialValues?.[name] && Array.isArray(defaultValue)) {}
 
     return { ...option, selected };
killedBy: getMultiSelectSelectValues should return MultiSelectValue[] with selected true for options in defaultValue if initialValues is absent
statusReason: expected [ { id: '1', …(2) }, …(2) ] to deeply equal [ { id: '1', …(2) }, …(2) ]

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelect.helpers.ts:24:9
       if (selectedId) selected = true;
     }
 
-    if (!initialValues?.[name] && Array.isArray(defaultValue)) {
+    if (true) {
       const selectedId = defaultValue.find((item) => item === option.id);
       if (selectedId) selected = true;
killedBy: MultiSelect should render correctly
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelect.helpers.ts:25:54
     }
 
     if (!initialValues?.[name] && Array.isArray(defaultValue)) {
-      const selectedId = defaultValue.find((item) => item === option.id);
+      const selectedId = defaultValue.find((item) => false);
       if (selectedId) selected = true;
     }
killedBy: getMultiSelectSelectValues should return MultiSelectValue[] with selected true for options in defaultValue if initialValues is absent
statusReason: expected [ { id: '1', …(2) }, …(2) ] to deeply equal [ { id: '1', …(2) }, …(2) ]

[Killed] EqualityOperator
components/molecules/multi-select/MultiSelect.helpers.ts:25:54
     }
 
     if (!initialValues?.[name] && Array.isArray(defaultValue)) {
-      const selectedId = defaultValue.find((item) => item === option.id);
+      const selectedId = defaultValue.find((item) => item !== option.id);
       if (selectedId) selected = true;
     }
killedBy: getMultiSelectSelectValues should return MultiSelectValue[] with selected true for options in defaultValue if initialValues is absent
statusReason: expected [ { id: '1', …(2) }, …(2) ] to deeply equal [ { id: '1', …(2) }, …(2) ]

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelect.helpers.ts:26:11
 
     if (!initialValues?.[name] && Array.isArray(defaultValue)) {
       const selectedId = defaultValue.find((item) => item === option.id);
-      if (selectedId) selected = true;
+      if (true) selected = true;
     }
 
killedBy: getMultiSelectSelectValues should return MultiSelectValue[] with selected true for options in defaultValue if initialValues is absent
statusReason: expected [ { id: '1', …(2) }, …(2) ] to deeply equal [ { id: '1', …(2) }, …(2) ]

[Killed] BooleanLiteral
components/molecules/multi-select/MultiSelect.helpers.ts:26:34
 
     if (!initialValues?.[name] && Array.isArray(defaultValue)) {
       const selectedId = defaultValue.find((item) => item === option.id);
-      if (selectedId) selected = true;
+      if (selectedId) selected = false;
     }
 
killedBy: getMultiSelectSelectValues should return MultiSelectValue[] with selected true for options in defaultValue if initialValues is absent
statusReason: expected [ { id: '1', …(2) }, …(2) ] to deeply equal [ { id: '1', …(2) }, …(2) ]

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:33:84
   });
 }
 
-export const getMultiSelectFormValues = (options: MultiSelectValue[]): string[] => {
-  return options.filter((item) => item.selected).map((item) => item.id);
-};
+export const getMultiSelectFormValues = (options: MultiSelectValue[]): string[] => {};
 
 export const getMultiSelectUpdatedValues = (
killedBy: getMultiSelectFormValues returns an array of selected item ids
statusReason: expected undefined to deeply equal [ '1', '3' ]

[Killed] MethodExpression
components/molecules/multi-select/MultiSelect.helpers.ts:34:10
 }
 
 export const getMultiSelectFormValues = (options: MultiSelectValue[]): string[] => {
-  return options.filter((item) => item.selected).map((item) => item.id);
+  return options.map((item) => item.id);
 };
 
killedBy: getMultiSelectFormValues returns an array of selected item ids
statusReason: expected [ '1', '2', '3' ] to deeply equal [ '1', '3' ]

[Killed] ArrowFunction
components/molecules/multi-select/MultiSelect.helpers.ts:34:25
 }
 
 export const getMultiSelectFormValues = (options: MultiSelectValue[]): string[] => {
-  return options.filter((item) => item.selected).map((item) => item.id);
+  return options.filter(() => undefined).map((item) => item.id);
 };
 
killedBy: getMultiSelectFormValues returns an array of selected item ids
statusReason: expected [] to deeply equal [ '1', '3' ]

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:40:26
 export const getMultiSelectUpdatedValues = (
   options: MultiSelectValue[],
   id: string,
-): MultiSelectValue[] => {
-  const targetItem = options.find((item) => item.id === id);
-  return options.map((item) => {
-    return item.id === id ? { ...item, selected: !targetItem?.selected } : item;
-  });
-};
+): MultiSelectValue[] => {};
 
killedBy: MultiSelect should call onSelectChange handler
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelect.helpers.ts:41:45
   options: MultiSelectValue[],
   id: string,
 ): MultiSelectValue[] => {
-  const targetItem = options.find((item) => item.id === id);
+  const targetItem = options.find((item) => true);
   return options.map((item) => {
     return item.id === id ? { ...item, selected: !targetItem?.selected } : item;
killedBy: MultiSelect should allow the user to deselect an option
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  583e8b60-0177-4e38-a423-4b1d5d0a2236

[Killed] ArrowFunction
components/molecules/multi-select/MultiSelect.helpers.ts:41:35
   options: MultiSelectValue[],
   id: string,
 ): MultiSelectValue[] => {
-  const targetItem = options.find((item) => item.id === id);
+  const targetItem = options.find(() => undefined);
   return options.map((item) => {
     return item.id === id ? { ...item, selected: !targetItem?.selected } : item;
killedBy: MultiSelect should allow the user to deselect an option
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  583e8b60-0177-4e38-a423-4b1d5d0a2236

[Killed] BlockStatement
components/molecules/multi-select/MultiSelect.helpers.ts:42:32
   id: string,
 ): MultiSelectValue[] => {
   const targetItem = options.find((item) => item.id === id);
-  return options.map((item) => {
-    return item.id === id ? { ...item, selected: !targetItem?.selected } : item;
-  });
+  return options.map((item) => {});
 };
 
killedBy: MultiSelect should call onSelectChange handler
statusReason: Cannot read properties of undefined (reading 'selected')

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelect.helpers.ts:43:12
 ): MultiSelectValue[] => {
   const targetItem = options.find((item) => item.id === id);
   return options.map((item) => {
-    return item.id === id ? { ...item, selected: !targetItem?.selected } : item;
+    return false ? { ...item, selected: !targetItem?.selected } : item;
   });
 };
killedBy: MultiSelect should allow the user to select an option
statusReason: expect(element).toHaveValue(583e8b60-0177-4e38-a423-4b1d5d0a2236)

Expected the element to have value:
  583e8b60-0177-4e38-a423-4b1d5d0a2236
Received:

[Killed] EqualityOperator
components/molecules/multi-select/MultiSelect.helpers.ts:43:12
 ): MultiSelectValue[] => {
   const targetItem = options.find((item) => item.id === id);
   return options.map((item) => {
-    return item.id === id ? { ...item, selected: !targetItem?.selected } : item;
+    return item.id !== id ? { ...item, selected: !targetItem?.selected } : item;
   });
 };
killedBy: MultiSelect should allow the user to select an option
statusReason: expect(element).toHaveValue(583e8b60-0177-4e38-a423-4b1d5d0a2236)

Expected the element to have value:
  583e8b60-0177-4e38-a423-4b1d5d0a2236
Received:
  57b5a856-bc4b-4c2f-8295-9f44434fafc7,b20bea7b-8172-4d12-b172-d5feac02d863,641fc722-af5a-4426-8f8a-1566cc492b91
