[Killed] BooleanLiteral
components/molecules/multi-select/MultiSelect.tsx:16:14
   options,
   name,
   label,
-  required = false,
+  required = true,
   placeholder = 'Not selected',
   disabled = false,
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] BooleanLiteral
components/molecules/multi-select/MultiSelect.tsx:18:14
   label,
   required = false,
   placeholder = 'Not selected',
-  disabled = false,
+  disabled = true,
   onChange,
   defaultValue,
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched
