[Killed] BlockStatement
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:9:90
   placeholder?: string;
 };
 
-export const MultiSelectComboboxSelectedValues: FC<Props> = ({ values, placeholder }) => {
-  const selectedLabels = !values
-    ? []
-    : values.filter((value) => value.selected).map((value) => value.label);
-
-  const allItemsSelected = selectedLabels.length !== 0 && selectedLabels.length === values?.length;
-  const singleItemSelected = selectedLabels.length === 1;
-  const multipleItemsSelected = selectedLabels.length > 1;
-
-  if (allItemsSelected) {
-    return <span>All items selected</span>;
-  }
-
-  if (singleItemSelected) {
-    return <span>{selectedLabels[0]}</span>;
-  }
-
-  if (multipleItemsSelected) {
-    return <span>{`${selectedLabels.length} items selected`}</span>;
-  }
-
-  return <span>{placeholder}</span>;
-};
+export const MultiSelectComboboxSelectedValues: FC<Props> = ({ values, placeholder }) => {};
 
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] BooleanLiteral
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:10:26
 };
 
 export const MultiSelectComboboxSelectedValues: FC<Props> = ({ values, placeholder }) => {
-  const selectedLabels = !values
+  const selectedLabels = values
     ? []
     : values.filter((value) => value.selected).map((value) => value.label);
killedBy: MultiSelect should display a correct placeholder when some items selected
statusReason: Unable to find an element with the text: 2 items selected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-select test-class"
      style="width: 400px;"

[Killed] ArrowFunction
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:12:21
 export const MultiSelectComboboxSelectedValues: FC<Props> = ({ values, placeholder }) => {
   const selectedLabels = !values
     ? []
-    : values.filter((value) => value.selected).map((value) => value.label);
+    : values.filter(() => undefined).map((value) => value.label);
 
   const allItemsSelected = selectedLabels.length !== 0 && selectedLabels.length === values?.length;
killedBy: MultiSelect should display a correct placeholder when some items selected
statusReason: Unable to find an element with the text: 2 items selected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-select test-class"
      style="width: 400px;"

[Killed] MethodExpression
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:12:7
 export const MultiSelectComboboxSelectedValues: FC<Props> = ({ values, placeholder }) => {
   const selectedLabels = !values
     ? []
-    : values.filter((value) => value.selected).map((value) => value.label);
+    : values.map((value) => value.label);
 
   const allItemsSelected = selectedLabels.length !== 0 && selectedLabels.length === values?.length;
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] EqualityOperator
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:14:28
     ? []
     : values.filter((value) => value.selected).map((value) => value.label);
 
-  const allItemsSelected = selectedLabels.length !== 0 && selectedLabels.length === values?.length;
+  const allItemsSelected = selectedLabels.length === 0 && selectedLabels.length === values?.length;
   const singleItemSelected = selectedLabels.length === 1;
   const multipleItemsSelected = selectedLabels.length > 1;
killedBy: MultiSelectComboboxSelectedValues renders "All items selected" when all items are selected
statusReason: Unable to find an element with the text: All items selected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span>
      3 items selected
    </span>

[Killed] EqualityOperator
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:14:59
     ? []
     : values.filter((value) => value.selected).map((value) => value.label);
 
-  const allItemsSelected = selectedLabels.length !== 0 && selectedLabels.length === values?.length;
+  const allItemsSelected = selectedLabels.length !== 0 && selectedLabels.length !== values?.length;
   const singleItemSelected = selectedLabels.length === 1;
   const multipleItemsSelected = selectedLabels.length > 1;
killedBy: MultiSelectComboboxSelectedValues renders single selected item label
statusReason: Unable to find an element with the text: Item 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span>
      All items selected
    </span>

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:15:30
     : values.filter((value) => value.selected).map((value) => value.label);
 
   const allItemsSelected = selectedLabels.length !== 0 && selectedLabels.length === values?.length;
-  const singleItemSelected = selectedLabels.length === 1;
+  const singleItemSelected = false;
   const multipleItemsSelected = selectedLabels.length > 1;
 
killedBy: MultiSelectComboboxSelectedValues renders single selected item label
statusReason: Unable to find an element with the text: Item 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span />
  </div>
</body>

[Killed] EqualityOperator
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:15:30
     : values.filter((value) => value.selected).map((value) => value.label);
 
   const allItemsSelected = selectedLabels.length !== 0 && selectedLabels.length === values?.length;
-  const singleItemSelected = selectedLabels.length === 1;
+  const singleItemSelected = selectedLabels.length !== 1;
   const multipleItemsSelected = selectedLabels.length > 1;
 
killedBy: MultiSelectComboboxSelectedValues renders placeholder when values is undefined
statusReason: Unable to find an element with the text: Select items. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span />
  </div>
</body>

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:16:33
 
   const allItemsSelected = selectedLabels.length !== 0 && selectedLabels.length === values?.length;
   const singleItemSelected = selectedLabels.length === 1;
-  const multipleItemsSelected = selectedLabels.length > 1;
+  const multipleItemsSelected = true;
 
   if (allItemsSelected) {
killedBy: MultiSelectComboboxSelectedValues renders placeholder when values is undefined
statusReason: Unable to find an element with the text: Select items. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span>
      0 items selected
    </span>

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:16:33
 
   const allItemsSelected = selectedLabels.length !== 0 && selectedLabels.length === values?.length;
   const singleItemSelected = selectedLabels.length === 1;
-  const multipleItemsSelected = selectedLabels.length > 1;
+  const multipleItemsSelected = false;
 
   if (allItemsSelected) {
killedBy: MultiSelectComboboxSelectedValues renders count when multiple items are selected
statusReason: Unable to find an element with the text: 2 items selected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span />
  </div>
</body>

[Killed] BlockStatement
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:18:25
   const singleItemSelected = selectedLabels.length === 1;
   const multipleItemsSelected = selectedLabels.length > 1;
 
-  if (allItemsSelected) {
-    return <span>All items selected</span>;
-  }
+  if (allItemsSelected) {}
 
   if (singleItemSelected) {
killedBy: MultiSelect should display a correct placeholder when all items selected
statusReason: Unable to find an element with the text: All items selected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-select test-class"
      style="width: 400px;"

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:18:7
   const singleItemSelected = selectedLabels.length === 1;
   const multipleItemsSelected = selectedLabels.length > 1;
 
-  if (allItemsSelected) {
+  if (true) {
     return <span>All items selected</span>;
   }
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:22:7
     return <span>All items selected</span>;
   }
 
-  if (singleItemSelected) {
+  if (true) {
     return <span>{selectedLabels[0]}</span>;
   }
killedBy: MultiSelect should render correctly
statusReason: Snapshot `MultiSelect > should render correctly 1` mismatched

[Killed] BlockStatement
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:22:27
     return <span>All items selected</span>;
   }
 
-  if (singleItemSelected) {
-    return <span>{selectedLabels[0]}</span>;
-  }
+  if (singleItemSelected) {}
 
   if (multipleItemsSelected) {
killedBy: MultiSelectComboboxSelectedValues renders single selected item label
statusReason: Unable to find an element with the text: Item 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span />
  </div>
</body>

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:26:7
     return <span>{selectedLabels[0]}</span>;
   }
 
-  if (multipleItemsSelected) {
+  if (true) {
     return <span>{`${selectedLabels.length} items selected`}</span>;
   }
killedBy: MultiSelectComboboxSelectedValues renders placeholder when values is undefined
statusReason: Unable to find an element with the text: Select items. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span>
      0 items selected
    </span>

[Killed] ConditionalExpression
components/molecules/multi-select/MultiSelectComboboxSelectedValues.tsx:26:7
     return <span>{selectedLabels[0]}</span>;
   }
 
-  if (multipleItemsSelected) {
+  if (false) {
     return <span>{`${selectedLabels.length} items selected`}</span>;
   }
killedBy: MultiSelectComboboxSelectedValues renders count when multiple items are selected
statusReason: Unable to find an element with the text: 2 items selected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span />
  </div>
</body>
