[Killed] BooleanLiteral
components/molecules/numeric-input/NumericInput.controller.ts:43:47
   const maxValue = max ? Number(max) : Number.MAX_SAFE_INTEGER;
   const minValue = min ? Number(min) : Number.MIN_SAFE_INTEGER;
   const [value, setValue] = useState<number>(initialValue);
-  const [valid, setValid] = useState<boolean>(true);
+  const [valid, setValid] = useState<boolean>(false);
   const onChangeFormInputRef = useRef(onChangeFormInput);
   const initialValueRef = useRef(initialValue);
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched

[Killed] BlockStatement
components/molecules/numeric-input/NumericInput.controller.ts:51:42
   onChangeFormInputRef.current = onChangeFormInput;
   initialValueRef.current = initialValue;
 
-  const updateValue = (value: number) => {
-    setValue(value);
-    const valid = validateNumericInputValue({ value, required, validator, maxValue, minValue });
-    setValid(valid);
-    onChangeFormInput?.({ name, value, valid });
-  };
+  const updateValue = (value: number) => {};
 
   const handleChange = (event: ChangeEvent<HTMLInputElement>) => {
killedBy: NumericInput updates value when typing
statusReason: expect(element).toHaveValue(10)

Expected the element to have value:
  10
Received:
  0

[Killed] BlockStatement
components/molecules/numeric-input/NumericInput.controller.ts:58:66
     onChangeFormInput?.({ name, value, valid });
   };
 
-  const handleChange = (event: ChangeEvent<HTMLInputElement>) => {
-    const value = Number(event.target.value);
-    updateValue(value);
-    onChange?.(event);
-  };
+  const handleChange = (event: ChangeEvent<HTMLInputElement>) => {};
 
   const handleIncrement = () => {
killedBy: NumericInput updates value when typing
statusReason: expect(element).toHaveValue(10)

Expected the element to have value:
  10
Received:
  0

[Killed] BlockStatement
components/molecules/numeric-input/NumericInput.controller.ts:64:33
     onChange?.(event);
   };
 
-  const handleIncrement = () => {
-    updateValue(value + step);
-    onIncrement?.();
-  };
+  const handleIncrement = () => {};
 
   const handleDecrement = () => {
killedBy: NumericInput should allow step increment using custom spin buttons
statusReason: expect(element).toHaveValue(6)

Expected the element to have value:
  6
Received:
  0

[Killed] ArithmeticOperator
components/molecules/numeric-input/NumericInput.controller.ts:65:17
   };
 
   const handleIncrement = () => {
-    updateValue(value + step);
+    updateValue(value - step);
     onIncrement?.();
   };
killedBy: NumericInput should allow step increment using custom spin buttons
statusReason: expect(element).toHaveValue(6)

Expected the element to have value:
  6
Received:
  -6

[Killed] BlockStatement
components/molecules/numeric-input/NumericInput.controller.ts:69:33
     onIncrement?.();
   };
 
-  const handleDecrement = () => {
-    updateValue(value - step);
-    onDecrement?.();
-  };
+  const handleDecrement = () => {};
 
   const handleReset = useCallback(() => {
killedBy: NumericInput should allow step decrement using custom spin buttons
statusReason: expect(element).toHaveValue(-10)

Expected the element to have value:
  -10
Received:
  0

[Killed] ArithmeticOperator
components/molecules/numeric-input/NumericInput.controller.ts:70:17
   };
 
   const handleDecrement = () => {
-    updateValue(value - step);
+    updateValue(value + step);
     onDecrement?.();
   };
killedBy: NumericInput should allow step decrement using custom spin buttons
statusReason: expect(element).toHaveValue(-10)

Expected the element to have value:
  -10
Received:
  10
