[Killed] BlockStatement
components/molecules/numeric-input/NumericInput.helpers.ts:11:12
   name: string;
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
-}): number {
-  if (initialValues?.[name]) {
-    return Number(initialValues[name]);
-  }
-
-  if (defaultValue && typeof defaultValue === 'number') {
-    return defaultValue;
-  }
-
-  return 0;
-}
+}): number {}
 
 export function validateNumericInputValue({
killedBy: Form should not render Reset button is hasReset props is false
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] OptionalChaining
components/molecules/numeric-input/NumericInput.helpers.ts:12:7
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
 }): number {
-  if (initialValues?.[name]) {
+  if (initialValues[name]) {
     return Number(initialValues[name]);
   }
killedBy: Form should not render Reset button is hasReset props is false
statusReason: Cannot read properties of undefined (reading 'age')

[Killed] ConditionalExpression
components/molecules/numeric-input/NumericInput.helpers.ts:12:7
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
 }): number {
-  if (initialValues?.[name]) {
+  if (false) {
     return Number(initialValues[name]);
   }
killedBy: Form should render initial values
statusReason: expect(element).toHaveValue(33)

Expected the element to have value:
  33
Received:
  0

[Killed] ConditionalExpression
components/molecules/numeric-input/NumericInput.helpers.ts:16:7
     return Number(initialValues[name]);
   }
 
-  if (defaultValue && typeof defaultValue === 'number') {
+  if (true) {
     return defaultValue;
   }
killedBy: getNumericInputInitialValue should return 0 if neither initialValues nor defaultValue exist
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
components/molecules/numeric-input/NumericInput.helpers.ts:16:57
     return Number(initialValues[name]);
   }
 
-  if (defaultValue && typeof defaultValue === 'number') {
-    return defaultValue;
-  }
+  if (defaultValue && typeof defaultValue === 'number') {}
 
   return 0;
killedBy: getNumericInputInitialValue should return the defaultValue if initialValues does not exist
statusReason: expected +0 to be 10 // Object.is equality

[Killed] BlockStatement
components/molecules/numeric-input/NumericInput.helpers.ts:35:13
   validator?: NumericInputValidator;
   maxValue?: number;
   minValue?: number;
-}): boolean {
-  if (required && !validator && value === undefined) {
-    return false;
-  }
-
-  if (validator && typeof validator === 'function') {
-    return validator(value);
-  }
-
-  if (maxValue && minValue && value && !validator) {
-    return value <= maxValue && value >= minValue;
-  }
-
-  return true;
-}
+}): boolean {}
 
killedBy: validateNumericInputValue should return false when value is required but undefined
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
components/molecules/numeric-input/NumericInput.helpers.ts:36:19
   maxValue?: number;
   minValue?: number;
 }): boolean {
-  if (required && !validator && value === undefined) {
+  if (required && validator && value === undefined) {
     return false;
   }
killedBy: validateNumericInputValue should return false when value is required but undefined
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
components/molecules/numeric-input/NumericInput.helpers.ts:36:33
   maxValue?: number;
   minValue?: number;
 }): boolean {
-  if (required && !validator && value === undefined) {
+  if (required && !validator && value !== undefined) {
     return false;
   }
killedBy: validateNumericInputValue should return false when value is required but undefined
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
components/molecules/numeric-input/NumericInput.helpers.ts:37:12
   minValue?: number;
 }): boolean {
   if (required && !validator && value === undefined) {
-    return false;
+    return true;
   }
 
killedBy: validateNumericInputValue should return false when value is required but undefined
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
components/molecules/numeric-input/NumericInput.helpers.ts:40:53
     return false;
   }
 
-  if (validator && typeof validator === 'function') {
-    return validator(value);
-  }
+  if (validator && typeof validator === 'function') {}
 
   if (maxValue && minValue && value && !validator) {
killedBy: NumericInput should show an error message if the input value is invalid
statusReason: expect(element).toHaveAttribute("aria-hidden", "false") // element.getAttribute("aria-hidden") === "false"

Expected the element to have attribute:
  aria-hidden="false"
Received:
  aria-hidden="true"

[Killed] ConditionalExpression
components/molecules/numeric-input/NumericInput.helpers.ts:40:7
     return false;
   }
 
-  if (validator && typeof validator === 'function') {
+  if (true) {
     return validator(value);
   }
killedBy: validateNumericInputValue should return true when value is not required and undefined
statusReason: validator is not a function

[Killed] BooleanLiteral
components/molecules/numeric-input/NumericInput.helpers.ts:44:40
     return validator(value);
   }
 
-  if (maxValue && minValue && value && !validator) {
+  if (maxValue && minValue && value && validator) {
     return value <= maxValue && value >= minValue;
   }
killedBy: validateNumericInputValue should return false when value is below the minimum range
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
components/molecules/numeric-input/NumericInput.helpers.ts:44:7
     return validator(value);
   }
 
-  if (maxValue && minValue && value && !validator) {
+  if (maxValue && minValue && value || !validator) {
     return value <= maxValue && value >= minValue;
   }
killedBy: validateNumericInputValue should return true when value is not required and undefined
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
components/molecules/numeric-input/NumericInput.helpers.ts:45:12
   }
 
   if (maxValue && minValue && value && !validator) {
-    return value <= maxValue && value >= minValue;
+    return value <= maxValue || value >= minValue;
   }
 
killedBy: validateNumericInputValue should return false when value is below the minimum range
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
components/molecules/numeric-input/NumericInput.helpers.ts:45:33
   }
 
   if (maxValue && minValue && value && !validator) {
-    return value <= maxValue && value >= minValue;
+    return value <= maxValue && true;
   }
 
killedBy: validateNumericInputValue should return false when value is below the minimum range
statusReason: expected true to be false // Object.is equality
