[Killed] BooleanLiteral
components/molecules/numeric-input/NumericInputStateful.tsx:26:14
   max,
   id,
   tabIndex,
-  disabled = false,
+  disabled = true,
   required = false,
   readOnly = false,
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
components/molecules/numeric-input/NumericInputStateful.tsx:27:14
   id,
   tabIndex,
   disabled = false,
-  required = false,
+  required = true,
   readOnly = false,
   hasSpinButtons = true,
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
components/molecules/numeric-input/NumericInputStateful.tsx:28:14
   tabIndex,
   disabled = false,
   required = false,
-  readOnly = false,
+  readOnly = true,
   hasSpinButtons = true,
   defaultValue = 0,
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
components/molecules/numeric-input/NumericInputStateful.tsx:29:20
   disabled = false,
   required = false,
   readOnly = false,
-  hasSpinButtons = true,
+  hasSpinButtons = false,
   defaultValue = 0,
   step = 1,
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
components/molecules/numeric-input/NumericInputStateful.tsx:62:23
         required={required}
         readOnly={readOnly}
         placeholder="0"
-        aria-invalid={!valid}
+        aria-invalid={valid}
         aria-errormessage={errorId}
         value={value.toString()}
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
components/molecules/numeric-input/NumericInputStateful.tsx:73:10
         onFocus={onFocus}
         tabIndex={tabIndex}
       >
-        {hasSpinButtons && (
-          <span>
-            <Button
-              onClick={handleDecrement}
-              view={ButtonView.Inner}
-              label={`Decrement value for ${label}`}
-              icon={IconName.ChevronLeft}
-              disabled={disabled}
-            />
-            <Button
-              onClick={handleIncrement}
-              view={ButtonView.Inner}
-              label={`Increment value for ${label}`}
-              icon={IconName.ChevronRight}
-              disabled={disabled}
-            />
-          </span>
-        )}
+        {true}
         <ErrorMessage
           errorId={errorId}
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched

[Killed] LogicalOperator
components/molecules/numeric-input/NumericInputStateful.tsx:73:10
         onFocus={onFocus}
         tabIndex={tabIndex}
       >
-        {hasSpinButtons && (
-          <span>
-            <Button
-              onClick={handleDecrement}
-              view={ButtonView.Inner}
-              label={`Decrement value for ${label}`}
-              icon={IconName.ChevronLeft}
-              disabled={disabled}
-            />
-            <Button
-              onClick={handleIncrement}
-              view={ButtonView.Inner}
-              label={`Increment value for ${label}`}
-              icon={IconName.ChevronRight}
-              disabled={disabled}
-            />
-          </span>
-        )}
+        {hasSpinButtons || <span>
+            <Button onClick={handleDecrement} view={ButtonView.Inner} label={`Decrement value for ${label}`} icon={IconName.ChevronLeft} disabled={disabled} />
+            <Button onClick={handleIncrement} view={ButtonView.Inner} label={`Increment value for ${label}`} icon={IconName.ChevronRight} disabled={disabled} />
+          </span>}
         <ErrorMessage
           errorId={errorId}
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
components/molecules/numeric-input/NumericInputStateful.tsx:94:20
         <ErrorMessage
           errorId={errorId}
           message={errorMessage}
-          visible={!valid}
+          visible={valid}
           className="cl-numeric-input__error-message"
         />
killedBy: NumericInput should match the snapshot
statusReason: Snapshot `NumericInput > should match the snapshot 1` mismatched
