[Survived] LogicalOperator
components/molecules/numeric-input/NumericInputStateless.tsx:33:21
   defaultValue,
   style,
 }) => {
-  const elementId = id ?? `numeric-input-${name}`;
+  const elementId = id && `numeric-input-${name}`;
   const errorId = `${name}-error`;
   const inputClass = getClassName(['cl-numeric-input', className]);

[Survived] BooleanLiteral
components/molecules/numeric-input/NumericInputStateless.tsx:49:24
         required={required}
         readOnly={readOnly}
         placeholder="0"
-        aria-invalid={!!errorMessage}
+        aria-invalid={!errorMessage}
         aria-errormessage={errorId}
         value={value?.toString() ?? ''}

[Killed] LogicalOperator
components/molecules/numeric-input/NumericInputStateless.tsx:51:16
         placeholder="0"
         aria-invalid={!!errorMessage}
         aria-errormessage={errorId}
-        value={value?.toString() ?? ''}
+        value={value?.toString() && ''}
         onChange={onChange}
         min={min}
killedBy: NumericInput Stateless mode should use stateless value when stateless prop is true
statusReason: expect(element).toHaveValue(42)

Expected the element to have value:
  42
Received:
  null

[Killed] OptionalChaining
components/molecules/numeric-input/NumericInputStateless.tsx:51:16
         placeholder="0"
         aria-invalid={!!errorMessage}
         aria-errormessage={errorId}
-        value={value?.toString() ?? ''}
+        value={value.toString() ?? ''}
         onChange={onChange}
         min={min}
killedBy: NumericInput Stateless mode should render correctly with stateless mode and no value prop
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] ConditionalExpression
components/molecules/numeric-input/NumericInputStateless.tsx:60:10
         onFocus={onFocus}
         tabIndex={tabIndex}
       >
-        {hasSpinButtons && (
-          <span>
-            <Button
-              onClick={onDecrement}
-              view={ButtonView.Inner}
-              label={`Decrement value for ${label}`}
-              icon={IconName.ChevronLeft}
-              disabled={disabled}
-            />
-            <Button
-              onClick={onIncrement}
-              view={ButtonView.Inner}
-              label={`Increment value for ${label}`}
-              icon={IconName.ChevronRight}
-              disabled={disabled}
-            />
-          </span>
-        )}
+        {false}
         <ErrorMessage
           errorId={errorId}
killedBy: NumericInput Stateless mode should call onIncrement in stateless mode
statusReason: Unable to find a label with the text of: Increment value for Quantity

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-numeric-input"
      style="width: 400px;"

[Killed] ConditionalExpression
components/molecules/numeric-input/NumericInputStateless.tsx:60:10
         onFocus={onFocus}
         tabIndex={tabIndex}
       >
-        {hasSpinButtons && (
-          <span>
-            <Button
-              onClick={onDecrement}
-              view={ButtonView.Inner}
-              label={`Decrement value for ${label}`}
-              icon={IconName.ChevronLeft}
-              disabled={disabled}
-            />
-            <Button
-              onClick={onIncrement}
-              view={ButtonView.Inner}
-              label={`Increment value for ${label}`}
-              icon={IconName.ChevronRight}
-              disabled={disabled}
-            />
-          </span>
-        )}
+        {true}
         <ErrorMessage
           errorId={errorId}
killedBy: NumericInput Stateless mode should call onIncrement in stateless mode
statusReason: Unable to find a label with the text of: Increment value for Quantity

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-numeric-input"
      style="width: 400px;"

[Survived] BooleanLiteral
components/molecules/numeric-input/NumericInputStateless.tsx:81:21
         <ErrorMessage
           errorId={errorId}
           message={errorMessage}
-          visible={!!errorMessage}
+          visible={!errorMessage}
           className="cl-numeric-input__error-message"
         />
