[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:28:33
   | 'autoComplete'
 >) {
   const [searchValue, setSearchValue] = useState('');
-  const isSearchButtonVisible = searchMode === 'manual';
+  const isSearchButtonVisible = true;
   const isLabelIconVisible = !isSearchButtonVisible;
   const isClearButtonVisible = searchValue.length > 0;
killedBy: Search hides search button in automatic mode
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  data-testid="search-button"
  disabled=""
  type="button"
>
  chop-icon__search

[Killed] EqualityOperator
components/molecules/search/Search.controller.ts:28:33
   | 'autoComplete'
 >) {
   const [searchValue, setSearchValue] = useState('');
-  const isSearchButtonVisible = searchMode === 'manual';
+  const isSearchButtonVisible = searchMode !== 'manual';
   const isLabelIconVisible = !isSearchButtonVisible;
   const isClearButtonVisible = searchValue.length > 0;
killedBy: Search shows search button in manual mode
statusReason: Unable to find an element by: [data-testid="search-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-search"
    >

[Killed] BooleanLiteral
components/molecules/search/Search.controller.ts:29:30
 >) {
   const [searchValue, setSearchValue] = useState('');
   const isSearchButtonVisible = searchMode === 'manual';
-  const isLabelIconVisible = !isSearchButtonVisible;
+  const isLabelIconVisible = isSearchButtonVisible;
   const isClearButtonVisible = searchValue.length > 0;
   const isSearchValueValid =
killedBy: useSearchController initial state should set isLabelIconVisible to true in automatic mode
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:30:32
   const [searchValue, setSearchValue] = useState('');
   const isSearchButtonVisible = searchMode === 'manual';
   const isLabelIconVisible = !isSearchButtonVisible;
-  const isClearButtonVisible = searchValue.length > 0;
+  const isClearButtonVisible = true;
   const isSearchValueValid =
     searchValue.length >= minLength &&
killedBy: useSearchController initial state should initialize isClearButtonVisible to false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
components/molecules/search/Search.controller.ts:30:32
   const [searchValue, setSearchValue] = useState('');
   const isSearchButtonVisible = searchMode === 'manual';
   const isLabelIconVisible = !isSearchButtonVisible;
-  const isClearButtonVisible = searchValue.length > 0;
+  const isClearButtonVisible = searchValue.length <= 0;
   const isSearchValueValid =
     searchValue.length >= minLength &&
killedBy: useSearchController initial state should initialize isClearButtonVisible to false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:32:5
   const isLabelIconVisible = !isSearchButtonVisible;
   const isClearButtonVisible = searchValue.length > 0;
   const isSearchValueValid =
-    searchValue.length >= minLength &&
-    searchValue.trim().length > 0 &&
-    searchValue.length <= maxLength;
+    false;
   const debouncedSearchValue = useDebounce(searchValue, debounceDelay);
 
killedBy: useSearchController handleChange should update isSearchValueValid based on minLength and maxLength
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
components/molecules/search/Search.controller.ts:32:5
   const isLabelIconVisible = !isSearchButtonVisible;
   const isClearButtonVisible = searchValue.length > 0;
   const isSearchValueValid =
-    searchValue.length >= minLength &&
+    searchValue.length < minLength &&
     searchValue.trim().length > 0 &&
     searchValue.length <= maxLength;
killedBy: useSearchController handleChange should update isSearchValueValid based on minLength and maxLength
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
components/molecules/search/Search.controller.ts:33:5
   const isClearButtonVisible = searchValue.length > 0;
   const isSearchValueValid =
     searchValue.length >= minLength &&
-    searchValue.trim().length > 0 &&
+    searchValue.trim().length >= 0 &&
     searchValue.length <= maxLength;
   const debouncedSearchValue = useDebounce(searchValue, debounceDelay);
killedBy: useSearchController handleChange should invalidate if search value is only whitespace
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:33:5
   const isClearButtonVisible = searchValue.length > 0;
   const isSearchValueValid =
     searchValue.length >= minLength &&
-    searchValue.trim().length > 0 &&
+    true &&
     searchValue.length <= maxLength;
   const debouncedSearchValue = useDebounce(searchValue, debounceDelay);
killedBy: useSearchController handleChange should invalidate if search value is only whitespace
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:34:5
   const isSearchValueValid =
     searchValue.length >= minLength &&
     searchValue.trim().length > 0 &&
-    searchValue.length <= maxLength;
+    true;
   const debouncedSearchValue = useDebounce(searchValue, debounceDelay);
 
killedBy: useSearchController handleChange should update isSearchValueValid based on minLength and maxLength
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
components/molecules/search/Search.controller.ts:34:5
   const isSearchValueValid =
     searchValue.length >= minLength &&
     searchValue.trim().length > 0 &&
-    searchValue.length <= maxLength;
+    searchValue.length > maxLength;
   const debouncedSearchValue = useDebounce(searchValue, debounceDelay);
 
killedBy: useSearchController handleChange should update isSearchValueValid based on minLength and maxLength
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
components/molecules/search/Search.controller.ts:47:19
   searchModeRef.current = searchMode;
   isSearchValueValidRef.current = isSearchValueValid;
 
-  useEffect(() => {
-    if (
-      debouncedSearchValue.trim().length > 0 &&
-      searchModeRef.current === 'automatic' &&
-      isSearchValueValidRef.current
-    ) {
-      onSearchRef.current?.(debouncedSearchValue);
-    }
-  }, [debouncedSearchValue]);
+  useEffect(() => {}, [debouncedSearchValue]);
 
   const handleChange = useCallback((event: React.ChangeEvent<HTMLInputElement>) => {
killedBy: useSearchController automatic search with debounce should trigger onSearch after debounce delay in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test search' ]

Number of calls: 0

[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:49:7
 
   useEffect(() => {
     if (
-      debouncedSearchValue.trim().length > 0 &&
-      searchModeRef.current === 'automatic' &&
-      isSearchValueValidRef.current
+      false
     ) {
       onSearchRef.current?.(debouncedSearchValue);
killedBy: useSearchController automatic search with debounce should trigger onSearch after debounce delay in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test search' ]

Number of calls: 0

[Killed] EqualityOperator
components/molecules/search/Search.controller.ts:49:7
 
   useEffect(() => {
     if (
-      debouncedSearchValue.trim().length > 0 &&
+      debouncedSearchValue.trim().length <= 0 &&
       searchModeRef.current === 'automatic' &&
       isSearchValueValidRef.current
killedBy: Search calls onSearch automatically when typing in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test query' ]

Number of calls: 0

[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:50:7
   useEffect(() => {
     if (
       debouncedSearchValue.trim().length > 0 &&
-      searchModeRef.current === 'automatic' &&
+      true &&
       isSearchValueValidRef.current
     ) {
killedBy: useSearchController automatic search with debounce should not trigger search in manual mode during debounce
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "test",

[Killed] EqualityOperator
components/molecules/search/Search.controller.ts:50:7
   useEffect(() => {
     if (
       debouncedSearchValue.trim().length > 0 &&
-      searchModeRef.current === 'automatic' &&
+      searchModeRef.current !== 'automatic' &&
       isSearchValueValidRef.current
     ) {
killedBy: useSearchController automatic search with debounce should trigger onSearch after debounce delay in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test search' ]

Number of calls: 0

[Killed] BlockStatement
components/molecules/search/Search.controller.ts:52:7
       debouncedSearchValue.trim().length > 0 &&
       searchModeRef.current === 'automatic' &&
       isSearchValueValidRef.current
-    ) {
-      onSearchRef.current?.(debouncedSearchValue);
-    }
+    ) {}
   }, [debouncedSearchValue]);
 
killedBy: useSearchController automatic search with debounce should trigger onSearch after debounce delay in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test search' ]

Number of calls: 0

[Survived] OptionalChaining
components/molecules/search/Search.controller.ts:53:7
       searchModeRef.current === 'automatic' &&
       isSearchValueValidRef.current
     ) {
-      onSearchRef.current?.(debouncedSearchValue);
+      onSearchRef.current(debouncedSearchValue);
     }
   }, [debouncedSearchValue]);

[Killed] BlockStatement
components/molecules/search/Search.controller.ts:57:84
     }
   }, [debouncedSearchValue]);
 
-  const handleChange = useCallback((event: React.ChangeEvent<HTMLInputElement>) => {
-    const value = event.target.value;
-    setSearchValue(value);
-  }, []);
+  const handleChange = useCallback((event: React.ChangeEvent<HTMLInputElement>) => {}, []);
 
   const handleClear = useCallback(() => {
killedBy: Search calls onSearch automatically when typing in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test query' ]

Number of calls: 0

[Killed] BlockStatement
components/molecules/search/Search.controller.ts:62:41
     setSearchValue(value);
   }, []);
 
-  const handleClear = useCallback(() => {
-    setSearchValue('');
-    onClear?.();
-  }, [onClear]);
+  const handleClear = useCallback(() => {}, [onClear]);
 
   const handleSearchClick = useCallback(() => {
killedBy: Search calls onClear on Escape key press
statusReason: expected "vi.fn()" to be called at least once

[Killed] OptionalChaining
components/molecules/search/Search.controller.ts:64:5
 
   const handleClear = useCallback(() => {
     setSearchValue('');
-    onClear?.();
+    onClear();
   }, [onClear]);
 
killedBy: useSearchController handleClear should clear search value
statusReason: onClear is not a function

[Killed] BlockStatement
components/molecules/search/Search.controller.ts:67:47
     onClear?.();
   }, [onClear]);
 
-  const handleSearchClick = useCallback(() => {
-    onSearchRef.current?.(searchValue);
-  }, [searchValue]);
+  const handleSearchClick = useCallback(() => {}, [searchValue]);
 
   const handleKeyDown = useCallback(
killedBy: Search calls onSearch when search button is clicked in manual mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'manual search' ]

Number of calls: 0

[Killed] OptionalChaining
components/molecules/search/Search.controller.ts:68:5
   }, [onClear]);
 
   const handleSearchClick = useCallback(() => {
-    onSearchRef.current?.(searchValue);
+    onSearchRef.current(searchValue);
   }, [searchValue]);
 
killedBy: useSearchController handleSearchClick should not call onSearch if callback is not provided
statusReason: expected [Function] to not throw an error but 'TypeError: onSearchRef.current is not…' was thrown

[Killed] BlockStatement
components/molecules/search/Search.controller.ts:72:55
   }, [searchValue]);
 
   const handleKeyDown = useCallback(
-    (event: React.KeyboardEvent<HTMLInputElement>) => {
-      if (event.key === 'Enter') {
-        // Trigger immediate search on Enter
-        event.preventDefault();
-        if (onSearchRef.current) {
-          onSearchRef.current(searchValue);
-        }
-      } else if (event.key === 'Escape') {
-        // Clear on Escape
-        event.preventDefault();
-        handleClear();
-      }
-    },
+    (event: React.KeyboardEvent<HTMLInputElement>) => {},
     [handleClear, searchValue],
   );
killedBy: useSearchController handleKeyDown should trigger search on Enter key press
statusReason: expected "vi.fn()" to be called with arguments: [ 'test' ]

Number of calls: 0

[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:73:11
 
   const handleKeyDown = useCallback(
     (event: React.KeyboardEvent<HTMLInputElement>) => {
-      if (event.key === 'Enter') {
+      if (true) {
         // Trigger immediate search on Enter
         event.preventDefault();
killedBy: useSearchController handleKeyDown should clear search on Escape key press
statusReason: expected 'test' to be '' // Object.is equality

[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:73:11
 
   const handleKeyDown = useCallback(
     (event: React.KeyboardEvent<HTMLInputElement>) => {
-      if (event.key === 'Enter') {
+      if (false) {
         // Trigger immediate search on Enter
         event.preventDefault();
killedBy: useSearchController handleKeyDown should trigger search on Enter key press
statusReason: expected "vi.fn()" to be called with arguments: [ 'test' ]

Number of calls: 0

[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:76:13
       if (event.key === 'Enter') {
         // Trigger immediate search on Enter
         event.preventDefault();
-        if (onSearchRef.current) {
+        if (false) {
           onSearchRef.current(searchValue);
         }
killedBy: useSearchController handleKeyDown should trigger search on Enter key press
statusReason: expected "vi.fn()" to be called with arguments: [ 'test' ]

Number of calls: 0

[Killed] BlockStatement
components/molecules/search/Search.controller.ts:76:34
       if (event.key === 'Enter') {
         // Trigger immediate search on Enter
         event.preventDefault();
-        if (onSearchRef.current) {
-          onSearchRef.current(searchValue);
-        }
+        if (onSearchRef.current) {}
       } else if (event.key === 'Escape') {
         // Clear on Escape
killedBy: useSearchController handleKeyDown should trigger search on Enter key press
statusReason: expected "vi.fn()" to be called with arguments: [ 'test' ]

Number of calls: 0

[Killed] EqualityOperator
components/molecules/search/Search.controller.ts:79:18
         if (onSearchRef.current) {
           onSearchRef.current(searchValue);
         }
-      } else if (event.key === 'Escape') {
+      } else if (event.key !== 'Escape') {
         // Clear on Escape
         event.preventDefault();
killedBy: useSearchController handleKeyDown should clear search on Escape key press
statusReason: expected 'test' to be '' // Object.is equality

[Killed] ConditionalExpression
components/molecules/search/Search.controller.ts:79:18
         if (onSearchRef.current) {
           onSearchRef.current(searchValue);
         }
-      } else if (event.key === 'Escape') {
+      } else if (true) {
         // Clear on Escape
         event.preventDefault();
killedBy: useSearchController handleKeyDown should not prevent default for other keys
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []
