[Killed] BooleanLiteral
components/molecules/search/Search.tsx:25:14
   searchMode = 'automatic',
   name = 'q',
   placeholder = 'Type to search...',
-  disabled = false,
+  disabled = true,
   clearable = true,
   spellCheck = false,
killedBy: Search calls onSearch automatically when typing in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test query' ]

Number of calls: 0

[Killed] BooleanLiteral
components/molecules/search/Search.tsx:26:15
   name = 'q',
   placeholder = 'Type to search...',
   disabled = false,
-  clearable = true,
+  clearable = false,
   spellCheck = false,
   autoComplete = 'off',
killedBy: Search clears input and calls onClear when clear button is clicked
statusReason: Unable to find an element by: [data-testid="clear-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-search"
    >

[Survived] BooleanLiteral
components/molecules/search/Search.tsx:27:16
   placeholder = 'Type to search...',
   disabled = false,
   clearable = true,
-  spellCheck = false,
+  spellCheck = true,
   autoComplete = 'off',
   debounceDelay = 500,

[Survived] ArrayDeclaration
components/molecules/search/Search.tsx:35:35
 }) => {
   const { elementId } = useElementIds(id);
   const inputRef = useRef<HTMLInputElement>(null);
-  const inputClass = getClassName(['cl-search', className]);
+  const inputClass = getClassName([]);
 
   const {

[Killed] BlockStatement
components/molecules/search/Search.tsx:56:38
     debounceDelay,
   });
 
-  const handleClearWithFocus = () => {
-    handleClear();
-    if (inputRef.current) {
-      inputRef.current.focus();
-    }
-  };
+  const handleClearWithFocus = () => {};
 
   return (
killedBy: Search clears input and calls onClear when clear button is clicked
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  test query

[Killed] ConditionalExpression
components/molecules/search/Search.tsx:58:9
 
   const handleClearWithFocus = () => {
     handleClear();
-    if (inputRef.current) {
+    if (false) {
       inputRef.current.focus();
     }
killedBy: Search focuses input after clear
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <input
  autocomplete="off"
  data-testid="search-input"
  id="test-search"
  maxlength="50"

[Killed] BlockStatement
components/molecules/search/Search.tsx:58:27
 
   const handleClearWithFocus = () => {
     handleClear();
-    if (inputRef.current) {
-      inputRef.current.focus();
-    }
+    if (inputRef.current) {}
   };
 
killedBy: Search focuses input after clear
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <input
  autocomplete="off"
  data-testid="search-input"
  id="test-search"
  maxlength="50"

[Survived] BooleanLiteral
components/molecules/search/Search.tsx:67:20
     <div {...rest} className={inputClass}>
       <Label
         label={label}
-        required={!!required}
+        required={!required}
         inputId={elementId}
         icon={isLabelIconVisible ? IconName.Search : undefined}

[Killed] ConditionalExpression
components/molecules/search/Search.tsx:92:12
         required={required}
       >
         <span>
-          {clearable && isClearButtonVisible && (
-            <Button
-              view={ButtonView.Inner}
-              onClick={handleClearWithFocus}
-              label={`Clear search input for ${label}`}
-              icon={IconName.Delete}
-            />
-          )}
+          {true}
           {isSearchButtonVisible && (
             <Button
killedBy: Search shows clear button when there is text and clearable is true
statusReason: Unable to find an element by: [data-testid="clear-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-search"
    >

[Killed] ConditionalExpression
components/molecules/search/Search.tsx:92:12
         required={required}
       >
         <span>
-          {clearable && isClearButtonVisible && (
+          {true && (
             <Button
               view={ButtonView.Inner}
killedBy: Search hides clear button when clearable is false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  data-testid="clear-button"
  type="button"
>
  chop-icon__delete
</button> instead

[Killed] ConditionalExpression
components/molecules/search/Search.tsx:100:12
               icon={IconName.Delete}
             />
           )}
-          {isSearchButtonVisible && (
-            <Button
-              view={ButtonView.Inner}
-              onClick={handleSearchClick}
-              label="Perform search"
-              icon={IconName.Search}
-              disabled={disabled || !isSearchValueValid}
-            />
-          )}
+          {true}
         </span>
       </Input>
killedBy: Search shows search button in manual mode
statusReason: Unable to find an element by: [data-testid="search-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-search"
    >

[Killed] ConditionalExpression
components/molecules/search/Search.tsx:100:12
               icon={IconName.Delete}
             />
           )}
-          {isSearchButtonVisible && (
-            <Button
-              view={ButtonView.Inner}
-              onClick={handleSearchClick}
-              label="Perform search"
-              icon={IconName.Search}
-              disabled={disabled || !isSearchValueValid}
-            />
-          )}
+          {false}
         </span>
       </Input>
killedBy: Search shows search button in manual mode
statusReason: Unable to find an element by: [data-testid="search-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-search"
    >

[Killed] BooleanLiteral
components/molecules/search/Search.tsx:106:37
               onClick={handleSearchClick}
               label="Perform search"
               icon={IconName.Search}
-              disabled={disabled || !isSearchValueValid}
+              disabled={disabled || isSearchValueValid}
             />
           )}
killedBy: Search calls onSearch when search button is clicked in manual mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'manual search' ]

Number of calls: 0

[Killed] ConditionalExpression
components/molecules/search/Search.tsx:106:25
               onClick={handleSearchClick}
               label="Perform search"
               icon={IconName.Search}
-              disabled={disabled || !isSearchValueValid}
+              disabled={true}
             />
           )}
killedBy: Search calls onSearch when search button is clicked in manual mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'manual search' ]

Number of calls: 0
