[Killed] BlockStatement
components/molecules/select/Select.helpers.ts:13:29
   options: SelectValue[];
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
-}): SelectValue | undefined {
-  let valueId: string;
-
-  if (initialValues && Object.hasOwn(initialValues, name)) {
-    const value = initialValues[name];
-    valueId = ((value as FormValues)?.id as string) ?? (value as string);
-  }
-
-  if (!initialValues?.[name] && defaultValue && typeof defaultValue === 'string') {
-    valueId = defaultValue;
-  }
-
-  return options.find((item) => item.id === valueId);
-}
+}): SelectValue | undefined {}
 
killedBy: Select should take an initial value from the form context
statusReason: expect(element).toHaveValue(641fc722-af5a-4426-8f8a-1566cc492b91)

Expected the element to have value:
  641fc722-af5a-4426-8f8a-1566cc492b91
Received:

[Killed] LogicalOperator
components/molecules/select/Select.helpers.ts:16:7
 }): SelectValue | undefined {
   let valueId: string;
 
-  if (initialValues && Object.hasOwn(initialValues, name)) {
+  if (initialValues || Object.hasOwn(initialValues, name)) {
     const value = initialValues[name];
     valueId = ((value as FormValues)?.id as string) ?? (value as string);
killedBy: Select should render correctly
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
components/molecules/select/Select.helpers.ts:16:60
 }): SelectValue | undefined {
   let valueId: string;
 
-  if (initialValues && Object.hasOwn(initialValues, name)) {
-    const value = initialValues[name];
-    valueId = ((value as FormValues)?.id as string) ?? (value as string);
-  }
+  if (initialValues && Object.hasOwn(initialValues, name)) {}
 
   if (!initialValues?.[name] && defaultValue && typeof defaultValue === 'string') {
killedBy: Select should take an initial value from the form context
statusReason: expect(element).toHaveValue(641fc722-af5a-4426-8f8a-1566cc492b91)

Expected the element to have value:
  641fc722-af5a-4426-8f8a-1566cc492b91
Received:

[Killed] LogicalOperator
components/molecules/select/Select.helpers.ts:18:15
 
   if (initialValues && Object.hasOwn(initialValues, name)) {
     const value = initialValues[name];
-    valueId = ((value as FormValues)?.id as string) ?? (value as string);
+    valueId = (value as FormValues)?.id as string && value as string;
   }
 
killedBy: Select should take an initial value from the form context
statusReason: expect(element).toHaveValue(641fc722-af5a-4426-8f8a-1566cc492b91)

Expected the element to have value:
  641fc722-af5a-4426-8f8a-1566cc492b91
Received:

[Killed] LogicalOperator
components/molecules/select/Select.helpers.ts:21:7
     valueId = ((value as FormValues)?.id as string) ?? (value as string);
   }
 
-  if (!initialValues?.[name] && defaultValue && typeof defaultValue === 'string') {
+  if (!initialValues?.[name] && defaultValue || typeof defaultValue === 'string') {
     valueId = defaultValue;
   }
killedBy: getSelectInitialValue should prioritize initialValues over defaultValue
statusReason: expected { id: '2', label: 'Option 2' } to deeply equal { id: '1', label: 'Option 1' }

[Killed] EqualityOperator
components/molecules/select/Select.helpers.ts:21:49
     valueId = ((value as FormValues)?.id as string) ?? (value as string);
   }
 
-  if (!initialValues?.[name] && defaultValue && typeof defaultValue === 'string') {
+  if (!initialValues?.[name] && defaultValue && typeof defaultValue !== 'string') {
     valueId = defaultValue;
   }
killedBy: getSelectInitialValue should return the value from defaultValue if initialValues is not present
statusReason: expected undefined to deeply equal { id: '3', label: 'Option 3' }

[Killed] EqualityOperator
components/molecules/select/Select.helpers.ts:25:33
     valueId = defaultValue;
   }
 
-  return options.find((item) => item.id === valueId);
+  return options.find((item) => item.id !== valueId);
 }
 
killedBy: getSelectInitialValue should return the value from initialValues if present
statusReason: expected { id: '1', label: 'Option 1' } to deeply equal { id: '2', label: 'Option 2' }

[Killed] ConditionalExpression
components/molecules/select/Select.helpers.ts:25:33
     valueId = defaultValue;
   }
 
-  return options.find((item) => item.id === valueId);
+  return options.find((item) => true);
 }
 
killedBy: getSelectInitialValue should return the value from initialValues if present
statusReason: expected { id: '1', label: 'Option 1' } to deeply equal { id: '2', label: 'Option 2' }
