[Killed] BooleanLiteral
components/molecules/select/Select.tsx:20:14
   defaultValue,
   id,
   placeholder = 'Not selected',
-  required = false,
+  required = true,
   disabled = false,
   className,
killedBy: Select should render correctly
statusReason: Snapshot `Select > should render correctly 1` mismatched

[Killed] BooleanLiteral
components/molecules/select/Select.tsx:21:14
   id,
   placeholder = 'Not selected',
   required = false,
-  disabled = false,
+  disabled = true,
   className,
   ...rest
killedBy: Select should render correctly
statusReason: Snapshot `Select > should render correctly 1` mismatched

[Killed] ArrayDeclaration
components/molecules/select/Select.tsx:34:36
       defaultValue,
       name,
     });
-  const selectClass = getClassName(['cl-select', className]);
+  const selectClass = getClassName([]);
 
   useClickOutside({ ref, onClickOutsideHandler: handleClose });
killedBy: Select should render correctly
statusReason: Snapshot `Select > should render correctly 1` mismatched
