[Killed] OptionalChaining
molecules/select/combobox/Combobox.tsx:40:14
     <button
       type="button"
       name={name}
-      value={selected?.id}
+      value={selected.id}
       role="combobox"
       aria-haspopup="listbox"
killedBy: Select should render correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] OptionalChaining
molecules/select/combobox/Combobox.tsx:51:8
       aria-required={required}
       className="cl-select-combobox"
     >
-      {selected?.label ? <span>{selected?.label}</span> : <span>{placeholder}</span>}
+      {selected.label ? <span>{selected?.label}</span> : <span>{placeholder}</span>}
       <Icon name={IconName.ChevronDown} className={iconClass} size={ElementSize.Small} />
     </button>
killedBy: Select should render correctly
statusReason: Cannot read properties of undefined (reading 'label')

[Survived] OptionalChaining
molecules/select/combobox/Combobox.tsx:51:33
       aria-required={required}
       className="cl-select-combobox"
     >
-      {selected?.label ? <span>{selected?.label}</span> : <span>{placeholder}</span>}
+      {selected?.label ? <span>{selected.label}</span> : <span>{placeholder}</span>}
       <Icon name={IconName.ChevronDown} className={iconClass} size={ElementSize.Small} />
     </button>
