[Killed] BlockStatement
molecules/select/dropdown/Dropdown.tsx:29:46
   selected,
   onClear,
 }) => {
-  const handleOptionSelect = (id: string) => {
-    onSelect(id);
-    onClose();
-    moveFocusOnElementById(comboboxId);
-  };
+  const handleOptionSelect = (id: string) => {};
   const dropdownClass = getClassName([
     'cl-select-dropdown',
killedBy: Select should call onSelectChange handler
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ArrowFunction
molecules/select/dropdown/Dropdown.tsx:47:20
       onKeyDown={(e) => handleDropdownListKeyPress({ e, options, onClose })}
       className={dropdownClass}
     >
-      {options.map((item) => (
-        <SelectOption
-          key={item.id}
-          value={item}
-          onSelect={() => handleOptionSelect(item.id)}
-          onClear={onClear}
-          selected={item.id === selected?.id}
-        />
-      ))}
+      {options.map(() => undefined)}
     </ul>
   );
killedBy: Select should render correctly
statusReason: Snapshot `Select > should render correctly 1` mismatched

[Killed] ArrowFunction
molecules/select/dropdown/Dropdown.tsx:51:21
         <SelectOption
           key={item.id}
           value={item}
-          onSelect={() => handleOptionSelect(item.id)}
+          onSelect={() => undefined}
           onClear={onClear}
           selected={item.id === selected?.id}
killedBy: Select should call onSelectChange handler
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
molecules/select/dropdown/Dropdown.tsx:53:21
           value={item}
           onSelect={() => handleOptionSelect(item.id)}
           onClear={onClear}
-          selected={item.id === selected?.id}
+          selected={false}
         />
       ))}
killedBy: Select should allow the user to deselect the same option
statusReason: expect(element).not.toHaveValue(b4b08a09-e287-400b-ba65-afd6ae1f6fd7)

Expected the element not to have value:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7
Received:
  b4b08a09-e287-400b-ba65-afd6ae1f6fd7

[Killed] EqualityOperator
molecules/select/dropdown/Dropdown.tsx:53:21
           value={item}
           onSelect={() => handleOptionSelect(item.id)}
           onClear={onClear}
-          selected={item.id === selected?.id}
+          selected={item.id !== selected?.id}
         />
       ))}
killedBy: Select should render correctly
statusReason: Snapshot `Select > should render correctly 1` mismatched
