[Killed] BlockStatement
components/molecules/text-input/TextInput.helpers.ts:11:13
   value: string;
   required: boolean;
   validator?: ChopLogicRegExpWithFlags | TextInputValidator;
-}): boolean {
-  if (required && !validator && !value.length) {
-    return false;
-  }
-
-  if (validator && typeof validator === 'function') {
-    return validator(value);
-  }
-
-  if (validator && typeof validator === 'object') {
-    return new RegExp(validator.regexp, validator?.flags).test(value);
-  }
-
-  return true;
-}
+}): boolean {}
 
 export function getTextInputInitialValue({
killedBy: TextInput should not show an error message if the input value is valid
statusReason: expect(element).toHaveAttribute("aria-hidden", "true") // element.getAttribute("aria-hidden") === "true"

Expected the element to have attribute:
  aria-hidden="true"
Received:
  aria-hidden="false"

[Killed] LogicalOperator
components/molecules/text-input/TextInput.helpers.ts:12:7
   required: boolean;
   validator?: ChopLogicRegExpWithFlags | TextInputValidator;
 }): boolean {
-  if (required && !validator && !value.length) {
+  if (required || !validator && !value.length) {
     return false;
   }
killedBy: validateTextInputValue should return true when value is not required and empty
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/molecules/text-input/TextInput.helpers.ts:12:7
   required: boolean;
   validator?: ChopLogicRegExpWithFlags | TextInputValidator;
 }): boolean {
-  if (required && !validator && !value.length) {
+  if (true) {
     return false;
   }
killedBy: TextInput should not show an error message if the input value is valid
statusReason: expect(element).toHaveAttribute("aria-hidden", "true") // element.getAttribute("aria-hidden") === "true"

Expected the element to have attribute:
  aria-hidden="true"
Received:
  aria-hidden="false"

[Killed] BooleanLiteral
components/molecules/text-input/TextInput.helpers.ts:13:12
   validator?: ChopLogicRegExpWithFlags | TextInputValidator;
 }): boolean {
   if (required && !validator && !value.length) {
-    return false;
+    return true;
   }
 
killedBy: validateTextInputValue should return false when value is required but empty
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
components/molecules/text-input/TextInput.helpers.ts:16:7
     return false;
   }
 
-  if (validator && typeof validator === 'function') {
+  if (validator || typeof validator === 'function') {
     return validator(value);
   }
killedBy: validateTextInputValue should return true when validator is a regular expression and value matches
statusReason: validator is not a function

[Killed] ConditionalExpression
components/molecules/text-input/TextInput.helpers.ts:16:20
     return false;
   }
 
-  if (validator && typeof validator === 'function') {
+  if (validator && true) {
     return validator(value);
   }
killedBy: validateTextInputValue should return true when validator is a regular expression and value matches
statusReason: validator is not a function

[Killed] ConditionalExpression
components/molecules/text-input/TextInput.helpers.ts:20:7
     return validator(value);
   }
 
-  if (validator && typeof validator === 'object') {
+  if (false) {
     return new RegExp(validator.regexp, validator?.flags).test(value);
   }
killedBy: validateTextInputValue should return false when validator is a regular expression and value does not match
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
components/molecules/text-input/TextInput.helpers.ts:20:7
     return validator(value);
   }
 
-  if (validator && typeof validator === 'object') {
+  if (true) {
     return new RegExp(validator.regexp, validator?.flags).test(value);
   }
killedBy: validateTextInputValue should return true when value is not required and empty
statusReason: Cannot read properties of undefined (reading 'regexp')

[Survived] OptionalChaining
components/molecules/text-input/TextInput.helpers.ts:21:41
   }
 
   if (validator && typeof validator === 'object') {
-    return new RegExp(validator.regexp, validator?.flags).test(value);
+    return new RegExp(validator.regexp, validator.flags).test(value);
   }
 

[Killed] BlockStatement
components/molecules/text-input/TextInput.helpers.ts:35:12
   name: string;
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
-}): string {
-  if (initialValues?.[name]) {
-    return (initialValues[name] as string).toString();
-  }
-
-  if (defaultValue && typeof defaultValue === 'string') {
-    return defaultValue;
-  }
-
-  return '';
-}
+}): string {}
 
killedBy: getTextInputInitialValue should return the value from initialValues if it exists
statusReason: expected undefined to be 'JohnDoe' // Object.is equality

[Killed] ConditionalExpression
components/molecules/text-input/TextInput.helpers.ts:36:7
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
 }): string {
-  if (initialValues?.[name]) {
+  if (true) {
     return (initialValues[name] as string).toString();
   }
killedBy: getTextInputInitialValue should return the defaultValue if initialValues does not exist
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] OptionalChaining
components/molecules/text-input/TextInput.helpers.ts:36:7
   initialValues?: FormValues;
   defaultValue?: string | number | readonly string[];
 }): string {
-  if (initialValues?.[name]) {
+  if (initialValues[name]) {
     return (initialValues[name] as string).toString();
   }
killedBy: Form should not render Reset button is hasReset props is false
statusReason: Cannot read properties of undefined (reading 'firstName')

[Killed] LogicalOperator
components/molecules/text-input/TextInput.helpers.ts:40:7
     return (initialValues[name] as string).toString();
   }
 
-  if (defaultValue && typeof defaultValue === 'string') {
+  if (defaultValue || typeof defaultValue === 'string') {
     return defaultValue;
   }
killedBy: getTextInputInitialValue should return an empty string if defaultValue is not a string
statusReason: expected 456 to be '' // Object.is equality

[Killed] ConditionalExpression
components/molecules/text-input/TextInput.helpers.ts:40:7
     return (initialValues[name] as string).toString();
   }
 
-  if (defaultValue && typeof defaultValue === 'string') {
+  if (false) {
     return defaultValue;
   }
killedBy: getTextInputInitialValue should return the defaultValue if initialValues does not exist
statusReason: expected '' to be 'Guest' // Object.is equality
