[Killed] BlockStatement
components/molecules/text-input/TextInputButtons.tsx:22:7
   passwordShown,
   label,
   disabled,
-}) => {
-  return (
-    <span>
-      {clearable && (
-        <Button
-          view={ButtonView.Inner}
-          onClick={handleClear}
-          label={`Clear input for ${label}`}
-          icon={IconName.Delete}
-          disabled={disabled}
-        />
-      )}
-      {isPasswordButtonVisible && (
-        <Button
-          onClick={togglePassword}
-          view={ButtonView.Inner}
-          label="Toggle password visibility"
-          icon={passwordShown ? IconName.EyeOff : IconName.Eye}
-          disabled={disabled}
-        />
-      )}
-    </span>
-  );
-};
+}) => {};
 
 export default TextInputButtons;
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] LogicalOperator
components/molecules/text-input/TextInputButtons.tsx:25:8
 }) => {
   return (
     <span>
-      {clearable && (
-        <Button
-          view={ButtonView.Inner}
-          onClick={handleClear}
-          label={`Clear input for ${label}`}
-          icon={IconName.Delete}
-          disabled={disabled}
-        />
-      )}
+      {clearable || <Button view={ButtonView.Inner} onClick={handleClear} label={`Clear input for ${label}`} icon={IconName.Delete} disabled={disabled} />}
       {isPasswordButtonVisible && (
         <Button
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] ConditionalExpression
components/molecules/text-input/TextInputButtons.tsx:25:8
 }) => {
   return (
     <span>
-      {clearable && (
-        <Button
-          view={ButtonView.Inner}
-          onClick={handleClear}
-          label={`Clear input for ${label}`}
-          icon={IconName.Delete}
-          disabled={disabled}
-        />
-      )}
+      {true}
       {isPasswordButtonVisible && (
         <Button
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] ConditionalExpression
components/molecules/text-input/TextInputButtons.tsx:34:8
           disabled={disabled}
         />
       )}
-      {isPasswordButtonVisible && (
-        <Button
-          onClick={togglePassword}
-          view={ButtonView.Inner}
-          label="Toggle password visibility"
-          icon={passwordShown ? IconName.EyeOff : IconName.Eye}
-          disabled={disabled}
-        />
-      )}
+      {false}
     </span>
   );
killedBy: TextInput should display the password toggle when input type is password
statusReason: Unable to find a label with the text of: Toggle password visibility

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-text-input test-class"
      style="width: 600px;"

[Killed] ConditionalExpression
components/molecules/text-input/TextInputButtons.tsx:34:8
           disabled={disabled}
         />
       )}
-      {isPasswordButtonVisible && (
-        <Button
-          onClick={togglePassword}
-          view={ButtonView.Inner}
-          label="Toggle password visibility"
-          icon={passwordShown ? IconName.EyeOff : IconName.Eye}
-          disabled={disabled}
-        />
-      )}
+      {true}
     </span>
   );
killedBy: TextInput should display the password toggle when input type is password
statusReason: Unable to find a label with the text of: Toggle password visibility

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-text-input test-class"
      style="width: 600px;"
