[Killed] BooleanLiteral
components/molecules/text-input/TextInputStateful.tsx:25:14
   id,
   tabIndex,
   placeholder = 'Type here...',
-  disabled = false,
+  disabled = true,
   required = false,
   clearable = true,
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] BooleanLiteral
components/molecules/text-input/TextInputStateful.tsx:27:15
   placeholder = 'Type here...',
   disabled = false,
   required = false,
-  clearable = true,
+  clearable = false,
   readOnly = false,
   autoComplete = 'off',
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] BooleanLiteral
components/molecules/text-input/TextInputStateful.tsx:28:14
   disabled = false,
   required = false,
   clearable = true,
-  readOnly = false,
+  readOnly = true,
   autoComplete = 'off',
   type = 'text',
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] ConditionalExpression
components/molecules/text-input/TextInputStateful.tsx:44:35
       validator,
     });
   const { elementId, errorId } = useElementIds(id);
-  const isPasswordButtonVisible = type === 'password';
+  const isPasswordButtonVisible = false;
   const inputClass = getClassName(['cl-text-input', className]);
 
killedBy: TextInput should display the password toggle when input type is password
statusReason: Unable to find a label with the text of: Toggle password visibility

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cl-text-input test-class"
      style="width: 600px;"

[Killed] EqualityOperator
components/molecules/text-input/TextInputStateful.tsx:44:35
       validator,
     });
   const { elementId, errorId } = useElementIds(id);
-  const isPasswordButtonVisible = type === 'password';
+  const isPasswordButtonVisible = type !== 'password';
   const inputClass = getClassName(['cl-text-input', className]);
 
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] BooleanLiteral
components/molecules/text-input/TextInputStateful.tsx:59:23
         required={required}
         readOnly={readOnly}
         autoComplete={autoComplete}
-        aria-invalid={!valid}
+        aria-invalid={valid}
         aria-errormessage={errorId}
         aria-readonly={readOnly}
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched
