[Survived] LogicalOperator
components/molecules/text-input/TextInputStateless.tsx:32:21
   style,
   defaultValue,
 }) => {
-  const elementId = id ?? `text-input-${name}`;
+  const elementId = id && `text-input-${name}`;
   const errorId = `${name}-error`;
   const [passwordShown, setPasswordShown] = useState(false);

[Killed] BooleanLiteral
components/molecules/text-input/TextInputStateless.tsx:34:54
 }) => {
   const elementId = id ?? `text-input-${name}`;
   const errorId = `${name}-error`;
-  const [passwordShown, setPasswordShown] = useState(false);
+  const [passwordShown, setPasswordShown] = useState(true);
   const isPasswordButtonVisible = type === 'password';
   const inputClass = getClassName(['cl-text-input', className]);
killedBy: TextInput Stateless mode should toggle password visibility in stateless mode
statusReason: expect(element).toHaveAttribute("type", "password") // element.getAttribute("type") === "password"

Expected the element to have attribute:
  type="password"
Received:
  type="text"

[Killed] ConditionalExpression
components/molecules/text-input/TextInputStateless.tsx:35:35
   const elementId = id ?? `text-input-${name}`;
   const errorId = `${name}-error`;
   const [passwordShown, setPasswordShown] = useState(false);
-  const isPasswordButtonVisible = type === 'password';
+  const isPasswordButtonVisible = true;
   const inputClass = getClassName(['cl-text-input', className]);
 
killedBy: TextInput Stateless mode should display the Clear button in stateless mode
statusReason: Found multiple elements with the role "button"

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-label="Clear input for Test Input"
  class="cl-inner-button"

[Killed] EqualityOperator
components/molecules/text-input/TextInputStateless.tsx:35:35
   const elementId = id ?? `text-input-${name}`;
   const errorId = `${name}-error`;
   const [passwordShown, setPasswordShown] = useState(false);
-  const isPasswordButtonVisible = type === 'password';
+  const isPasswordButtonVisible = type !== 'password';
   const inputClass = getClassName(['cl-text-input', className]);
 
killedBy: TextInput Stateless mode should display the Clear button in stateless mode
statusReason: Found multiple elements with the role "button"

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-label="Clear input for Test Input"
  class="cl-inner-button"

[Survived] ArrayDeclaration
components/molecules/text-input/TextInputStateless.tsx:36:35
   const errorId = `${name}-error`;
   const [passwordShown, setPasswordShown] = useState(false);
   const isPasswordButtonVisible = type === 'password';
-  const inputClass = getClassName(['cl-text-input', className]);
+  const inputClass = getClassName([]);
 
   const togglePassword = () => {

[Killed] BlockStatement
components/molecules/text-input/TextInputStateless.tsx:42:29
     setPasswordShown(!passwordShown);
   };
 
-  const handleClear = () => {
-    if (onChange) {
-      onChange({ target: { value: '' } } as React.ChangeEvent<HTMLInputElement>);
-    }
-    onClear?.();
-  };
+  const handleClear = () => {};
 
   return (
killedBy: TextInput Stateless mode should call onClear handler in stateless mode
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
components/molecules/text-input/TextInputStateless.tsx:43:9
   };
 
   const handleClear = () => {
-    if (onChange) {
+    if (false) {
       onChange({ target: { value: '' } } as React.ChangeEvent<HTMLInputElement>);
     }
killedBy: TextInput Stateless mode should call onClear handler in stateless mode
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
components/molecules/text-input/TextInputStateless.tsx:43:19
   };
 
   const handleClear = () => {
-    if (onChange) {
-      onChange({ target: { value: '' } } as React.ChangeEvent<HTMLInputElement>);
-    }
+    if (onChange) {}
     onClear?.();
   };
killedBy: TextInput Stateless mode should call onClear handler in stateless mode
statusReason: expected "vi.fn()" to be called at least once

[Survived] OptionalChaining
components/molecules/text-input/TextInputStateless.tsx:46:5
     if (onChange) {
       onChange({ target: { value: '' } } as React.ChangeEvent<HTMLInputElement>);
     }
-    onClear?.();
+    onClear();
   };
 

[Survived] BooleanLiteral
components/molecules/text-input/TextInputStateless.tsx:62:23
         readOnly={readOnly}
         defaultValue={defaultValue}
         autoComplete={autoComplete}
-        aria-invalid={!!errorMessage}
+        aria-invalid={!errorMessage}
         aria-errormessage={errorId}
         aria-readonly={readOnly}

[Killed] LogicalOperator
components/molecules/text-input/TextInputStateless.tsx:65:16
         aria-invalid={!!errorMessage}
         aria-errormessage={errorId}
         aria-readonly={readOnly}
-        value={value ?? ''}
+        value={value && ''}
         onChange={onChange}
         maxLength={maxLength}
killedBy: TextInput Stateless mode should use stateless value when stateless prop is true
statusReason: expect(element).toHaveValue(hello)

Expected the element to have value:
  hello
Received:
