[Survived] LogicalOperator
components/organisms/dialog/Dialog.tsx:12:21
 
 const Dialog: FC<DialogProps> = ({ isOpened, onClose, title, children, icon, ...rest }) => {
   const isMounted = useIsMounted(isOpened);
-  const isClosing = isMounted && !isOpened;
+  const isClosing = isMounted || !isOpened;
 
   const modalRef = useRef(null);

[Survived] BooleanLiteral
components/organisms/dialog/Dialog.tsx:12:34
 
 const Dialog: FC<DialogProps> = ({ isOpened, onClose, title, children, icon, ...rest }) => {
   const isMounted = useIsMounted(isOpened);
-  const isClosing = isMounted && !isOpened;
+  const isClosing = isMounted && isOpened;
 
   const modalRef = useRef(null);

[Killed] BooleanLiteral
components/organisms/dialog/Dialog.tsx:19:7
   useModalFocusTrap({ modalRef, isOpened });
   useKeyPress({ keyCode: 'Escape', ref: modalRef, onKeyPress: onClose });
 
-  if (!isMounted) {
+  if (isMounted) {
     return null;
   }
killedBy: Dialog should render the dialog correctly after a delay
statusReason: Unable to find role="dialog"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
components/organisms/dialog/Dialog.tsx:19:7
   useModalFocusTrap({ modalRef, isOpened });
   useKeyPress({ keyCode: 'Escape', ref: modalRef, onKeyPress: onClose });
 
-  if (!isMounted) {
+  if (true) {
     return null;
   }
killedBy: Dialog should render the dialog correctly after a delay
statusReason: Unable to find role="dialog"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] ArrayDeclaration
components/organisms/dialog/Dialog.tsx:25:36
 
   return (
     <Portal>
-      <div className={getClassName(['cl-dialog', { 'cl-dialog_closing': isClosing }])}>
+      <div className={getClassName([])}>
         <div ref={modalRef} role="dialog" aria-modal="true" {...rest} className="cl-dialog__layout">
           <Button
