[Survived] BlockStatement
components/organisms/form/Form.controller.ts:21:58
   const [validationState, setValidationState] = useState(getInitialValidationState(initialValues));
   const [resetSignal, setResetSignal] = useState(0);
 
-  const handleInputChange = (params: FormInputParams) => {
-    const newData = { ...formData, [params.name]: params.value };
-    setFormData(newData);
-    setValidationState(updateValidationState(validationState, params));
-  };
+  const handleInputChange = (params: FormInputParams) => {};
 
   const handleSubmit = (event: FormEvent<HTMLFormElement>) => {

[Killed] BlockStatement
components/organisms/form/Form.controller.ts:27:63
     setValidationState(updateValidationState(validationState, params));
   };
 
-  const handleSubmit = (event: FormEvent<HTMLFormElement>) => {
-    event.preventDefault();
-
-    const uncontrolledData = Object.fromEntries(new FormData(event.target as HTMLFormElement));
-    const resultData = { ...uncontrolledData, ...formData };
-
-    onSubmit?.(event);
-    onClickSubmit?.(resultData);
-  };
+  const handleSubmit = (event: FormEvent<HTMLFormElement>) => {};
 
   const handleReset = (event: FormEvent<HTMLFormElement>) => {
killedBy: Form should call onSubmit handler
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] OptionalChaining
components/organisms/form/Form.controller.ts:33:5
     const uncontrolledData = Object.fromEntries(new FormData(event.target as HTMLFormElement));
     const resultData = { ...uncontrolledData, ...formData };
 
-    onSubmit?.(event);
+    onSubmit(event);
     onClickSubmit?.(resultData);
   };
killedBy: Form should call onSubmit handler
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Survived] OptionalChaining
components/organisms/form/Form.controller.ts:34:5
     const resultData = { ...uncontrolledData, ...formData };
 
     onSubmit?.(event);
-    onClickSubmit?.(resultData);
+    onClickSubmit(resultData);
   };
 

[Killed] BlockStatement
components/organisms/form/Form.controller.ts:37:62
     onClickSubmit?.(resultData);
   };
 
-  const handleReset = (event: FormEvent<HTMLFormElement>) => {
-    onReset?.(event);
-    setFormData(initialValues);
-    setResetSignal(resetSignal + 1);
-  };
+  const handleReset = (event: FormEvent<HTMLFormElement>) => {};
 
   return {
killedBy: Form should reset entered values to initial values
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Killed] OptionalChaining
components/organisms/form/Form.controller.ts:38:5
   };
 
   const handleReset = (event: FormEvent<HTMLFormElement>) => {
-    onReset?.(event);
+    onReset(event);
     setFormData(initialValues);
     setResetSignal(resetSignal + 1);
killedBy: Form should reset entered values to initial values
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Survived] ArithmeticOperator
components/organisms/form/Form.controller.ts:40:20
   const handleReset = (event: FormEvent<HTMLFormElement>) => {
     onReset?.(event);
     setFormData(initialValues);
-    setResetSignal(resetSignal + 1);
+    setResetSignal(resetSignal - 1);
   };
 
