[Killed] BooleanLiteral
components/organisms/form/Form.tsx:17:14
   onReset,
   onSubmit,
   onClickSubmit,
-  hasReset = true,
+  hasReset = false,
   className,
   ...rest
killedBy: Form should reset entered values to initial values
statusReason: Unable to find an element with the text: Reset. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class="cl-form form-class"
      id="form-id"

[Killed] ArrowFunction
components/organisms/form/Form.tsx:29:5
   });
   const formClass = getClassName(['cl-form', className]);
   const contextValue = useMemo(
-    () => ({ onChangeFormInput: handleInputChange, initialValues, resetSignal }),
+    () => undefined,
     [handleInputChange, initialValues, resetSignal],
   );
killedBy: Form should not render Reset button is hasReset props is false
statusReason: Cannot destructure property 'onChangeFormInput' of '(0 , __vite_ssr_import_1__.useContext)(...)' as it is undefined.

[Killed] ArrayDeclaration
components/organisms/form/Form.tsx:30:5
   const formClass = getClassName(['cl-form', className]);
   const contextValue = useMemo(
     () => ({ onChangeFormInput: handleInputChange, initialValues, resetSignal }),
-    [handleInputChange, initialValues, resetSignal],
+    [],
   );
 
killedBy: Form should reset entered values to initial values
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Killed] ConditionalExpression
components/organisms/form/Form.tsx:38:12
       <FormContext.Provider value={contextValue}>
         {children}
         <div className="cl-form__buttons">
-          {hasReset && (
-            <Button type="reset" text="Reset" icon={IconName.Delete} view={ButtonView.Secondary} />
-          )}
+          {false}
           <Button
             type="submit"
killedBy: Form should reset entered values to initial values
statusReason: Unable to find an element with the text: Reset. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class="cl-form form-class"
      id="form-id"

[Killed] LogicalOperator
components/organisms/form/Form.tsx:38:12
       <FormContext.Provider value={contextValue}>
         {children}
         <div className="cl-form__buttons">
-          {hasReset && (
-            <Button type="reset" text="Reset" icon={IconName.Delete} view={ButtonView.Secondary} />
-          )}
+          {hasReset || <Button type="reset" text="Reset" icon={IconName.Delete} view={ButtonView.Secondary} />}
           <Button
             type="submit"
killedBy: Form should not render Reset button is hasReset props is false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="cl-secondary-button__text"
>
  Reset
</span> instead

[Survived] BooleanLiteral
components/organisms/form/Form.tsx:45:23
             type="submit"
             text="Submit"
             icon={IconName.ArrowRight}
-            extended={!hasReset}
+            extended={hasReset}
             disabled={!valid}
           />

[Killed] BooleanLiteral
components/organisms/form/Form.tsx:46:23
             text="Submit"
             icon={IconName.ArrowRight}
             extended={!hasReset}
-            disabled={!valid}
+            disabled={valid}
           />
         </div>
killedBy: Form should call onSubmit handler
statusReason: expected "vi.fn()" to be called once, but got 0 times
