[Killed] BlockStatement
components/organisms/grid/Grid.helpers.ts:12:20
   item: GridItem;
   columns: GridColumn[];
   renderDataItem?: RenderDataItemCallback;
-}): GridRowValue[] {
-  const result: GridRowValue[] = [];
-  for (const column of columns) {
-    let value: string | ReactElement;
-
-    if (renderDataItem && item[column.field]) {
-      value = renderDataItem(item, column.field);
-    } else if (item[column.field]) {
-      value = (item[column.field] as string).toString();
-    } else {
-      value = '';
-    }
-
-    result.push({ field: column.field, value });
-  }
-
-  return result;
-}
+}): GridRowValue[] {}
 
killedBy: Grid should match the snapshot
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
components/organisms/grid/Grid.helpers.ts:14:33
   renderDataItem?: RenderDataItemCallback;
 }): GridRowValue[] {
   const result: GridRowValue[] = [];
-  for (const column of columns) {
-    let value: string | ReactElement;
-
-    if (renderDataItem && item[column.field]) {
-      value = renderDataItem(item, column.field);
-    } else if (item[column.field]) {
-      value = (item[column.field] as string).toString();
-    } else {
-      value = '';
-    }
-
-    result.push({ field: column.field, value });
-  }
+  for (const column of columns) {}
 
   return result;
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] BlockStatement
components/organisms/grid/Grid.helpers.ts:17:47
   for (const column of columns) {
     let value: string | ReactElement;
 
-    if (renderDataItem && item[column.field]) {
-      value = renderDataItem(item, column.field);
-    } else if (item[column.field]) {
+    if (renderDataItem && item[column.field]) {} else if (item[column.field]) {
       value = (item[column.field] as string).toString();
     } else {
killedBy: getGridRowValues should return rendered JSX elements when renderDataItem is provided for object fields
statusReason: Cannot read properties of undefined (reading 'props')

[Killed] ConditionalExpression
components/organisms/grid/Grid.helpers.ts:17:9
   for (const column of columns) {
     let value: string | ReactElement;
 
-    if (renderDataItem && item[column.field]) {
+    if (false) {
       value = renderDataItem(item, column.field);
     } else if (item[column.field]) {
killedBy: getGridRowValues should return rendered JSX elements when renderDataItem is provided for object fields
statusReason: Cannot read properties of undefined (reading 'children')

[Killed] ConditionalExpression
components/organisms/grid/Grid.helpers.ts:19:16
 
     if (renderDataItem && item[column.field]) {
       value = renderDataItem(item, column.field);
-    } else if (item[column.field]) {
+    } else if (false) {
       value = (item[column.field] as string).toString();
     } else {
killedBy: getGridRowValues should return correct values for each column when fields exist in item
statusReason: expected [ { field: 'id', value: '' }, …(2) ] to deeply equal [ { field: 'id', value: '1' }, …(2) ]

[Killed] ConditionalExpression
components/organisms/grid/Grid.helpers.ts:19:16
 
     if (renderDataItem && item[column.field]) {
       value = renderDataItem(item, column.field);
-    } else if (item[column.field]) {
+    } else if (true) {
       value = (item[column.field] as string).toString();
     } else {
killedBy: getGridRowValues should return empty strings when fields are missing or null in item
statusReason: Cannot read properties of null (reading 'toString')

[Killed] BlockStatement
components/organisms/grid/Grid.helpers.ts:21:12
       value = renderDataItem(item, column.field);
     } else if (item[column.field]) {
       value = (item[column.field] as string).toString();
-    } else {
-      value = '';
-    }
+    } else {}
 
     result.push({ field: column.field, value });
killedBy: getGridRowValues should return empty strings when fields are missing or null in item
statusReason: expected [ { field: 'id', value: '1' }, …(2) ] to deeply equal [ { field: 'id', value: '1' }, …(2) ]
