[Killed] BlockStatement
organisms/grid/body/GridBody.tsx:26:7
   selectable,
   data,
   columns,
-}) => {
-  return (
-    <tbody className="cl-grid-body">
-      {data.map((item) => {
-        const gridRowValues = getGridRowValues({ item, columns, renderDataItem });
-        return (
-          <GridRow
-            key={item.id}
-            rowId={item.id}
-            disabled={item?.disabled}
-            selectRowById={selectRowById}
-            deselectRowById={deselectRowById}
-            selectable={selectable}
-            values={gridRowValues}
-            selectedIds={selectedIds}
-          />
-        );
-      })}
-    </tbody>
-  );
-};
+}) => {};
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] BlockStatement
organisms/grid/body/GridBody.tsx:29:27
 }) => {
   return (
     <tbody className="cl-grid-body">
-      {data.map((item) => {
-        const gridRowValues = getGridRowValues({ item, columns, renderDataItem });
-        return (
-          <GridRow
-            key={item.id}
-            rowId={item.id}
-            disabled={item?.disabled}
-            selectRowById={selectRowById}
-            deselectRowById={deselectRowById}
-            selectable={selectable}
-            values={gridRowValues}
-            selectedIds={selectedIds}
-          />
-        );
-      })}
+      {data.map((item) => {})}
     </tbody>
   );
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Survived] OptionalChaining
organisms/grid/body/GridBody.tsx:35:23
           <GridRow
             key={item.id}
             rowId={item.id}
-            disabled={item?.disabled}
+            disabled={item.disabled}
             selectRowById={selectRowById}
             deselectRowById={deselectRowById}
