[Killed] BlockStatement
organisms/grid/column-group/GridColumnGroup.tsx:10:7
 export const GridColumnGroup: FC<{ columns: GridColumn[]; selectable: boolean }> = ({
   columns,
   selectable,
-}) => {
-  return (
-    <colgroup>
-      {selectable && <col className="cl-grid-column cl-grid-column_first cl-grid-column_check" />}
-      {columns.map((column, index) => (
-        <col
-          key={column?.title}
-          className={getClassName([
-            'cl-grid-column',
-            column?.className,
-            {
-              'cl-grid-column_first': index === 0 && !selectable,
-              'cl-grid-column_highlighted': !!column?.highlighted,
-            },
-          ])}
-        />
-      ))}
-    </colgroup>
-  );
-};
+}) => {};
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/grid/column-group/GridColumnGroup.tsx:13:8
 }) => {
   return (
     <colgroup>
-      {selectable && <col className="cl-grid-column cl-grid-column_first cl-grid-column_check" />}
+      {false}
       {columns.map((column, index) => (
         <col
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] LogicalOperator
organisms/grid/column-group/GridColumnGroup.tsx:13:8
 }) => {
   return (
     <colgroup>
-      {selectable && <col className="cl-grid-column cl-grid-column_first cl-grid-column_check" />}
+      {selectable || <col className="cl-grid-column cl-grid-column_first cl-grid-column_check" />}
       {columns.map((column, index) => (
         <col
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] ArrowFunction
organisms/grid/column-group/GridColumnGroup.tsx:14:20
   return (
     <colgroup>
       {selectable && <col className="cl-grid-column cl-grid-column_first cl-grid-column_check" />}
-      {columns.map((column, index) => (
-        <col
-          key={column?.title}
-          className={getClassName([
-            'cl-grid-column',
-            column?.className,
-            {
-              'cl-grid-column_first': index === 0 && !selectable,
-              'cl-grid-column_highlighted': !!column?.highlighted,
-            },
-          ])}
-        />
-      ))}
+      {columns.map(() => undefined)}
     </colgroup>
   );
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Survived] OptionalChaining
organisms/grid/column-group/GridColumnGroup.tsx:16:16
       {selectable && <col className="cl-grid-column cl-grid-column_first cl-grid-column_check" />}
       {columns.map((column, index) => (
         <col
-          key={column?.title}
+          key={column.title}
           className={getClassName([
             'cl-grid-column',

[Killed] ArrayDeclaration
organisms/grid/column-group/GridColumnGroup.tsx:17:35
       {columns.map((column, index) => (
         <col
           key={column?.title}
-          className={getClassName([
-            'cl-grid-column',
-            column?.className,
-            {
-              'cl-grid-column_first': index === 0 && !selectable,
-              'cl-grid-column_highlighted': !!column?.highlighted,
-            },
-          ])}
+          className={getClassName([])}
         />
       ))}
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Survived] OptionalChaining
organisms/grid/column-group/GridColumnGroup.tsx:19:13
           key={column?.title}
           className={getClassName([
             'cl-grid-column',
-            column?.className,
+            column.className,
             {
               'cl-grid-column_first': index === 0 && !selectable,

[Killed] ConditionalExpression
organisms/grid/column-group/GridColumnGroup.tsx:21:39
             'cl-grid-column',
             column?.className,
             {
-              'cl-grid-column_first': index === 0 && !selectable,
+              'cl-grid-column_first': true,
               'cl-grid-column_highlighted': !!column?.highlighted,
             },
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
organisms/grid/column-group/GridColumnGroup.tsx:21:54
             'cl-grid-column',
             column?.className,
             {
-              'cl-grid-column_first': index === 0 && !selectable,
+              'cl-grid-column_first': index === 0 && selectable,
               'cl-grid-column_highlighted': !!column?.highlighted,
             },
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
organisms/grid/column-group/GridColumnGroup.tsx:22:45
             column?.className,
             {
               'cl-grid-column_first': index === 0 && !selectable,
-              'cl-grid-column_highlighted': !!column?.highlighted,
+              'cl-grid-column_highlighted': !column?.highlighted,
             },
           ])}
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched
