[Killed] BlockStatement
organisms/grid/grid-row/GridRow.tsx:27:7
   values,
   selectedIds,
   disabled,
-}) => {
-  const selected = selectedIds.includes(rowId);
-
-  return (
-    <tr className={getClassName(['cl-grid-row', { 'cl-grid-row_selected': selected }])}>
-      {selectable && (
-        <SelectGridRowCell
-          rowId={rowId}
-          selectRowById={selectRowById}
-          deselectRowById={deselectRowById}
-          isRowSelected={selected}
-          disabled={disabled}
-        />
-      )}
-      {values.map((rowValue) => {
-        const valueKey = `cell-${rowId}-${rowValue.field}`;
-        return <GridDataCell key={valueKey} value={rowValue.value} />;
-      })}
-    </tr>
-  );
-};
+}) => {};
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] ArrayDeclaration
organisms/grid/grid-row/GridRow.tsx:31:33
   const selected = selectedIds.includes(rowId);
 
   return (
-    <tr className={getClassName(['cl-grid-row', { 'cl-grid-row_selected': selected }])}>
+    <tr className={getClassName([])}>
       {selectable && (
         <SelectGridRowCell
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/grid/grid-row/GridRow.tsx:32:8
 
   return (
     <tr className={getClassName(['cl-grid-row', { 'cl-grid-row_selected': selected }])}>
-      {selectable && (
-        <SelectGridRowCell
-          rowId={rowId}
-          selectRowById={selectRowById}
-          deselectRowById={deselectRowById}
-          isRowSelected={selected}
-          disabled={disabled}
-        />
-      )}
+      {false}
       {values.map((rowValue) => {
         const valueKey = `cell-${rowId}-${rowValue.field}`;
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/grid/grid-row/GridRow.tsx:32:8
 
   return (
     <tr className={getClassName(['cl-grid-row', { 'cl-grid-row_selected': selected }])}>
-      {selectable && (
-        <SelectGridRowCell
-          rowId={rowId}
-          selectRowById={selectRowById}
-          deselectRowById={deselectRowById}
-          isRowSelected={selected}
-          disabled={disabled}
-        />
-      )}
+      {true}
       {values.map((rowValue) => {
         const valueKey = `cell-${rowId}-${rowValue.field}`;
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] BlockStatement
organisms/grid/grid-row/GridRow.tsx:41:33
           disabled={disabled}
         />
       )}
-      {values.map((rowValue) => {
-        const valueKey = `cell-${rowId}-${rowValue.field}`;
-        return <GridDataCell key={valueKey} value={rowValue.value} />;
-      })}
+      {values.map((rowValue) => {})}
     </tr>
   );
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched
