[Killed] BooleanLiteral
organisms/grid/head/GridHead.tsx:25:27
   deselectAll,
   selectable,
   isAllSelected,
-  isAllCheckboxDisabled = false,
+  isAllCheckboxDisabled = true,
 }) => {
   return (
killedBy: GridHead should match the snapshot
statusReason: Snapshot `GridHead > should match the snapshot 1` mismatched

[Killed] BlockStatement
organisms/grid/head/GridHead.tsx:26:7
   selectable,
   isAllSelected,
   isAllCheckboxDisabled = false,
-}) => {
-  return (
-    <thead className="cl-grid-head">
-      <tr className="cl-grid-head__row">
-        {selectable && (
-          <SelectAllGridRowsCell
-            isAllSelected={isAllSelected}
-            disabled={isAllCheckboxDisabled}
-            gridId={gridId}
-            selectAll={selectAll}
-            deselectAll={deselectAll}
-          />
-        )}
-        {columns.map((column) => (
-          <GridHeaderCell
-            key={`${column.title}_${gridId}`}
-            title={column.title}
-            component={column.component}
-          />
-        ))}
-      </tr>
-    </thead>
-  );
-};
+}) => {};
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
organisms/grid/head/GridHead.tsx:30:10
   return (
     <thead className="cl-grid-head">
       <tr className="cl-grid-head__row">
-        {selectable && (
-          <SelectAllGridRowsCell
-            isAllSelected={isAllSelected}
-            disabled={isAllCheckboxDisabled}
-            gridId={gridId}
-            selectAll={selectAll}
-            deselectAll={deselectAll}
-          />
-        )}
+        {true}
         {columns.map((column) => (
           <GridHeaderCell
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] LogicalOperator
organisms/grid/head/GridHead.tsx:30:10
   return (
     <thead className="cl-grid-head">
       <tr className="cl-grid-head__row">
-        {selectable && (
-          <SelectAllGridRowsCell
-            isAllSelected={isAllSelected}
-            disabled={isAllCheckboxDisabled}
-            gridId={gridId}
-            selectAll={selectAll}
-            deselectAll={deselectAll}
-          />
-        )}
+        {selectable || <SelectAllGridRowsCell isAllSelected={isAllSelected} disabled={isAllCheckboxDisabled} gridId={gridId} selectAll={selectAll} deselectAll={deselectAll} />}
         {columns.map((column) => (
           <GridHeaderCell
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] ArrowFunction
organisms/grid/head/GridHead.tsx:39:22
             deselectAll={deselectAll}
           />
         )}
-        {columns.map((column) => (
-          <GridHeaderCell
-            key={`${column.title}_${gridId}`}
-            title={column.title}
-            component={column.component}
-          />
-        ))}
+        {columns.map(() => undefined)}
       </tr>
     </thead>
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched
