[Killed] BlockStatement
organisms/grid/header-cell/HeaderCell.tsx:6:7
 export const GridHeaderCell: FC<{ title?: string; component?: React.ReactElement }> = ({
   title,
   component,
-}) => {
-  return <th>{component ?? title ?? ''}</th>;
-};
+}) => {};
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] LogicalOperator
organisms/grid/header-cell/HeaderCell.tsx:7:15
   title,
   component,
 }) => {
-  return <th>{component ?? title ?? ''}</th>;
+  return <th>{(component ?? title) && ''}</th>;
 };
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] LogicalOperator
organisms/grid/header-cell/HeaderCell.tsx:7:15
   title,
   component,
 }) => {
-  return <th>{component ?? title ?? ''}</th>;
+  return <th>{component && title ?? ''}</th>;
 };
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched
