[Killed] BlockStatement
organisms/grid/select-all-grid-rows-cell/SelectAllGridRowsCell.tsx:19:7
   selectAll,
   deselectAll,
   disabled,
-}) => {
-  const handleSelectAll = (e: ChangeEvent<HTMLInputElement>) => {
-    const { checked } = e.target;
-    if (checked) {
-      selectAll();
-    } else {
-      deselectAll();
-    }
-  };
-
-  return (
-    <th>
-      <GridCheckbox
-        label="Select all rows"
-        onChange={handleSelectAll}
-        id={`select_all_${gridId}`}
-        checked={isAllSelected}
-        disabled={disabled}
-      />
-    </th>
-  );
-};
+}) => {};
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] BlockStatement
organisms/grid/select-all-grid-rows-cell/SelectAllGridRowsCell.tsx:20:65
   deselectAll,
   disabled,
 }) => {
-  const handleSelectAll = (e: ChangeEvent<HTMLInputElement>) => {
-    const { checked } = e.target;
-    if (checked) {
-      selectAll();
-    } else {
-      deselectAll();
-    }
-  };
+  const handleSelectAll = (e: ChangeEvent<HTMLInputElement>) => {};
 
   return (
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'row1', 'row2', 'row3', …(3) ] ]

Number of calls: 0

[Killed] BlockStatement
organisms/grid/select-all-grid-rows-cell/SelectAllGridRowsCell.tsx:22:18
 }) => {
   const handleSelectAll = (e: ChangeEvent<HTMLInputElement>) => {
     const { checked } = e.target;
-    if (checked) {
-      selectAll();
-    } else {
+    if (checked) {} else {
       deselectAll();
     }
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'row1', 'row2', 'row3', …(3) ] ]

Number of calls: 0

[Killed] ConditionalExpression
organisms/grid/select-all-grid-rows-cell/SelectAllGridRowsCell.tsx:22:9
 }) => {
   const handleSelectAll = (e: ChangeEvent<HTMLInputElement>) => {
     const { checked } = e.target;
-    if (checked) {
+    if (true) {
       selectAll();
     } else {
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [] ]

Received: 

  1st vi.fn() call:

  [
-   [],

[Killed] BlockStatement
organisms/grid/select-all-grid-rows-cell/SelectAllGridRowsCell.tsx:24:12
     const { checked } = e.target;
     if (checked) {
       selectAll();
-    } else {
-      deselectAll();
-    }
+    } else {}
   };
 
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [] ]

Received: 

  1st vi.fn() call:

  [
-   [],
