[Killed] BlockStatement
organisms/grid/select-grid-row-cell/SelectGridRowCell.tsx:19:7
   selectRowById,
   deselectRowById,
   disabled,
-}) => {
-  const handleSelectById = (e: ChangeEvent<HTMLInputElement>) => {
-    const { checked } = e.target;
-    if (checked) {
-      selectRowById(rowId);
-    } else {
-      deselectRowById(rowId);
-    }
-  };
-
-  return (
-    <td>
-      <GridCheckbox
-        label="Select row"
-        onChange={handleSelectById}
-        id={`select_row_${rowId}`}
-        checked={isRowSelected}
-        disabled={disabled}
-      />
-    </td>
-  );
-};
+}) => {};
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched

[Killed] BlockStatement
organisms/grid/select-grid-row-cell/SelectGridRowCell.tsx:20:66
   deselectRowById,
   disabled,
 }) => {
-  const handleSelectById = (e: ChangeEvent<HTMLInputElement>) => {
-    const { checked } = e.target;
-    if (checked) {
-      selectRowById(rowId);
-    } else {
-      deselectRowById(rowId);
-    }
-  };
+  const handleSelectById = (e: ChangeEvent<HTMLInputElement>) => {};
 
   return (
killedBy: Grid should call onSelect() handler when a checkbox is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'row1' ] ]

Received: 

  1st vi.fn() call:

  [
    [

[Killed] BlockStatement
organisms/grid/select-grid-row-cell/SelectGridRowCell.tsx:22:18
 }) => {
   const handleSelectById = (e: ChangeEvent<HTMLInputElement>) => {
     const { checked } = e.target;
-    if (checked) {
-      selectRowById(rowId);
-    } else {
+    if (checked) {} else {
       deselectRowById(rowId);
     }
killedBy: SelectGridRowCheckbox should call select handler
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
organisms/grid/select-grid-row-cell/SelectGridRowCell.tsx:24:12
     const { checked } = e.target;
     if (checked) {
       selectRowById(rowId);
-    } else {
-      deselectRowById(rowId);
-    }
+    } else {}
   };
 
killedBy: SelectGridRowCheckbox should call deselect handler
statusReason: expected "vi.fn()" to be called once, but got 0 times
