[Killed] BlockStatement
organisms/menu/leaf/MenuLeaf.tsx:19:66
     <span>{label}</span>
   );
 
-  const handleKeyDown = (e: React.KeyboardEvent<HTMLElement>) => {
-    e.stopPropagation();
-    if (e.key === 'Enter') {
-      onClick?.();
-    }
-  };
+  const handleKeyDown = (e: React.KeyboardEvent<HTMLElement>) => {};
 
   return (
killedBy: MenuLeaf keyboard interactions should stop event propagation on keydown
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      SyntheticBaseEvent {

[Survived] ConditionalExpression
organisms/menu/leaf/MenuLeaf.tsx:21:9
 
   const handleKeyDown = (e: React.KeyboardEvent<HTMLElement>) => {
     e.stopPropagation();
-    if (e.key === 'Enter') {
+    if (false) {
       onClick?.();
     }

[Survived] EqualityOperator
organisms/menu/leaf/MenuLeaf.tsx:21:9
 
   const handleKeyDown = (e: React.KeyboardEvent<HTMLElement>) => {
     e.stopPropagation();
-    if (e.key === 'Enter') {
+    if (e.key !== 'Enter') {
       onClick?.();
     }

[Survived] OptionalChaining
organisms/menu/leaf/MenuLeaf.tsx:22:7
   const handleKeyDown = (e: React.KeyboardEvent<HTMLElement>) => {
     e.stopPropagation();
     if (e.key === 'Enter') {
-      onClick?.();
+      onClick();
     }
   };
