[Killed] BlockStatement
organisms/tabs/content/TabContent.tsx:11:81
   selectedTabId: string;
   extendable?: boolean;
   extendedTabContent?: ReactElement;
-}> = ({ tabs, selectedTabId, extendable, extendedTabContent }): ReactElement => {
-  const content = tabs.find((item) => item.id === selectedTabId)?.content;
-  const contentId = `tabpanel_${selectedTabId}`;
-  const isExtendedTab = extendable && !content;
-
-  return (
-    <div
-      role="tabpanel"
-      data-testid="tab-content"
-      aria-labelledby={selectedTabId}
-      id={contentId}
-      className="cl-tab-content"
-    >
-      {isExtendedTab ? extendedTabContent : content}
-    </div>
-  );
-};
+}> = ({ tabs, selectedTabId, extendable, extendedTabContent }): ReactElement => {};
 
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] EqualityOperator
organisms/tabs/content/TabContent.tsx:12:39
   extendable?: boolean;
   extendedTabContent?: ReactElement;
 }> = ({ tabs, selectedTabId, extendable, extendedTabContent }): ReactElement => {
-  const content = tabs.find((item) => item.id === selectedTabId)?.content;
+  const content = tabs.find((item) => item.id !== selectedTabId)?.content;
   const contentId = `tabpanel_${selectedTabId}`;
   const isExtendedTab = extendable && !content;
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ArrowFunction
organisms/tabs/content/TabContent.tsx:12:29
   extendable?: boolean;
   extendedTabContent?: ReactElement;
 }> = ({ tabs, selectedTabId, extendable, extendedTabContent }): ReactElement => {
-  const content = tabs.find((item) => item.id === selectedTabId)?.content;
+  const content = tabs.find(() => undefined)?.content;
   const contentId = `tabpanel_${selectedTabId}`;
   const isExtendedTab = extendable && !content;
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] BooleanLiteral
organisms/tabs/content/TabContent.tsx:14:39
 }> = ({ tabs, selectedTabId, extendable, extendedTabContent }): ReactElement => {
   const content = tabs.find((item) => item.id === selectedTabId)?.content;
   const contentId = `tabpanel_${selectedTabId}`;
-  const isExtendedTab = extendable && !content;
+  const isExtendedTab = extendable && content;
 
   return (
killedBy: TabContent renders extended tab content when extendable is true and no content found
statusReason: Unable to find an element by: [data-testid="extended-content"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-labelledby="nonexistent-tab"
      class="cl-tab-content"

[Killed] LogicalOperator
organisms/tabs/content/TabContent.tsx:14:25
 }> = ({ tabs, selectedTabId, extendable, extendedTabContent }): ReactElement => {
   const content = tabs.find((item) => item.id === selectedTabId)?.content;
   const contentId = `tabpanel_${selectedTabId}`;
-  const isExtendedTab = extendable && !content;
+  const isExtendedTab = extendable || !content;
 
   return (
killedBy: TabContent renders regular content when extendable is true but content exists
statusReason: Unable to find an element by: [data-testid="tab2-content"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-labelledby="tab2"
      class="cl-tab-content"
