[Survived] BlockStatement
organisms/tabs/edit-input/TabEditInput.tsx:34:41
 
   // Focus input when entering edit mode
   useEffect(() => {
-    if (isEditMode && inputRef.current) {
-      inputRef.current.focus();
-      inputRef.current.select();
-    }
+    if (isEditMode && inputRef.current) {}
   }, [isEditMode]);
 

[Survived] ConditionalExpression
organisms/tabs/edit-input/TabEditInput.tsx:34:9
 
   // Focus input when entering edit mode
   useEffect(() => {
-    if (isEditMode && inputRef.current) {
+    if (false) {
       inputRef.current.focus();
       inputRef.current.select();

[Survived] ArrayDeclaration
organisms/tabs/edit-input/TabEditInput.tsx:38:6
       inputRef.current.focus();
       inputRef.current.select();
     }
-  }, [isEditMode]);
+  }, []);
 
   return (
