[Killed] BlockStatement
src/hooks/use-click-outside/use-click-outside.ts:13:36
   ref,
   onClickOutsideHandler,
   dependentRef,
-}: UseClickOutsideParams): void => {
-  useEffect(() => {
-    const handleClickOutside = (event: MouseEvent) => {
-      const isOutsideRef = ref?.current && !ref.current.contains(event.target as Node);
-      const hasNoDependentRef = !dependentRef?.current;
-      const isOutsideDependentRef = hasNoDependentRef
-        ? true
-        : !dependentRef?.current?.contains(event.target as Node);
-      if (isOutsideRef && isOutsideDependentRef) {
-        onClickOutsideHandler();
-      }
-    };
-
-    document.addEventListener('mousedown', handleClickOutside);
-    return () => {
-      document.removeEventListener('mousedown', handleClickOutside);
-    };
-  }, [ref, dependentRef, onClickOutsideHandler]);
-};
+}: UseClickOutsideParams): void => {};
 
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] BlockStatement
src/hooks/use-click-outside/use-click-outside.ts:14:19
   onClickOutsideHandler,
   dependentRef,
 }: UseClickOutsideParams): void => {
-  useEffect(() => {
-    const handleClickOutside = (event: MouseEvent) => {
-      const isOutsideRef = ref?.current && !ref.current.contains(event.target as Node);
-      const hasNoDependentRef = !dependentRef?.current;
-      const isOutsideDependentRef = hasNoDependentRef
-        ? true
-        : !dependentRef?.current?.contains(event.target as Node);
-      if (isOutsideRef && isOutsideDependentRef) {
-        onClickOutsideHandler();
-      }
-    };
-
-    document.addEventListener('mousedown', handleClickOutside);
-    return () => {
-      document.removeEventListener('mousedown', handleClickOutside);
-    };
-  }, [ref, dependentRef, onClickOutsideHandler]);
+  useEffect(() => {}, [ref, dependentRef, onClickOutsideHandler]);
 };
 
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] BlockStatement
src/hooks/use-click-outside/use-click-outside.ts:15:55
   dependentRef,
 }: UseClickOutsideParams): void => {
   useEffect(() => {
-    const handleClickOutside = (event: MouseEvent) => {
-      const isOutsideRef = ref?.current && !ref.current.contains(event.target as Node);
-      const hasNoDependentRef = !dependentRef?.current;
-      const isOutsideDependentRef = hasNoDependentRef
-        ? true
-        : !dependentRef?.current?.contains(event.target as Node);
-      if (isOutsideRef && isOutsideDependentRef) {
-        onClickOutsideHandler();
-      }
-    };
+    const handleClickOutside = (event: MouseEvent) => {};
 
     document.addEventListener('mousedown', handleClickOutside);
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] ConditionalExpression
src/hooks/use-click-outside/use-click-outside.ts:16:28
 }: UseClickOutsideParams): void => {
   useEffect(() => {
     const handleClickOutside = (event: MouseEvent) => {
-      const isOutsideRef = ref?.current && !ref.current.contains(event.target as Node);
+      const isOutsideRef = true;
       const hasNoDependentRef = !dependentRef?.current;
       const isOutsideDependentRef = hasNoDependentRef
killedBy: useClickOutside tests: should not call onClickOutsideHandler when clicking inside the ref element
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[Killed] LogicalOperator
src/hooks/use-click-outside/use-click-outside.ts:16:28
 }: UseClickOutsideParams): void => {
   useEffect(() => {
     const handleClickOutside = (event: MouseEvent) => {
-      const isOutsideRef = ref?.current && !ref.current.contains(event.target as Node);
+      const isOutsideRef = ref?.current || !ref.current.contains(event.target as Node);
       const hasNoDependentRef = !dependentRef?.current;
       const isOutsideDependentRef = hasNoDependentRef
killedBy: useClickOutside tests: should not call onClickOutsideHandler when clicking inside the ref element
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[Killed] BooleanLiteral
src/hooks/use-click-outside/use-click-outside.ts:17:33
   useEffect(() => {
     const handleClickOutside = (event: MouseEvent) => {
       const isOutsideRef = ref?.current && !ref.current.contains(event.target as Node);
-      const hasNoDependentRef = !dependentRef?.current;
+      const hasNoDependentRef = dependentRef?.current;
       const isOutsideDependentRef = hasNoDependentRef
         ? true
killedBy: Tooltip should show and hide tooltip on click
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Survived] BooleanLiteral
src/hooks/use-click-outside/use-click-outside.ts:19:11
       const isOutsideRef = ref?.current && !ref.current.contains(event.target as Node);
       const hasNoDependentRef = !dependentRef?.current;
       const isOutsideDependentRef = hasNoDependentRef
-        ? true
+        ? false
         : !dependentRef?.current?.contains(event.target as Node);
       if (isOutsideRef && isOutsideDependentRef) {

[Killed] BooleanLiteral
src/hooks/use-click-outside/use-click-outside.ts:20:11
       const hasNoDependentRef = !dependentRef?.current;
       const isOutsideDependentRef = hasNoDependentRef
         ? true
-        : !dependentRef?.current?.contains(event.target as Node);
+        : dependentRef?.current?.contains(event.target as Node);
       if (isOutsideRef && isOutsideDependentRef) {
         onClickOutsideHandler();
killedBy: Tooltip should show and hide tooltip on click
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Survived] OptionalChaining
src/hooks/use-click-outside/use-click-outside.ts:20:12
       const hasNoDependentRef = !dependentRef?.current;
       const isOutsideDependentRef = hasNoDependentRef
         ? true
-        : !dependentRef?.current?.contains(event.target as Node);
+        : !dependentRef?.current.contains(event.target as Node);
       if (isOutsideRef && isOutsideDependentRef) {
         onClickOutsideHandler();

[Killed] ConditionalExpression
src/hooks/use-click-outside/use-click-outside.ts:21:11
       const isOutsideDependentRef = hasNoDependentRef
         ? true
         : !dependentRef?.current?.contains(event.target as Node);
-      if (isOutsideRef && isOutsideDependentRef) {
+      if (false) {
         onClickOutsideHandler();
       }
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] BlockStatement
src/hooks/use-click-outside/use-click-outside.ts:21:50
       const isOutsideDependentRef = hasNoDependentRef
         ? true
         : !dependentRef?.current?.contains(event.target as Node);
-      if (isOutsideRef && isOutsideDependentRef) {
-        onClickOutsideHandler();
-      }
+      if (isOutsideRef && isOutsideDependentRef) {}
     };
 
killedBy: Tooltip should show and hide tooltip on contextmenu
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Survived] BlockStatement
src/hooks/use-click-outside/use-click-outside.ts:27:18
     };
 
     document.addEventListener('mousedown', handleClickOutside);
-    return () => {
-      document.removeEventListener('mousedown', handleClickOutside);
-    };
+    return () => {};
   }, [ref, dependentRef, onClickOutsideHandler]);
 };
