[Killed] BlockStatement
src/hooks/use-container-dimensions/use-container-dimensions.ts:12:49
 export const useContainerDimensions = ({
   ref,
   isVisible,
-}: useContainerDimensionsParams): Dimensions => {
-  const [dimensions, setDimensions] = useState<Dimensions>({ width: 0, height: 0 });
-
-  useEffect(() => {
-    if (ref?.current && isVisible) {
-      setDimensions({
-        width: ref.current.offsetWidth,
-        height: ref.current.offsetHeight,
-      });
-    }
-  }, [ref, isVisible]);
-
-  return dimensions;
-};
+}: useContainerDimensionsParams): Dimensions => {};
 
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Cannot destructure property 'width' of '(0 , __vite_ssr_import_1__.useContainerDimensions)(...)' as it is undefined.

[Killed] BlockStatement
src/hooks/use-container-dimensions/use-container-dimensions.ts:15:19
 }: useContainerDimensionsParams): Dimensions => {
   const [dimensions, setDimensions] = useState<Dimensions>({ width: 0, height: 0 });
 
-  useEffect(() => {
-    if (ref?.current && isVisible) {
-      setDimensions({
-        width: ref.current.offsetWidth,
-        height: ref.current.offsetHeight,
-      });
-    }
-  }, [ref, isVisible]);
+  useEffect(() => {}, [ref, isVisible]);
 
   return dimensions;
killedBy: useTooltipPosition should set up and clean up ResizeObserver when opened
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/hooks/use-container-dimensions/use-container-dimensions.ts:16:9
   const [dimensions, setDimensions] = useState<Dimensions>({ width: 0, height: 0 });
 
   useEffect(() => {
-    if (ref?.current && isVisible) {
+    if (true) {
       setDimensions({
         width: ref.current.offsetWidth,
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Cannot read properties of null (reading 'offsetWidth')

[Killed] ConditionalExpression
src/hooks/use-container-dimensions/use-container-dimensions.ts:16:9
   const [dimensions, setDimensions] = useState<Dimensions>({ width: 0, height: 0 });
 
   useEffect(() => {
-    if (ref?.current && isVisible) {
+    if (false) {
       setDimensions({
         width: ref.current.offsetWidth,
killedBy: useContainerDimensions returns dimensions when ref and isVisible are provided
statusReason: expected { width: +0, height: +0 } to deeply equal { width: 200, height: 100 }

[Killed] ArrayDeclaration
src/hooks/use-container-dimensions/use-container-dimensions.ts:22:6
         height: ref.current.offsetHeight,
       });
     }
-  }, [ref, isVisible]);
+  }, []);
 
   return dimensions;
killedBy: useContainerDimensions updates dimensions when isVisible changes from false to true
statusReason: expected { width: +0, height: +0 } to deeply equal { width: 300, height: 150 }
