[Killed] BlockStatement
src/hooks/use-element-ids/use-element-ids.ts:3:44
 import { useId } from 'react';
 
-export function useElementIds(id?: string) {
-  const randomId = useId();
-  const elementId = id ?? randomId;
-  const errorId = `${elementId}_error`;
-  const dropdownId = `${elementId}_dropdown`;
-
-  return {
-    elementId,
-    errorId,
-    dropdownId,
-  };
-}
+export function useElementIds(id?: string) {}
 
killedBy: Form should not render Reset button is hasReset props is false
statusReason: Cannot destructure property 'elementId' of '(0 , __vite_ssr_import_2__.useElementIds)(...)' as it is undefined.

[Killed] LogicalOperator
src/hooks/use-element-ids/use-element-ids.ts:5:21
 
 export function useElementIds(id?: string) {
   const randomId = useId();
-  const elementId = id ?? randomId;
+  const elementId = id && randomId;
   const errorId = `${elementId}_error`;
   const dropdownId = `${elementId}_dropdown`;
killedBy: SelectGridRowCheckbox should match the snapshot
statusReason: Snapshot `SelectGridRowCheckbox > should match the snapshot 1` mismatched
