[Killed] BooleanLiteral
src/hooks/use-is-hovered/use-is-hovered.ts:4:78
 import type { RefObject } from 'react';
 import { useEffect, useState } from 'react';
 
-export function useIsHovered(ref: RefObject<HTMLElement | null>, isMounted = true) {
+export function useIsHovered(ref: RefObject<HTMLElement | null>, isMounted = false) {
   const [isHovered, setIsHovered] = useState(false);
 
killedBy: useIsHovered returns true on mouseenter
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div />

[Killed] BlockStatement
src/hooks/use-is-hovered/use-is-hovered.ts:4:84
 import type { RefObject } from 'react';
 import { useEffect, useState } from 'react';
 
-export function useIsHovered(ref: RefObject<HTMLElement | null>, isMounted = true) {
-  const [isHovered, setIsHovered] = useState(false);
-
-  useEffect(() => {
-    const element = ref.current;
-    if (!element || !isMounted) return;
-
-    const handleMouseEnter = () => setIsHovered(true);
-    const handleMouseLeave = () => setIsHovered(false);
-
-    element.addEventListener('mouseenter', handleMouseEnter);
-    element.addEventListener('mouseleave', handleMouseLeave);
-
-    return () => {
-      element.removeEventListener('mouseenter', handleMouseEnter);
-      element.removeEventListener('mouseleave', handleMouseLeave);
-    };
-  }, [ref, isMounted]);
-
-  return isHovered;
-}
+export function useIsHovered(ref: RefObject<HTMLElement | null>, isMounted = true) {}
 
killedBy: useIsHovered returns false initially
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/use-is-hovered/use-is-hovered.ts:5:46
 import { useEffect, useState } from 'react';
 
 export function useIsHovered(ref: RefObject<HTMLElement | null>, isMounted = true) {
-  const [isHovered, setIsHovered] = useState(false);
+  const [isHovered, setIsHovered] = useState(true);
 
   useEffect(() => {
killedBy: Alert should update progress bar value over time
statusReason: expected 100 to be less than 100

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div>

[Killed] BlockStatement
src/hooks/use-is-hovered/use-is-hovered.ts:7:19
 export function useIsHovered(ref: RefObject<HTMLElement | null>, isMounted = true) {
   const [isHovered, setIsHovered] = useState(false);
 
-  useEffect(() => {
-    const element = ref.current;
-    if (!element || !isMounted) return;
-
-    const handleMouseEnter = () => setIsHovered(true);
-    const handleMouseLeave = () => setIsHovered(false);
-
-    element.addEventListener('mouseenter', handleMouseEnter);
-    element.addEventListener('mouseleave', handleMouseLeave);
-
-    return () => {
-      element.removeEventListener('mouseenter', handleMouseEnter);
-      element.removeEventListener('mouseleave', handleMouseLeave);
-    };
-  }, [ref, isMounted]);
+  useEffect(() => {}, [ref, isMounted]);
 
   return isHovered;
killedBy: useIsHovered returns true on mouseenter
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div />

[Killed] ConditionalExpression
src/hooks/use-is-hovered/use-is-hovered.ts:9:9
 
   useEffect(() => {
     const element = ref.current;
-    if (!element || !isMounted) return;
+    if (false) return;
 
     const handleMouseEnter = () => setIsHovered(true);
killedBy: useIsHovered handles null ref
statusReason: Cannot read properties of null (reading 'addEventListener')

[Killed] ConditionalExpression
src/hooks/use-is-hovered/use-is-hovered.ts:9:9
 
   useEffect(() => {
     const element = ref.current;
-    if (!element || !isMounted) return;
+    if (true) return;
 
     const handleMouseEnter = () => setIsHovered(true);
killedBy: useIsHovered returns true on mouseenter
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div />

[Killed] ArrowFunction
src/hooks/use-is-hovered/use-is-hovered.ts:11:30
     const element = ref.current;
     if (!element || !isMounted) return;
 
-    const handleMouseEnter = () => setIsHovered(true);
+    const handleMouseEnter = () => undefined;
     const handleMouseLeave = () => setIsHovered(false);
 
killedBy: useIsHovered returns true on mouseenter
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div />

[Killed] BooleanLiteral
src/hooks/use-is-hovered/use-is-hovered.ts:11:49
     const element = ref.current;
     if (!element || !isMounted) return;
 
-    const handleMouseEnter = () => setIsHovered(true);
+    const handleMouseEnter = () => setIsHovered(false);
     const handleMouseLeave = () => setIsHovered(false);
 
killedBy: useIsHovered returns true on mouseenter
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div />

[Killed] BooleanLiteral
src/hooks/use-is-hovered/use-is-hovered.ts:12:49
     if (!element || !isMounted) return;
 
     const handleMouseEnter = () => setIsHovered(true);
-    const handleMouseLeave = () => setIsHovered(false);
+    const handleMouseLeave = () => setIsHovered(true);
 
     element.addEventListener('mouseenter', handleMouseEnter);
killedBy: useIsHovered returns false on mouseleave
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div />

[Killed] ArrowFunction
src/hooks/use-is-hovered/use-is-hovered.ts:12:30
     if (!element || !isMounted) return;
 
     const handleMouseEnter = () => setIsHovered(true);
-    const handleMouseLeave = () => setIsHovered(false);
+    const handleMouseLeave = () => undefined;
 
     element.addEventListener('mouseenter', handleMouseEnter);
killedBy: useIsHovered returns false on mouseleave
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
    <div />

[Killed] BlockStatement
src/hooks/use-is-hovered/use-is-hovered.ts:17:18
     element.addEventListener('mouseenter', handleMouseEnter);
     element.addEventListener('mouseleave', handleMouseLeave);
 
-    return () => {
-      element.removeEventListener('mouseenter', handleMouseEnter);
-      element.removeEventListener('mouseleave', handleMouseLeave);
-    };
+    return () => {};
   }, [ref, isMounted]);
 
killedBy: useIsHovered cleans up event listeners on unmount
statusReason: expected "removeEventListener" to be called with arguments: [ 'mouseenter', Any<Function> ]

Number of calls: 0

[Survived] ArrayDeclaration
src/hooks/use-is-hovered/use-is-hovered.ts:21:6
       element.removeEventListener('mouseenter', handleMouseEnter);
       element.removeEventListener('mouseleave', handleMouseLeave);
     };
-  }, [ref, isMounted]);
+  }, []);
 
   return isHovered;
