[Killed] BooleanLiteral
src/hooks/use-is-overflow/use-is-overflow.ts:12:48
   dimension: 'width' | 'height';
   isMounted?: boolean;
 }) => {
-  const [isOverflow, setIsOverflow] = useState(false);
+  const [isOverflow, setIsOverflow] = useState(true);
 
   useEffect(() => {
killedBy: useIsOverflow hook should not check overflow when isMounted is false
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/hooks/use-is-overflow/use-is-overflow.ts:14:19
 }) => {
   const [isOverflow, setIsOverflow] = useState(false);
 
-  useEffect(() => {
-    const checkIsOverflow = () => {
-      const { current } = ref;
-
-      if (current) {
-        if (dimension === 'width') {
-          const { scrollWidth = 0, clientWidth = 0 } = current as HTMLElement;
-          setIsOverflow(scrollWidth > clientWidth);
-        }
-
-        if (dimension === 'height') {
-          const { scrollHeight = 0, clientHeight = 0 } = current as HTMLElement;
-          setIsOverflow(scrollHeight > clientHeight);
-        }
-      }
-    };
-
-    if (isMounted) {
-      checkIsOverflow();
-    }
-
-    window.addEventListener('resize', checkIsOverflow);
-
-    return () => window.removeEventListener('resize', checkIsOverflow);
-  }, [ref, dimension, isMounted]);
+  useEffect(() => {}, [ref, dimension, isMounted]);
 
   return isOverflow;
killedBy: useIsOverflow hook should return true when element is overflowed (width)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/use-is-overflow/use-is-overflow.ts:15:35
   const [isOverflow, setIsOverflow] = useState(false);
 
   useEffect(() => {
-    const checkIsOverflow = () => {
-      const { current } = ref;
-
-      if (current) {
-        if (dimension === 'width') {
-          const { scrollWidth = 0, clientWidth = 0 } = current as HTMLElement;
-          setIsOverflow(scrollWidth > clientWidth);
-        }
-
-        if (dimension === 'height') {
-          const { scrollHeight = 0, clientHeight = 0 } = current as HTMLElement;
-          setIsOverflow(scrollHeight > clientHeight);
-        }
-      }
-    };
+    const checkIsOverflow = () => {};
 
     if (isMounted) {
killedBy: useIsOverflow hook should return true when element is overflowed (width)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-is-overflow/use-is-overflow.ts:18:11
     const checkIsOverflow = () => {
       const { current } = ref;
 
-      if (current) {
+      if (false) {
         if (dimension === 'width') {
           const { scrollWidth = 0, clientWidth = 0 } = current as HTMLElement;
killedBy: useIsOverflow hook should return true when element is overflowed (width)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/use-is-overflow/use-is-overflow.ts:18:20
     const checkIsOverflow = () => {
       const { current } = ref;
 
-      if (current) {
-        if (dimension === 'width') {
-          const { scrollWidth = 0, clientWidth = 0 } = current as HTMLElement;
-          setIsOverflow(scrollWidth > clientWidth);
-        }
-
-        if (dimension === 'height') {
-          const { scrollHeight = 0, clientHeight = 0 } = current as HTMLElement;
-          setIsOverflow(scrollHeight > clientHeight);
-        }
-      }
+      if (current) {}
     };
 
killedBy: useIsOverflow hook should return true when element is overflowed (width)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/use-is-overflow/use-is-overflow.ts:19:36
       const { current } = ref;
 
       if (current) {
-        if (dimension === 'width') {
-          const { scrollWidth = 0, clientWidth = 0 } = current as HTMLElement;
-          setIsOverflow(scrollWidth > clientWidth);
-        }
+        if (dimension === 'width') {}
 
         if (dimension === 'height') {
killedBy: useIsOverflow hook should return true when element is overflowed (width)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-is-overflow/use-is-overflow.ts:19:13
       const { current } = ref;
 
       if (current) {
-        if (dimension === 'width') {
+        if (false) {
           const { scrollWidth = 0, clientWidth = 0 } = current as HTMLElement;
           setIsOverflow(scrollWidth > clientWidth);
killedBy: useIsOverflow hook should return true when element is overflowed (width)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/hooks/use-is-overflow/use-is-overflow.ts:21:25
       if (current) {
         if (dimension === 'width') {
           const { scrollWidth = 0, clientWidth = 0 } = current as HTMLElement;
-          setIsOverflow(scrollWidth > clientWidth);
+          setIsOverflow(scrollWidth <= clientWidth);
         }
 
killedBy: useIsOverflow hook should return false when element is not overflowed (width)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-is-overflow/use-is-overflow.ts:21:25
       if (current) {
         if (dimension === 'width') {
           const { scrollWidth = 0, clientWidth = 0 } = current as HTMLElement;
-          setIsOverflow(scrollWidth > clientWidth);
+          setIsOverflow(false);
         }
 
killedBy: useIsOverflow hook should return true when element is overflowed (width)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/hooks/use-is-overflow/use-is-overflow.ts:24:13
           setIsOverflow(scrollWidth > clientWidth);
         }
 
-        if (dimension === 'height') {
+        if (dimension !== 'height') {
           const { scrollHeight = 0, clientHeight = 0 } = current as HTMLElement;
           setIsOverflow(scrollHeight > clientHeight);
killedBy: useIsOverflow hook should return true when element is overflowed (height)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-is-overflow/use-is-overflow.ts:24:13
           setIsOverflow(scrollWidth > clientWidth);
         }
 
-        if (dimension === 'height') {
+        if (false) {
           const { scrollHeight = 0, clientHeight = 0 } = current as HTMLElement;
           setIsOverflow(scrollHeight > clientHeight);
killedBy: useIsOverflow hook should return true when element is overflowed (height)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/hooks/use-is-overflow/use-is-overflow.ts:26:25
 
         if (dimension === 'height') {
           const { scrollHeight = 0, clientHeight = 0 } = current as HTMLElement;
-          setIsOverflow(scrollHeight > clientHeight);
+          setIsOverflow(scrollHeight <= clientHeight);
         }
       }
killedBy: useIsOverflow hook should return false when element is not overflowed (height)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-is-overflow/use-is-overflow.ts:26:25
 
         if (dimension === 'height') {
           const { scrollHeight = 0, clientHeight = 0 } = current as HTMLElement;
-          setIsOverflow(scrollHeight > clientHeight);
+          setIsOverflow(true);
         }
       }
killedBy: useIsOverflow hook should return false when element is not overflowed (height)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-is-overflow/use-is-overflow.ts:31:9
       }
     };
 
-    if (isMounted) {
+    if (true) {
       checkIsOverflow();
     }
killedBy: useIsOverflow hook should not check overflow when isMounted is false
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/hooks/use-is-overflow/use-is-overflow.ts:31:20
       }
     };
 
-    if (isMounted) {
-      checkIsOverflow();
-    }
+    if (isMounted) {}
 
     window.addEventListener('resize', checkIsOverflow);
killedBy: useIsOverflow hook should return true when element is overflowed (width)
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/hooks/use-is-overflow/use-is-overflow.ts:37:12
 
     window.addEventListener('resize', checkIsOverflow);
 
-    return () => window.removeEventListener('resize', checkIsOverflow);
+    return () => undefined;
   }, [ref, dimension, isMounted]);
 
killedBy: useIsOverflow hook should add and remove resize event listener
statusReason: expected "vi.fn()" to be called with arguments: [ 'resize', Any<Function> ]

Number of calls: 0

[Survived] ArrayDeclaration
src/hooks/use-is-overflow/use-is-overflow.ts:38:6
     window.addEventListener('resize', checkIsOverflow);
 
     return () => window.removeEventListener('resize', checkIsOverflow);
-  }, [ref, dimension, isMounted]);
+  }, []);
 
   return isOverflow;
