[Killed] BlockStatement
src/hooks/use-key-press/use-key-press.ts:9:81
   onKeyPress: () => void;
 };
 
-export const useKeyPress = ({ ref, keyCode, onKeyPress }: useKeyPressParams) => {
-  useEffect(() => {
-    const handleKeyPress = (e: KeyboardEvent) => {
-      if (e?.code === keyCode && ref?.current) {
-        onKeyPress();
-      }
-    };
-
-    document.addEventListener('keydown', handleKeyPress, false);
-    return () => {
-      document.removeEventListener('keydown', handleKeyPress, false);
-    };
-  }, [ref, keyCode, onKeyPress]);
-};
+export const useKeyPress = ({ ref, keyCode, onKeyPress }: useKeyPressParams) => {};
 
killedBy: Tooltip should close tooltip on Escape key press
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] BlockStatement
src/hooks/use-key-press/use-key-press.ts:10:19
 };
 
 export const useKeyPress = ({ ref, keyCode, onKeyPress }: useKeyPressParams) => {
-  useEffect(() => {
-    const handleKeyPress = (e: KeyboardEvent) => {
-      if (e?.code === keyCode && ref?.current) {
-        onKeyPress();
-      }
-    };
-
-    document.addEventListener('keydown', handleKeyPress, false);
-    return () => {
-      document.removeEventListener('keydown', handleKeyPress, false);
-    };
-  }, [ref, keyCode, onKeyPress]);
+  useEffect(() => {}, [ref, keyCode, onKeyPress]);
 };
 
killedBy: Tooltip should close tooltip on Escape key press
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] BlockStatement
src/hooks/use-key-press/use-key-press.ts:11:50
 
 export const useKeyPress = ({ ref, keyCode, onKeyPress }: useKeyPressParams) => {
   useEffect(() => {
-    const handleKeyPress = (e: KeyboardEvent) => {
-      if (e?.code === keyCode && ref?.current) {
-        onKeyPress();
-      }
-    };
+    const handleKeyPress = (e: KeyboardEvent) => {};
 
     document.addEventListener('keydown', handleKeyPress, false);
killedBy: Tooltip should close tooltip on Escape key press
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-tooltip"
  id="test-tooltip-id"
  role="tooltip"
  style="top: 4px; left: 0px;"
>

[Killed] LogicalOperator
src/hooks/use-key-press/use-key-press.ts:12:11
 export const useKeyPress = ({ ref, keyCode, onKeyPress }: useKeyPressParams) => {
   useEffect(() => {
     const handleKeyPress = (e: KeyboardEvent) => {
-      if (e?.code === keyCode && ref?.current) {
+      if (e?.code === keyCode || ref?.current) {
         onKeyPress();
       }
killedBy: useKeyPress  tests: should not call onKeyPress handler when a different key is pressed
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[Killed] ConditionalExpression
src/hooks/use-key-press/use-key-press.ts:12:11
 export const useKeyPress = ({ ref, keyCode, onKeyPress }: useKeyPressParams) => {
   useEffect(() => {
     const handleKeyPress = (e: KeyboardEvent) => {
-      if (e?.code === keyCode && ref?.current) {
+      if (true) {
         onKeyPress();
       }
killedBy: useKeyPress  tests: should not call onKeyPress handler when a different key is pressed
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[Survived] BooleanLiteral
src/hooks/use-key-press/use-key-press.ts:17:58
       }
     };
 
-    document.addEventListener('keydown', handleKeyPress, false);
+    document.addEventListener('keydown', handleKeyPress, true);
     return () => {
       document.removeEventListener('keydown', handleKeyPress, false);

[Survived] BlockStatement
src/hooks/use-key-press/use-key-press.ts:18:18
     };
 
     document.addEventListener('keydown', handleKeyPress, false);
-    return () => {
-      document.removeEventListener('keydown', handleKeyPress, false);
-    };
+    return () => {};
   }, [ref, keyCode, onKeyPress]);
 };

[Survived] BooleanLiteral
src/hooks/use-key-press/use-key-press.ts:19:63
 
     document.addEventListener('keydown', handleKeyPress, false);
     return () => {
-      document.removeEventListener('keydown', handleKeyPress, false);
+      document.removeEventListener('keydown', handleKeyPress, true);
     };
   }, [ref, keyCode, onKeyPress]);

[Survived] ArrayDeclaration
src/hooks/use-key-press/use-key-press.ts:21:6
     return () => {
       document.removeEventListener('keydown', handleKeyPress, false);
     };
-  }, [ref, keyCode, onKeyPress]);
+  }, []);
 };
 
