[Killed] LogicalOperator
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:11:9
 export const useModalFocusTrap = ({ modalRef, isOpened }: ModalFocusTrapParams) => {
   useEffect(() => {
     const modalElement = modalRef.current;
-    if (!isOpened || !modalElement) return;
+    if (!isOpened && !modalElement) return;
 
     const focusableElements = Array.from(
killedBy: Dialog should render the dialog correctly after a delay
statusReason: Cannot read properties of null (reading 'querySelectorAll')

[Killed] ConditionalExpression
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:11:9
 export const useModalFocusTrap = ({ modalRef, isOpened }: ModalFocusTrapParams) => {
   useEffect(() => {
     const modalElement = modalRef.current;
-    if (!isOpened || !modalElement) return;
+    if (false) return;
 
     const focusableElements = Array.from(
killedBy: Dialog should render the dialog correctly after a delay
statusReason: Cannot read properties of null (reading 'querySelectorAll')

[Killed] BlockStatement
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:21:57
     const firstElement = focusableElements[0] as HTMLElement;
     const lastElement = focusableElements.at(-1) as HTMLElement;
 
-    const handleTabKeyPress = (event: KeyboardEvent) => {
-      if (event.key === 'Tab') {
-        if (event.shiftKey && document.activeElement === firstElement) {
-          event.preventDefault();
-          lastElement.focus();
-        } else if (!event.shiftKey && document.activeElement === lastElement) {
-          event.preventDefault();
-          firstElement.focus();
-        }
-      }
-    };
+    const handleTabKeyPress = (event: KeyboardEvent) => {};
 
     modalElement.addEventListener('keydown', handleTabKeyPress);
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <body><div><div>…(3)</div></div></body> to be <button type="button"></button> // Object.is equality

[Killed] BlockStatement
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:22:32
     const lastElement = focusableElements.at(-1) as HTMLElement;
 
     const handleTabKeyPress = (event: KeyboardEvent) => {
-      if (event.key === 'Tab') {
-        if (event.shiftKey && document.activeElement === firstElement) {
-          event.preventDefault();
-          lastElement.focus();
-        } else if (!event.shiftKey && document.activeElement === lastElement) {
-          event.preventDefault();
-          firstElement.focus();
-        }
-      }
+      if (event.key === 'Tab') {}
     };
 
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <body><div><div>…(3)</div></div></body> to be <button type="button"></button> // Object.is equality

[Killed] EqualityOperator
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:22:11
     const lastElement = focusableElements.at(-1) as HTMLElement;
 
     const handleTabKeyPress = (event: KeyboardEvent) => {
-      if (event.key === 'Tab') {
+      if (event.key !== 'Tab') {
         if (event.shiftKey && document.activeElement === firstElement) {
           event.preventDefault();
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <body><div><div>…(3)</div></div></body> to be <button type="button"></button> // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:23:31
 
     const handleTabKeyPress = (event: KeyboardEvent) => {
       if (event.key === 'Tab') {
-        if (event.shiftKey && document.activeElement === firstElement) {
+        if (event.shiftKey && true) {
           event.preventDefault();
           lastElement.focus();
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <button type="button"></button> to be <button type="button"></button> // Object.is equality

[Killed] BlockStatement
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:23:72
 
     const handleTabKeyPress = (event: KeyboardEvent) => {
       if (event.key === 'Tab') {
-        if (event.shiftKey && document.activeElement === firstElement) {
-          event.preventDefault();
-          lastElement.focus();
-        } else if (!event.shiftKey && document.activeElement === lastElement) {
+        if (event.shiftKey && document.activeElement === firstElement) {} else if (!event.shiftKey && document.activeElement === lastElement) {
           event.preventDefault();
           firstElement.focus();
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <body><div><div>…(3)</div></div></body> to be <button type="button"></button> // Object.is equality

[Killed] BooleanLiteral
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:26:20
         if (event.shiftKey && document.activeElement === firstElement) {
           event.preventDefault();
           lastElement.focus();
-        } else if (!event.shiftKey && document.activeElement === lastElement) {
+        } else if (event.shiftKey && document.activeElement === lastElement) {
           event.preventDefault();
           firstElement.focus();
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <body><div><div>…(3)</div></div></body> to be <button type="button"></button> // Object.is equality

[Killed] LogicalOperator
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:26:20
         if (event.shiftKey && document.activeElement === firstElement) {
           event.preventDefault();
           lastElement.focus();
-        } else if (!event.shiftKey && document.activeElement === lastElement) {
+        } else if (!event.shiftKey || document.activeElement === lastElement) {
           event.preventDefault();
           firstElement.focus();
killedBy: useModalFocusTrap  tests: should trap focus inside the modal when it is opened
statusReason: expected <button type="button"></button> to be <button type="button"></button> // Object.is equality

[Survived] BlockStatement
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:35:18
 
     modalElement.addEventListener('keydown', handleTabKeyPress);
 
-    return () => {
-      modalElement.removeEventListener('keydown', handleTabKeyPress);
-    };
+    return () => {};
   }, [modalRef, isOpened]);
 };

[Survived] ArrayDeclaration
src/hooks/use-modal-focus-trap/use-modal-focus-trap.ts:38:6
     return () => {
       modalElement.removeEventListener('keydown', handleTabKeyPress);
     };
-  }, [modalRef, isOpened]);
+  }, []);
 };
 
