[Killed] BlockStatement
src/hooks/use-window-dimensions/use-window-dimensions.ts:4:44
 import type { Dimensions } from '@types';
 import { useEffect, useState } from 'react';
 
-function getWindowDimensions(): Dimensions {
-  const { innerWidth: width, innerHeight: height } = globalThis;
-
-  return { width, height };
-}
+function getWindowDimensions(): Dimensions {}
 
 export function useWindowDimensions(): Dimensions {
killedBy: useWindowDimensions should return the correct initial window dimensions
statusReason: Cannot read properties of undefined (reading 'width')

[Killed] BlockStatement
src/hooks/use-window-dimensions/use-window-dimensions.ts:10:51
   return { width, height };
 }
 
-export function useWindowDimensions(): Dimensions {
-  const [windowDimensions, setWindowDimensions] = useState<Dimensions>(getWindowDimensions());
-
-  useEffect(() => {
-    function handleResize() {
-      setWindowDimensions(getWindowDimensions());
-    }
-
-    window.addEventListener('resize', handleResize);
-    return () => window.removeEventListener('resize', handleResize);
-  }, []);
-
-  return windowDimensions;
-}
+export function useWindowDimensions(): Dimensions {}
 
killedBy: useWindowDimensions should return the correct initial window dimensions
statusReason: Cannot read properties of undefined (reading 'width')

[Killed] BlockStatement
src/hooks/use-window-dimensions/use-window-dimensions.ts:13:19
 export function useWindowDimensions(): Dimensions {
   const [windowDimensions, setWindowDimensions] = useState<Dimensions>(getWindowDimensions());
 
-  useEffect(() => {
-    function handleResize() {
-      setWindowDimensions(getWindowDimensions());
-    }
-
-    window.addEventListener('resize', handleResize);
-    return () => window.removeEventListener('resize', handleResize);
-  }, []);
+  useEffect(() => {}, []);
 
   return windowDimensions;
killedBy: useWindowDimensions should update the window dimensions on resize
statusReason: Unable to find an element with the text: Width: 800, Height: 600. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Width: 1024, Height: 768
    </div>

[Killed] BlockStatement
src/hooks/use-window-dimensions/use-window-dimensions.ts:14:29
   const [windowDimensions, setWindowDimensions] = useState<Dimensions>(getWindowDimensions());
 
   useEffect(() => {
-    function handleResize() {
-      setWindowDimensions(getWindowDimensions());
-    }
+    function handleResize() {}
 
     window.addEventListener('resize', handleResize);
killedBy: useWindowDimensions should update the window dimensions on resize
statusReason: Unable to find an element with the text: Width: 800, Height: 600. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Width: 1024, Height: 768
    </div>

[Survived] ArrowFunction
src/hooks/use-window-dimensions/use-window-dimensions.ts:19:12
     }
 
     window.addEventListener('resize', handleResize);
-    return () => window.removeEventListener('resize', handleResize);
+    return () => undefined;
   }, []);
 
