[Killed] BlockStatement
src/utils/get-class-name.ts:9:63
   | undefined
   | null;
 
-export function getClassName(input: ClassNameInput[]): string {
-  const names = input
-    .map((item) => {
-      if (typeof item === 'string') {
-        return item.trim();
-      }
-      if (typeof item === 'object') {
-        const trueKeys = [];
-        for (const key in item) {
-          if (item[key]) {
-            trueKeys.push(key.trim());
-          }
-        }
-
-        return trueKeys.join(' ');
-      }
-      return '';
-    })
-    .filter((item) => !!item);
-
-  return names.join(' ');
-}
+export function getClassName(input: ClassNameInput[]): string {}
 
killedBy: Label should render correctly as required label
statusReason: Snapshot `Label > should render correctly as required label 1` mismatched

[Killed] MethodExpression
src/utils/get-class-name.ts:10:17
   | null;
 
 export function getClassName(input: ClassNameInput[]): string {
-  const names = input
-    .map((item) => {
-      if (typeof item === 'string') {
-        return item.trim();
-      }
-      if (typeof item === 'object') {
-        const trueKeys = [];
-        for (const key in item) {
-          if (item[key]) {
-            trueKeys.push(key.trim());
-          }
-        }
-
-        return trueKeys.join(' ');
-      }
-      return '';
-    })
-    .filter((item) => !!item);
+  const names = input.map(item => {
+  if (typeof item === 'string') {
+    return item.trim();
+  }
+  if (typeof item === 'object') {
+    const trueKeys = [];
+    for (const key in item) {
+      if (item[key]) {
+        trueKeys.push(key.trim());
+      }
+    }
+    return trueKeys.join(' ');
+  }
+  return '';
+});
 
   return names.join(' ');
killedBy: GridHead should match the snapshot
statusReason: Snapshot `GridHead > should match the snapshot 1` mismatched

[Killed] BlockStatement
src/utils/get-class-name.ts:11:20
 
 export function getClassName(input: ClassNameInput[]): string {
   const names = input
-    .map((item) => {
-      if (typeof item === 'string') {
-        return item.trim();
-      }
-      if (typeof item === 'object') {
-        const trueKeys = [];
-        for (const key in item) {
-          if (item[key]) {
-            trueKeys.push(key.trim());
-          }
-        }
-
-        return trueKeys.join(' ');
-      }
-      return '';
-    })
+    .map((item) => {})
     .filter((item) => !!item);
 
killedBy: GridHead should match the snapshot
statusReason: Snapshot `GridHead > should match the snapshot 1` mismatched

[Killed] EqualityOperator
src/utils/get-class-name.ts:12:11
 export function getClassName(input: ClassNameInput[]): string {
   const names = input
     .map((item) => {
-      if (typeof item === 'string') {
+      if (typeof item !== 'string') {
         return item.trim();
       }
killedBy: SelectGridRowCheckbox should match the snapshot
statusReason: item.trim is not a function

[Killed] ConditionalExpression
src/utils/get-class-name.ts:12:11
 export function getClassName(input: ClassNameInput[]): string {
   const names = input
     .map((item) => {
-      if (typeof item === 'string') {
+      if (true) {
         return item.trim();
       }
killedBy: GridHead should match the snapshot
statusReason: item.trim is not a function

[Killed] MethodExpression
src/utils/get-class-name.ts:13:16
   const names = input
     .map((item) => {
       if (typeof item === 'string') {
-        return item.trim();
+        return item;
       }
       if (typeof item === 'object') {
killedBy: getClassName trims the input strings
statusReason: expected '1     2' to be '1 2' // Object.is equality

[Killed] BlockStatement
src/utils/get-class-name.ts:15:37
       if (typeof item === 'string') {
         return item.trim();
       }
-      if (typeof item === 'object') {
-        const trueKeys = [];
-        for (const key in item) {
-          if (item[key]) {
-            trueKeys.push(key.trim());
-          }
-        }
-
-        return trueKeys.join(' ');
-      }
+      if (typeof item === 'object') {}
       return '';
     })
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
src/utils/get-class-name.ts:15:11
       if (typeof item === 'string') {
         return item.trim();
       }
-      if (typeof item === 'object') {
+      if (false) {
         const trueKeys = [];
         for (const key in item) {
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] BlockStatement
src/utils/get-class-name.ts:17:33
       }
       if (typeof item === 'object') {
         const trueKeys = [];
-        for (const key in item) {
-          if (item[key]) {
-            trueKeys.push(key.trim());
-          }
-        }
+        for (const key in item) {}
 
         return trueKeys.join(' ');
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
src/utils/get-class-name.ts:18:15
       if (typeof item === 'object') {
         const trueKeys = [];
         for (const key in item) {
-          if (item[key]) {
+          if (true) {
             trueKeys.push(key.trim());
           }
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] ConditionalExpression
src/utils/get-class-name.ts:18:15
       if (typeof item === 'object') {
         const trueKeys = [];
         for (const key in item) {
-          if (item[key]) {
+          if (false) {
             trueKeys.push(key.trim());
           }
killedBy: Tabs should match the snapshot
statusReason: Snapshot `Tabs > should match the snapshot 1` mismatched

[Killed] MethodExpression
src/utils/get-class-name.ts:19:27
         const trueKeys = [];
         for (const key in item) {
           if (item[key]) {
-            trueKeys.push(key.trim());
+            trueKeys.push(key);
           }
         }
killedBy: getClassName trims the input strings
statusReason: expected 'test1   ' to be 'test1' // Object.is equality

[Killed] BooleanLiteral
src/utils/get-class-name.ts:27:23
       }
       return '';
     })
-    .filter((item) => !!item);
+    .filter((item) => !item);
 
   return names.join(' ');
killedBy: getClassName returns a string for input [string]
statusReason: expected '' to be 'test' // Object.is equality

[Killed] ArrowFunction
src/utils/get-class-name.ts:27:13
       }
       return '';
     })
-    .filter((item) => !!item);
+    .filter(() => undefined);
 
   return names.join(' ');
killedBy: getClassName returns a string for input [string]
statusReason: expected '' to be 'test' // Object.is equality
