[Killed] BlockStatement
src/utils/handle-dropdown-list-key-press.ts:17:33
 }) {
   let focusedId: string = '';
 
-  for (const option of options) {
-    const element = document.getElementById(option.id);
-    if (element === document.activeElement) {
-      focusedId = option.id;
-    }
-  }
+  for (const option of options) {}
 
   const currentFocusIndex = options.findIndex((value) => value.id === focusedId);
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"

[Killed] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:19:9
 
   for (const option of options) {
     const element = document.getElementById(option.id);
-    if (element === document.activeElement) {
+    if (false) {
       focusedId = option.id;
     }
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"

[Killed] BlockStatement
src/utils/handle-dropdown-list-key-press.ts:19:45
 
   for (const option of options) {
     const element = document.getElementById(option.id);
-    if (element === document.activeElement) {
-      focusedId = option.id;
-    }
+    if (element === document.activeElement) {}
   }
 
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"

[Killed] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:24:58
     }
   }
 
-  const currentFocusIndex = options.findIndex((value) => value.id === focusedId);
+  const currentFocusIndex = options.findIndex((value) => false);
 
   switch (e.key) {
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"

[Killed] EqualityOperator
src/utils/handle-dropdown-list-key-press.ts:24:58
     }
   }
 
-  const currentFocusIndex = options.findIndex((value) => value.id === focusedId);
+  const currentFocusIndex = options.findIndex((value) => value.id !== focusedId);
 
   switch (e.key) {
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"

[Killed] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:27:5
   const currentFocusIndex = options.findIndex((value) => value.id === focusedId);
 
   switch (e.key) {
-    case 'Escape':
-      e.preventDefault();
-      onClose();
-      break;
+    case 'Escape':
     case 'ArrowUp': {
       e.preventDefault();
killedBy: handleDropdownListKeyPress closes the dropdown when Escape is pressed
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/utils/handle-dropdown-list-key-press.ts:31:21
       e.preventDefault();
       onClose();
       break;
-    case 'ArrowUp': {
-      e.preventDefault();
-      const previousOptionIndex =
-        currentFocusIndex - 1 >= 0 ? currentFocusIndex - 1 : options.length - 1;
-      const previousValue = options[previousOptionIndex];
-      if (previousValue) moveFocusOnElementById(previousValue.id);
-      break;
-    }
+    case 'ArrowUp': {}
     case 'ArrowDown':
     case 'Tab': {
killedBy: MultiSelect should move focus to the previous option pressing ArrowUp button
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="57b5a856-bc4b-4c2f-8295-9f44434fafc7"
  role="option"

[Killed] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:31:5
       e.preventDefault();
       onClose();
       break;
-    case 'ArrowUp': {
-      e.preventDefault();
-      const previousOptionIndex =
-        currentFocusIndex - 1 >= 0 ? currentFocusIndex - 1 : options.length - 1;
-      const previousValue = options[previousOptionIndex];
-      if (previousValue) moveFocusOnElementById(previousValue.id);
-      break;
-    }
+    case 'ArrowUp':
     case 'ArrowDown':
     case 'Tab': {
killedBy: MultiSelect should move focus to the previous option pressing ArrowUp button
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="57b5a856-bc4b-4c2f-8295-9f44434fafc7"
  role="option"

[Killed] EqualityOperator
src/utils/handle-dropdown-list-key-press.ts:34:9
     case 'ArrowUp': {
       e.preventDefault();
       const previousOptionIndex =
-        currentFocusIndex - 1 >= 0 ? currentFocusIndex - 1 : options.length - 1;
+        currentFocusIndex - 1 > 0 ? currentFocusIndex - 1 : options.length - 1;
       const previousValue = options[previousOptionIndex];
       if (previousValue) moveFocusOnElementById(previousValue.id);
killedBy: handleDropdownListKeyPress focuses on the previous option when ArrowUp is pressed
statusReason: expected 'option-3' to be 'option-1' // Object.is equality

[Killed] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:34:9
     case 'ArrowUp': {
       e.preventDefault();
       const previousOptionIndex =
-        currentFocusIndex - 1 >= 0 ? currentFocusIndex - 1 : options.length - 1;
+        false ? currentFocusIndex - 1 : options.length - 1;
       const previousValue = options[previousOptionIndex];
       if (previousValue) moveFocusOnElementById(previousValue.id);
killedBy: handleDropdownListKeyPress focuses on the previous option when ArrowUp is pressed
statusReason: expected 'option-3' to be 'option-1' // Object.is equality

[Killed] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:36:11
       const previousOptionIndex =
         currentFocusIndex - 1 >= 0 ? currentFocusIndex - 1 : options.length - 1;
       const previousValue = options[previousOptionIndex];
-      if (previousValue) moveFocusOnElementById(previousValue.id);
+      if (false) moveFocusOnElementById(previousValue.id);
       break;
     }
killedBy: MultiSelect should move focus to the previous option pressing ArrowUp button
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="57b5a856-bc4b-4c2f-8295-9f44434fafc7"
  role="option"

[Survived] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:36:11
       const previousOptionIndex =
         currentFocusIndex - 1 >= 0 ? currentFocusIndex - 1 : options.length - 1;
       const previousValue = options[previousOptionIndex];
-      if (previousValue) moveFocusOnElementById(previousValue.id);
+      if (true) moveFocusOnElementById(previousValue.id);
       break;
     }

[Killed] BlockStatement
src/utils/handle-dropdown-list-key-press.ts:40:17
       break;
     }
     case 'ArrowDown':
-    case 'Tab': {
-      e.preventDefault();
-      const nextOptionIndex = currentFocusIndex === options.length - 1 ? 0 : currentFocusIndex + 1;
-      const nextValue = options[nextOptionIndex];
-      if (nextValue) moveFocusOnElementById(nextValue.id);
-      break;
-    }
+    case 'Tab': {}
   }
 }
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="57b5a856-bc4b-4c2f-8295-9f44434fafc7"
  role="option"

[Killed] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:40:5
       break;
     }
     case 'ArrowDown':
-    case 'Tab': {
-      e.preventDefault();
-      const nextOptionIndex = currentFocusIndex === options.length - 1 ? 0 : currentFocusIndex + 1;
-      const nextValue = options[nextOptionIndex];
-      if (nextValue) moveFocusOnElementById(nextValue.id);
-      break;
-    }
+    case 'Tab':
   }
 }
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="57b5a856-bc4b-4c2f-8295-9f44434fafc7"
  role="option"

[Killed] ArithmeticOperator
src/utils/handle-dropdown-list-key-press.ts:42:78
     case 'ArrowDown':
     case 'Tab': {
       e.preventDefault();
-      const nextOptionIndex = currentFocusIndex === options.length - 1 ? 0 : currentFocusIndex + 1;
+      const nextOptionIndex = currentFocusIndex === options.length - 1 ? 0 : currentFocusIndex - 1;
       const nextValue = options[nextOptionIndex];
       if (nextValue) moveFocusOnElementById(nextValue.id);
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"

[Killed] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:42:31
     case 'ArrowDown':
     case 'Tab': {
       e.preventDefault();
-      const nextOptionIndex = currentFocusIndex === options.length - 1 ? 0 : currentFocusIndex + 1;
+      const nextOptionIndex = true ? 0 : currentFocusIndex + 1;
       const nextValue = options[nextOptionIndex];
       if (nextValue) moveFocusOnElementById(nextValue.id);
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"

[Killed] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:44:11
       e.preventDefault();
       const nextOptionIndex = currentFocusIndex === options.length - 1 ? 0 : currentFocusIndex + 1;
       const nextValue = options[nextOptionIndex];
-      if (nextValue) moveFocusOnElementById(nextValue.id);
+      if (false) moveFocusOnElementById(nextValue.id);
       break;
     }
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"

[Survived] ConditionalExpression
src/utils/handle-dropdown-list-key-press.ts:44:11
       e.preventDefault();
       const nextOptionIndex = currentFocusIndex === options.length - 1 ? 0 : currentFocusIndex + 1;
       const nextValue = options[nextOptionIndex];
-      if (nextValue) moveFocusOnElementById(nextValue.id);
+      if (true) moveFocusOnElementById(nextValue.id);
       break;
     }
