[Killed] BlockStatement
components/atoms/editable-text/useInputFocus.ts:8:6
   editMode: boolean,
   autoSelectTextOnEditMode?: boolean,
   readOnly?: boolean,
-) => {
-  useEffect(() => {
-    if (editMode && ref.current && !readOnly) {
-      ref.current.focus();
-      if (autoSelectTextOnEditMode) {
-        ref.current.select();
-      }
-    }
-  }, [editMode, autoSelectTextOnEditMode, readOnly, ref]);
-};
+) => {};
 
killedBy: useInputFocus should focus input when entering edit mode
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
components/atoms/editable-text/useInputFocus.ts:9:19
   autoSelectTextOnEditMode?: boolean,
   readOnly?: boolean,
 ) => {
-  useEffect(() => {
-    if (editMode && ref.current && !readOnly) {
-      ref.current.focus();
-      if (autoSelectTextOnEditMode) {
-        ref.current.select();
-      }
-    }
-  }, [editMode, autoSelectTextOnEditMode, readOnly, ref]);
+  useEffect(() => {}, [editMode, autoSelectTextOnEditMode, readOnly, ref]);
 };
 
killedBy: useInputFocus should focus input when entering edit mode
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
components/atoms/editable-text/useInputFocus.ts:10:36
   readOnly?: boolean,
 ) => {
   useEffect(() => {
-    if (editMode && ref.current && !readOnly) {
+    if (editMode && ref.current && readOnly) {
       ref.current.focus();
       if (autoSelectTextOnEditMode) {
killedBy: useInputFocus should focus input when entering edit mode
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
components/atoms/editable-text/useInputFocus.ts:10:47
   readOnly?: boolean,
 ) => {
   useEffect(() => {
-    if (editMode && ref.current && !readOnly) {
-      ref.current.focus();
-      if (autoSelectTextOnEditMode) {
-        ref.current.select();
-      }
-    }
+    if (editMode && ref.current && !readOnly) {}
   }, [editMode, autoSelectTextOnEditMode, readOnly, ref]);
 };
killedBy: useInputFocus should focus input when entering edit mode
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/atoms/editable-text/useInputFocus.ts:12:11
   useEffect(() => {
     if (editMode && ref.current && !readOnly) {
       ref.current.focus();
-      if (autoSelectTextOnEditMode) {
+      if (false) {
         ref.current.select();
       }
killedBy: useInputFocus should focus and select input when autoSelect is enabled
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/atoms/editable-text/useInputFocus.ts:12:11
   useEffect(() => {
     if (editMode && ref.current && !readOnly) {
       ref.current.focus();
-      if (autoSelectTextOnEditMode) {
+      if (true) {
         ref.current.select();
       }
killedBy: useInputFocus should focus input when entering edit mode
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []
