[Killed] BlockStatement
components/atoms/input/Input.tsx:12:98
 
 type Props = InputHTMLAttributes<HTMLInputElement> & PropsWithChildren;
 
-const Input: ForwardRefRenderFunction<HTMLInputElement, Props> = ({ children, ...rest }, ref) => {
-  return (
-    <div className="cl-input__wrapper">
-      <input {...rest} className="cl-input__field" ref={ref} />
-      {children}
-    </div>
-  );
-};
+const Input: ForwardRefRenderFunction<HTMLInputElement, Props> = ({ children, ...rest }, ref) => {};
 
 export default forwardRef(Input);
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched
