[Killed] BlockStatement
components/hocs/with-figure-caption/with-figure-caption.tsx:10:35
 
 export function withFigureCaption<P extends object>(
   Component: ComponentType<P>,
-): FC<P & WithFigureCaptionProps> {
-  return ({ caption, ...props }: WithFigureCaptionProps) =>
-    caption?.trim()?.length ? (
-      <figure className="cl-figure">
-        <Component {...(props as P)} />
-        <figcaption className="cl-figure__caption">{caption}</figcaption>
-      </figure>
-    ) : (
-      <Component {...(props as P)} />
-    );
-}
+): FC<P & WithFigureCaptionProps> {}
 
killedBy: Image renders normal image initially
statusReason: Element type is invalid: expected a string (for built-in components) or a class/function (for composite components) but got: undefined. You likely forgot to export your component from the file it's defined in, or you might have mixed up default and named imports.

[Killed] ArrowFunction
components/hocs/with-figure-caption/with-figure-caption.tsx:11:10
 export function withFigureCaption<P extends object>(
   Component: ComponentType<P>,
 ): FC<P & WithFigureCaptionProps> {
-  return ({ caption, ...props }: WithFigureCaptionProps) =>
-    caption?.trim()?.length ? (
-      <figure className="cl-figure">
-        <Component {...(props as P)} />
-        <figcaption className="cl-figure__caption">{caption}</figcaption>
-      </figure>
-    ) : (
-      <Component {...(props as P)} />
-    );
+  return () => undefined;
 }
 
killedBy: withFigureCaption wraps component with figure and figcaption when caption is provided
statusReason: Unable to find an accessible element with the role "figure"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] MethodExpression
components/hocs/with-figure-caption/with-figure-caption.tsx:12:5
   Component: ComponentType<P>,
 ): FC<P & WithFigureCaptionProps> {
   return ({ caption, ...props }: WithFigureCaptionProps) =>
-    caption?.trim()?.length ? (
+    caption?.length ? (
       <figure className="cl-figure">
         <Component {...(props as P)} />
killedBy: withFigureCaption handles whitespace-only captions as invalid captions and doest not render them
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <figure
  class="cl-figure"
>
  <img
    alt="Test image"
    data-testid="mock-image"

[Killed] OptionalChaining
components/hocs/with-figure-caption/with-figure-caption.tsx:12:5
   Component: ComponentType<P>,
 ): FC<P & WithFigureCaptionProps> {
   return ({ caption, ...props }: WithFigureCaptionProps) =>
-    caption?.trim()?.length ? (
+    caption.trim()?.length ? (
       <figure className="cl-figure">
         <Component {...(props as P)} />
killedBy: withFigureCaption does not wrap component when caption is undefined
statusReason: Cannot read properties of undefined (reading 'trim')
