[Killed] BlockStatement
components/hocs/with-tooltip/with-tooltip.tsx:11:29
 
 export function withTooltip<P extends object>(
   Component: ComponentType<P>,
-): FC<P & WithTooltipProps> {
-  return ({ tooltip, visibleOn, ...props }: WithTooltipProps) =>
-    tooltip?.length ? (
-      <Tooltip tooltipContent={tooltip} visibleOn={visibleOn}>
-        <Component {...(props as P)} />
-      </Tooltip>
-    ) : (
-      <Component {...(props as P)} />
-    );
-}
+): FC<P & WithTooltipProps> {}
 
killedBy: MultiSelect should take an initial value from the form context
statusReason: Element type is invalid: expected a string (for built-in components) or a class/function (for composite components) but got: undefined. You likely forgot to export your component from the file it's defined in, or you might have mixed up default and named imports.

Check the render method of `Form`.

[Killed] ArrowFunction
components/hocs/with-tooltip/with-tooltip.tsx:12:10
 export function withTooltip<P extends object>(
   Component: ComponentType<P>,
 ): FC<P & WithTooltipProps> {
-  return ({ tooltip, visibleOn, ...props }: WithTooltipProps) =>
-    tooltip?.length ? (
-      <Tooltip tooltipContent={tooltip} visibleOn={visibleOn}>
-        <Component {...(props as P)} />
-      </Tooltip>
-    ) : (
-      <Component {...(props as P)} />
-    );
+  return () => undefined;
 }
 
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] OptionalChaining
components/hocs/with-tooltip/with-tooltip.tsx:13:5
   Component: ComponentType<P>,
 ): FC<P & WithTooltipProps> {
   return ({ tooltip, visibleOn, ...props }: WithTooltipProps) =>
-    tooltip?.length ? (
+    tooltip.length ? (
       <Tooltip tooltipContent={tooltip} visibleOn={visibleOn}>
         <Component {...(props as P)} />
killedBy: Tabs Editable Tabs should allow editing tab titles when editable is true
statusReason: Cannot read properties of undefined (reading 'length')
