[Killed] BlockStatement
components/molecules/accordion/AccordionItem.tsx:7:81
 import type { FC } from 'react';
 import './AccordionItem.css';
 
-export const AccordionItem: FC<AccordionItemProps> = ({ summary, children }) => {
-  return (
-    <details className="cl-accordion-item">
-      <summary className="cl-accordion-item__summary">
-        {summary}
-        <Icon
-          name={IconName.ChevronDown}
-          className="cl-accordion-item__icon"
-          aria-label="Toggle Details"
-          testId="accordion-icon"
-          size={ElementSize.Small}
-        />
-      </summary>
-      <div className="cl-accordion-item__content">{children}</div>
-    </details>
-  );
-};
+export const AccordionItem: FC<AccordionItemProps> = ({ summary, children }) => {};
 
killedBy: AccordionItem renders correctly
statusReason: Snapshot `AccordionItem > renders correctly 1` mismatched
