[Killed] BlockStatement
components/molecules/breadcrumbs/BreadcrumbList.tsx:6:68
 
 import BreadcrumbItem from './BreadcrumbItem';
 
-const BreadcrumbList: FC<{ items: Breadcrumb[] }> = ({ items }) => {
-  return (
-    <ol className="cl-breadcrumbs__list">
-      {items.map((item, index) => (
-        <BreadcrumbItem key={item.label} item={item} isLastItem={index === items.length - 1} />
-      ))}
-    </ol>
-  );
-};
+const BreadcrumbList: FC<{ items: Breadcrumb[] }> = ({ items }) => {};
 
 export default BreadcrumbList;
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] ArrowFunction
components/molecules/breadcrumbs/BreadcrumbList.tsx:9:18
 const BreadcrumbList: FC<{ items: Breadcrumb[] }> = ({ items }) => {
   return (
     <ol className="cl-breadcrumbs__list">
-      {items.map((item, index) => (
-        <BreadcrumbItem key={item.label} item={item} isLastItem={index === items.length - 1} />
-      ))}
+      {items.map(() => undefined)}
     </ol>
   );
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] ConditionalExpression
components/molecules/breadcrumbs/BreadcrumbList.tsx:10:66
   return (
     <ol className="cl-breadcrumbs__list">
       {items.map((item, index) => (
-        <BreadcrumbItem key={item.label} item={item} isLastItem={index === items.length - 1} />
+        <BreadcrumbItem key={item.label} item={item} isLastItem={true} />
       ))}
     </ol>
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched

[Killed] ArithmeticOperator
components/molecules/breadcrumbs/BreadcrumbList.tsx:10:76
   return (
     <ol className="cl-breadcrumbs__list">
       {items.map((item, index) => (
-        <BreadcrumbItem key={item.label} item={item} isLastItem={index === items.length - 1} />
+        <BreadcrumbItem key={item.label} item={item} isLastItem={index === items.length + 1} />
       ))}
     </ol>
killedBy: Breadcrumbs matches the snapshot
statusReason: Snapshot `Breadcrumbs > matches the snapshot 1` mismatched
