[Killed] BlockStatement
components/molecules/checkbox/Checkbox.helpers.ts:11:13
   defaultChecked?: boolean;
   initialValues?: FormValues;
   name: string;
-}): boolean {
-  if (initialValues?.[name] !== undefined) {
-    return !!initialValues?.[name];
-  }
-
-  return Boolean(defaultChecked);
-}
+}): boolean {}
 
killedBy: Form should render initial values
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  id="_r_3_"
  name="accepted"
  type="checkbox"
/>

[Killed] ConditionalExpression
components/molecules/checkbox/Checkbox.helpers.ts:12:7
   initialValues?: FormValues;
   name: string;
 }): boolean {
-  if (initialValues?.[name] !== undefined) {
+  if (true) {
     return !!initialValues?.[name];
   }
killedBy: Checkbox could be checked by default
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  id="test-checkbox-id"
  name="checkbox"
  type="checkbox"
/>

[Killed] ConditionalExpression
components/molecules/checkbox/Checkbox.helpers.ts:12:7
   initialValues?: FormValues;
   name: string;
 }): boolean {
-  if (initialValues?.[name] !== undefined) {
+  if (false) {
     return !!initialValues?.[name];
   }
killedBy: Checkbox should take an initial value from the form context
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  id="test-checkbox-id"
  name="checkbox"
  type="checkbox"
/>

[Killed] BooleanLiteral
components/molecules/checkbox/Checkbox.helpers.ts:13:12
   name: string;
 }): boolean {
   if (initialValues?.[name] !== undefined) {
-    return !!initialValues?.[name];
+    return !initialValues?.[name];
   }
 
killedBy: Checkbox should take an initial value from the form context
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  id="test-checkbox-id"
  name="checkbox"
  type="checkbox"
/>
