[Killed] BlockStatement
components/molecules/checkbox/Checkbox.tsx:12:48
  * Renders either a stateful or stateless component
  * based on the `stateless` prop.
  */
-const Checkbox: FC<CheckboxProps> = (props) => {
-  if (props.stateless) {
-    return <CheckboxStateless {...props} />;
-  }
-
-  return <CheckboxStateful {...props} />;
-};
+const Checkbox: FC<CheckboxProps> = (props) => {};
 
 export default Checkbox;
killedBy: Form should render initial values
statusReason: Unable to find an accessible element with the role "checkbox"

Here are the accessible roles:

  textbox:

  Name "First Name":
  <input

[Killed] BlockStatement
components/molecules/checkbox/Checkbox.tsx:13:24
  * based on the `stateless` prop.
  */
 const Checkbox: FC<CheckboxProps> = (props) => {
-  if (props.stateless) {
-    return <CheckboxStateless {...props} />;
-  }
+  if (props.stateless) {}
 
   return <CheckboxStateful {...props} />;
killedBy: Checkbox Stateless mode should use stateless checked prop when stateless is true
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  id="test-checkbox-id"
  name="checkbox"
  type="checkbox"
/>

[Killed] ConditionalExpression
components/molecules/checkbox/Checkbox.tsx:13:7
  * based on the `stateless` prop.
  */
 const Checkbox: FC<CheckboxProps> = (props) => {
-  if (props.stateless) {
+  if (false) {
     return <CheckboxStateless {...props} />;
   }
killedBy: Checkbox Stateless mode should use stateless checked prop when stateless is true
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  id="test-checkbox-id"
  name="checkbox"
  type="checkbox"
/>
