[Killed] BlockStatement
components/molecules/numeric-input/NumericInput.tsx:12:56
  * Renders either a stateful or stateless component
  * based on the `stateless` prop.
  */
-const NumericInput: FC<NumericInputProps> = (props) => {
-  if (props.stateless) {
-    return <NumericInputStateless {...props} />;
-  }
-
-  return <NumericInputStateful {...props} />;
-};
+const NumericInput: FC<NumericInputProps> = (props) => {};
 
 export default NumericInput;
killedBy: Form should render initial values
statusReason: Unable to find an accessible element with the role "spinbutton"

Here are the accessible roles:

  textbox:

  Name "First Name":
  <input

[Killed] BlockStatement
components/molecules/numeric-input/NumericInput.tsx:13:24
  * based on the `stateless` prop.
  */
 const NumericInput: FC<NumericInputProps> = (props) => {
-  if (props.stateless) {
-    return <NumericInputStateless {...props} />;
-  }
+  if (props.stateless) {}
 
   return <NumericInputStateful {...props} />;
killedBy: NumericInput Stateless mode should use stateless value when stateless prop is true
statusReason: expect(element).toHaveValue(42)

Expected the element to have value:
  42
Received:
  0

[Killed] ConditionalExpression
components/molecules/numeric-input/NumericInput.tsx:13:7
  * based on the `stateless` prop.
  */
 const NumericInput: FC<NumericInputProps> = (props) => {
-  if (props.stateless) {
+  if (false) {
     return <NumericInputStateless {...props} />;
   }
killedBy: NumericInput Stateless mode should use stateless value when stateless prop is true
statusReason: expect(element).toHaveValue(42)

Expected the element to have value:
  42
Received:
  0
