[Killed] OptionalChaining
components/molecules/switch/Switch.helpers.ts:12:7
   initialValues?: FormValues;
   name: string;
 }): boolean {
-  if (initialValues?.[name] !== undefined) {
+  if (initialValues[name] !== undefined) {
     return !!initialValues?.[name];
   }
killedBy: Switch renders the switch with correct label
statusReason: Cannot read properties of undefined (reading 'test-switch')
