[Killed] BlockStatement
components/molecules/text-input/TextInput.tsx:12:50
  * Renders either a stateful or stateless component
  * based on the `stateless` prop.
  */
-const TextInput: FC<TextInputProps> = (props) => {
-  if (props.stateless) {
-    return <TextInputStateless {...props} />;
-  }
-
-  return <TextInputStateful {...props} />;
-};
+const TextInput: FC<TextInputProps> = (props) => {};
 
 export default TextInput;
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] ConditionalExpression
components/molecules/text-input/TextInput.tsx:13:7
  * based on the `stateless` prop.
  */
 const TextInput: FC<TextInputProps> = (props) => {
-  if (props.stateless) {
+  if (true) {
     return <TextInputStateless {...props} />;
   }
killedBy: TextInput should render the input correctly
statusReason: Snapshot `TextInput > should render the input correctly 1` mismatched

[Killed] BlockStatement
components/molecules/text-input/TextInput.tsx:13:24
  * based on the `stateless` prop.
  */
 const TextInput: FC<TextInputProps> = (props) => {
-  if (props.stateless) {
-    return <TextInputStateless {...props} />;
-  }
+  if (props.stateless) {}
 
   return <TextInputStateful {...props} />;
killedBy: TextInput Stateless mode should use stateless value when stateless prop is true
statusReason: expect(element).toHaveValue(hello)

Expected the element to have value:
  hello
Received:
