[Killed] BlockStatement
components/organisms/form/Form.helpers.ts:3:83
 import type { FormInputParams, FormValidationState, FormValues } from '@types';
 
-export function getInitialValidationState(data?: FormValues): FormValidationState {
-  if (!data) return [];
-
-  return Object.keys(data).map((key) => [key, true]);
-}
+export function getInitialValidationState(data?: FormValues): FormValidationState {}
 
 export function updateValidationState(
killedBy: Checkbox should take an initial value from the form context
statusReason: Cannot read properties of undefined (reading 'every')

[Killed] BooleanLiteral
components/organisms/form/Form.helpers.ts:4:7
 import type { FormInputParams, FormValidationState, FormValues } from '@types';
 
 export function getInitialValidationState(data?: FormValues): FormValidationState {
-  if (!data) return [];
+  if (data) return [];
 
   return Object.keys(data).map((key) => [key, true]);
killedBy: Form should not render Reset button is hasReset props is false
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
components/organisms/form/Form.helpers.ts:4:7
 import type { FormInputParams, FormValidationState, FormValues } from '@types';
 
 export function getInitialValidationState(data?: FormValues): FormValidationState {
-  if (!data) return [];
+  if (false) return [];
 
   return Object.keys(data).map((key) => [key, true]);
killedBy: getInitialValidationState should return an empty array when no data is provided
statusReason: Cannot convert undefined or null to object

[Killed] ArrowFunction
components/organisms/form/Form.helpers.ts:6:32
 export function getInitialValidationState(data?: FormValues): FormValidationState {
   if (!data) return [];
 
-  return Object.keys(data).map((key) => [key, true]);
+  return Object.keys(data).map(() => undefined);
 }
 
killedBy: getInitialValidationState should return a validation state where all values are set to true
statusReason: expected [ undefined, undefined ] to deeply equal [ [ 'field1', true ], …(1) ]

[Killed] BooleanLiteral
components/organisms/form/Form.helpers.ts:6:47
 export function getInitialValidationState(data?: FormValues): FormValidationState {
   if (!data) return [];
 
-  return Object.keys(data).map((key) => [key, true]);
+  return Object.keys(data).map((key) => [key, false]);
 }
 
killedBy: getInitialValidationState should return a validation state where all values are set to true
statusReason: expected [ [ 'field1', false ], …(1) ] to deeply equal [ [ 'field1', true ], …(1) ]

[Killed] BlockStatement
components/organisms/form/Form.helpers.ts:12:24
 export function updateValidationState(
   state: FormValidationState,
   params: FormInputParams,
-): FormValidationState {
-  if (params?.valid === undefined) return state;
-
-  return state.map((item) => {
-    if (item[0] !== params.name) return item;
-    return [item[0], !!params?.valid];
-  });
-}
+): FormValidationState {}
 
 export function isFormDataValid(state: FormValidationState): boolean {
killedBy: updateValidationState should update the validation state when a valid parameter is passed
statusReason: expected undefined to deeply equal [ [ 'field1', false ], …(1) ]

[Killed] ConditionalExpression
components/organisms/form/Form.helpers.ts:13:7
   state: FormValidationState,
   params: FormInputParams,
 ): FormValidationState {
-  if (params?.valid === undefined) return state;
+  if (false) return state;
 
   return state.map((item) => {
killedBy: updateValidationState should return the original state if valid parameter is undefined
statusReason: expected [ [ 'field1', false ], …(1) ] to deeply equal [ [ 'field1', true ], …(1) ]

[Killed] EqualityOperator
components/organisms/form/Form.helpers.ts:13:7
   state: FormValidationState,
   params: FormInputParams,
 ): FormValidationState {
-  if (params?.valid === undefined) return state;
+  if (params?.valid !== undefined) return state;
 
   return state.map((item) => {
killedBy: updateValidationState should update the validation state when a valid parameter is passed
statusReason: expected [ [ 'field1', true ], …(1) ] to deeply equal [ [ 'field1', false ], …(1) ]

[Killed] BlockStatement
components/organisms/form/Form.helpers.ts:15:30
 ): FormValidationState {
   if (params?.valid === undefined) return state;
 
-  return state.map((item) => {
-    if (item[0] !== params.name) return item;
-    return [item[0], !!params?.valid];
-  });
+  return state.map((item) => {});
 }
 
killedBy: Form should reset entered values to initial values
statusReason: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
components/organisms/form/Form.helpers.ts:16:9
   if (params?.valid === undefined) return state;
 
   return state.map((item) => {
-    if (item[0] !== params.name) return item;
+    if (false) return item;
     return [item[0], !!params?.valid];
   });
killedBy: updateValidationState should update the validation state when a valid parameter is passed
statusReason: expected [ [ 'field1', false ], …(1) ] to deeply equal [ [ 'field1', false ], …(1) ]

[Killed] ConditionalExpression
components/organisms/form/Form.helpers.ts:16:9
   if (params?.valid === undefined) return state;
 
   return state.map((item) => {
-    if (item[0] !== params.name) return item;
+    if (true) return item;
     return [item[0], !!params?.valid];
   });
killedBy: updateValidationState should update the validation state when a valid parameter is passed
statusReason: expected [ [ 'field1', true ], …(1) ] to deeply equal [ [ 'field1', false ], …(1) ]

[Killed] BooleanLiteral
components/organisms/form/Form.helpers.ts:17:23
 
   return state.map((item) => {
     if (item[0] !== params.name) return item;
-    return [item[0], !!params?.valid];
+    return [item[0], !params?.valid];
   });
 }
killedBy: updateValidationState should update the validation state when a valid parameter is passed
statusReason: expected [ [ 'field1', true ], …(1) ] to deeply equal [ [ 'field1', false ], …(1) ]

[Killed] BlockStatement
components/organisms/form/Form.helpers.ts:21:70
   });
 }
 
-export function isFormDataValid(state: FormValidationState): boolean {
-  return state.every((item) => item[1]);
-}
+export function isFormDataValid(state: FormValidationState): boolean {}
 
killedBy: Form should call onSubmit handler
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ArrowFunction
components/organisms/form/Form.helpers.ts:22:22
 }
 
 export function isFormDataValid(state: FormValidationState): boolean {
-  return state.every((item) => item[1]);
+  return state.every(() => undefined);
 }
 
killedBy: isFormDataValid should return true if all validation states are true
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
components/organisms/form/Form.helpers.ts:22:10
 }
 
 export function isFormDataValid(state: FormValidationState): boolean {
-  return state.every((item) => item[1]);
+  return state.some(item => item[1]);
 }
 
killedBy: Form should call onSubmit handler
statusReason: expected "vi.fn()" to be called once, but got 0 times
