[Killed] BlockStatement
organisms/grid/data-cell/GridDataCell.tsx:3:82
 import type { FC, ReactElement } from 'react';
 
-export const GridDataCell: FC<{ value: ReactElement | string }> = ({ value }) => {
-  return <td>{value}</td>;
-};
+export const GridDataCell: FC<{ value: ReactElement | string }> = ({ value }) => {};
 
killedBy: Grid should match the snapshot
statusReason: Snapshot `Grid > should match the snapshot 1` mismatched
