[Killed] BlockStatement
src/hooks/use-debounce/use-debounce.ts:3:63
 import { useEffect, useState } from 'react';
 
-export const useDebounce = <T>(value: T, delay: number): T => {
-  const [debouncedValue, setDebouncedValue] = useState<T>(value);
-
-  useEffect(() => {
-    const handler = setTimeout(() => {
-      setDebouncedValue(value);
-    }, delay);
-
-    return () => {
-      clearTimeout(handler);
-    };
-  }, [value, delay]);
-
-  return debouncedValue;
-};
+export const useDebounce = <T>(value: T, delay: number): T => {};
 
killedBy: useSearchController initial state should initialize with empty search value
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] BlockStatement
src/hooks/use-debounce/use-debounce.ts:6:19
 export const useDebounce = <T>(value: T, delay: number): T => {
   const [debouncedValue, setDebouncedValue] = useState<T>(value);
 
-  useEffect(() => {
-    const handler = setTimeout(() => {
-      setDebouncedValue(value);
-    }, delay);
-
-    return () => {
-      clearTimeout(handler);
-    };
-  }, [value, delay]);
+  useEffect(() => {}, [value, delay]);
 
   return debouncedValue;
killedBy: useSearchController automatic search with debounce should trigger onSearch after debounce delay in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test search' ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/use-debounce/use-debounce.ts:7:38
   const [debouncedValue, setDebouncedValue] = useState<T>(value);
 
   useEffect(() => {
-    const handler = setTimeout(() => {
-      setDebouncedValue(value);
-    }, delay);
+    const handler = setTimeout(() => {}, delay);
 
     return () => {
killedBy: useSearchController automatic search with debounce should trigger onSearch after debounce delay in automatic mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'test search' ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/use-debounce/use-debounce.ts:11:18
       setDebouncedValue(value);
     }, delay);
 
-    return () => {
-      clearTimeout(handler);
-    };
+    return () => {};
   }, [value, delay]);
 
killedBy: useSearchController automatic search with debounce should cancel previous debounce when value changes
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "first",
