[Killed] BlockStatement
src/hooks/use-is-mounted/use-is-mounted.ts:3:82
 import { useEffect, useState } from 'react';
 
-export const useIsMounted = (isOpened: boolean, delay: number = 300): boolean => {
-  const [isMounted, setIsMounted] = useState(false);
-
-  useEffect(() => {
-    let timeoutId: NodeJS.Timeout;
-
-    if (isOpened) {
-      setIsMounted(true);
-    } else {
-      timeoutId = setTimeout(() => {
-        setIsMounted(false);
-      }, delay);
-    }
-
-    return () => {
-      if (timeoutId) {
-        clearTimeout(timeoutId);
-      }
-    };
-  }, [isOpened, delay]);
-
-  return isMounted;
-};
+export const useIsMounted = (isOpened: boolean, delay: number = 300): boolean => {};
 
killedBy: Alert should render the alert when opened
statusReason: Unable to find an element with the text: This is a test message.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/hooks/use-is-mounted/use-is-mounted.ts:4:46
 import { useEffect, useState } from 'react';
 
 export const useIsMounted = (isOpened: boolean, delay: number = 300): boolean => {
-  const [isMounted, setIsMounted] = useState(false);
+  const [isMounted, setIsMounted] = useState(true);
 
   useEffect(() => {
killedBy: Alert should render nothing when not opened
statusReason: expected <p class="cl-alert__message"></p> to be null

[Killed] BlockStatement
src/hooks/use-is-mounted/use-is-mounted.ts:6:19
 export const useIsMounted = (isOpened: boolean, delay: number = 300): boolean => {
   const [isMounted, setIsMounted] = useState(false);
 
-  useEffect(() => {
-    let timeoutId: NodeJS.Timeout;
-
-    if (isOpened) {
-      setIsMounted(true);
-    } else {
-      timeoutId = setTimeout(() => {
-        setIsMounted(false);
-      }, delay);
-    }
-
-    return () => {
-      if (timeoutId) {
-        clearTimeout(timeoutId);
-      }
-    };
-  }, [isOpened, delay]);
+  useEffect(() => {}, [isOpened, delay]);
 
   return isMounted;
killedBy: Alert should render the alert when opened
statusReason: Unable to find an element with the text: This is a test message.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/hooks/use-is-mounted/use-is-mounted.ts:9:9
   useEffect(() => {
     let timeoutId: NodeJS.Timeout;
 
-    if (isOpened) {
+    if (true) {
       setIsMounted(true);
     } else {
killedBy: Alert should render nothing when not opened
statusReason: expected <p class="cl-alert__message"></p> to be null

[Killed] BlockStatement
src/hooks/use-is-mounted/use-is-mounted.ts:9:19
   useEffect(() => {
     let timeoutId: NodeJS.Timeout;
 
-    if (isOpened) {
-      setIsMounted(true);
-    } else {
+    if (isOpened) {} else {
       timeoutId = setTimeout(() => {
         setIsMounted(false);
killedBy: Alert should render the alert when opened
statusReason: Unable to find an element with the text: This is a test message.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/hooks/use-is-mounted/use-is-mounted.ts:10:20
     let timeoutId: NodeJS.Timeout;
 
     if (isOpened) {
-      setIsMounted(true);
+      setIsMounted(false);
     } else {
       timeoutId = setTimeout(() => {
killedBy: Alert should render the alert when opened
statusReason: Unable to find an element with the text: This is a test message.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/hooks/use-is-mounted/use-is-mounted.ts:11:12
 
     if (isOpened) {
       setIsMounted(true);
-    } else {
-      timeoutId = setTimeout(() => {
-        setIsMounted(false);
-      }, delay);
-    }
+    } else {}
 
     return () => {
killedBy: useMount test: should set isMounted to false after the delay when isOpened is false
statusReason: expected 'Mounted' to be 'Not Mounted' // Object.is equality

[Killed] BlockStatement
src/hooks/use-is-mounted/use-is-mounted.ts:12:36
     if (isOpened) {
       setIsMounted(true);
     } else {
-      timeoutId = setTimeout(() => {
-        setIsMounted(false);
-      }, delay);
+      timeoutId = setTimeout(() => {}, delay);
     }
 
killedBy: useMount test: should set isMounted to false after the delay when isOpened is false
statusReason: expected 'Mounted' to be 'Not Mounted' // Object.is equality

[Killed] BooleanLiteral
src/hooks/use-is-mounted/use-is-mounted.ts:13:22
       setIsMounted(true);
     } else {
       timeoutId = setTimeout(() => {
-        setIsMounted(false);
+        setIsMounted(true);
       }, delay);
     }
killedBy: useMount test: should set isMounted to false after the delay when isOpened is false
statusReason: expected 'Mounted' to be 'Not Mounted' // Object.is equality

[Survived] BlockStatement
src/hooks/use-is-mounted/use-is-mounted.ts:17:18
       }, delay);
     }
 
-    return () => {
-      if (timeoutId) {
-        clearTimeout(timeoutId);
-      }
-    };
+    return () => {};
   }, [isOpened, delay]);
 

[Survived] ConditionalExpression
src/hooks/use-is-mounted/use-is-mounted.ts:18:11
     }
 
     return () => {
-      if (timeoutId) {
+      if (false) {
         clearTimeout(timeoutId);
       }

[Survived] ConditionalExpression
src/hooks/use-is-mounted/use-is-mounted.ts:18:11
     }
 
     return () => {
-      if (timeoutId) {
+      if (true) {
         clearTimeout(timeoutId);
       }
