[Killed] BlockStatement
src/hooks/use-reset-form-input/use-reset-form-input.ts:4:59
 import { FormContext } from '@components/contexts';
 import { useContext, useEffect } from 'react';
 
-export const useResetFormInput = (onReset: () => void) => {
-  const { resetSignal } = useContext(FormContext);
-
-  useEffect(() => {
-    if (resetSignal) {
-      onReset();
-    }
-  }, [resetSignal, onReset]);
-};
+export const useResetFormInput = (onReset: () => void) => {};
 
killedBy: Form should reset entered values to initial values
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Killed] BlockStatement
src/hooks/use-reset-form-input/use-reset-form-input.ts:7:19
 export const useResetFormInput = (onReset: () => void) => {
   const { resetSignal } = useContext(FormContext);
 
-  useEffect(() => {
-    if (resetSignal) {
-      onReset();
-    }
-  }, [resetSignal, onReset]);
+  useEffect(() => {}, [resetSignal, onReset]);
 };
 
killedBy: Form should reset entered values to initial values
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Killed] ConditionalExpression
src/hooks/use-reset-form-input/use-reset-form-input.ts:8:9
   const { resetSignal } = useContext(FormContext);
 
   useEffect(() => {
-    if (resetSignal) {
+    if (false) {
       onReset();
     }
killedBy: Form should reset entered values to initial values
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Killed] BlockStatement
src/hooks/use-reset-form-input/use-reset-form-input.ts:8:22
   const { resetSignal } = useContext(FormContext);
 
   useEffect(() => {
-    if (resetSignal) {
-      onReset();
-    }
+    if (resetSignal) {}
   }, [resetSignal, onReset]);
 };
killedBy: Form should reset entered values to initial values
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Killed] ArrayDeclaration
src/hooks/use-reset-form-input/use-reset-form-input.ts:11:6
     if (resetSignal) {
       onReset();
     }
-  }, [resetSignal, onReset]);
+  }, []);
 };
 
killedBy: Form should reset entered values to initial values
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1
