[Killed] BlockStatement
src/utils/move-focus-on-element-by-id.ts:1:52
-export function moveFocusOnElementById(id: string) {
-  const element = document.getElementById(id);
-
-  if (element) element.focus();
-}
+export function moveFocusOnElementById(id: string) {}
 
killedBy: MultiSelect should move the focus correctly on Tab press
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <li
  aria-selected="false"
  class="cl-select-option cl-select-option_multi"
  id="583e8b60-0177-4e38-a423-4b1d5d0a2236"
  role="option"

[Killed] ConditionalExpression
src/utils/move-focus-on-element-by-id.ts:4:7
 export function moveFocusOnElementById(id: string) {
   const element = document.getElementById(id);
 
-  if (element) element.focus();
+  if (false) element.focus();
 }
 
killedBy: moveFocusOnElementById should focus the element with the provided ID
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/utils/move-focus-on-element-by-id.ts:4:7
 export function moveFocusOnElementById(id: string) {
   const element = document.getElementById(id);
 
-  if (element) element.focus();
+  if (true) element.focus();
 }
 
killedBy: moveFocusOnElementById should not throw if element is not found
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown
