[Killed] ArrowFunction
components/atoms/image/FallBackImage.tsx:5:34
 import { IconName } from '@enums';
 import type { FC } from 'react';
 
-export const FallbackImage: FC = () => (
-  <div className="cl-image__fallback">
-    <Icon name={IconName.Image} className="cl-image__fallback-icon" />
-    <span className="cl-image__fallback-text">Image not available</span>
-  </div>
-);
+export const FallbackImage: FC = () => undefined;
 
killedBy: Image shows fallback when basic image fails to load
statusReason: Unable to find an element by: [data-testid="fallback-icon"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
