[Killed] ArrowFunction
src/hooks/use-theme/use-theme.ts:4:25
 import { ThemeContext } from '@components/contexts';
 import { useContext } from 'react';
 
-export const useTheme = () => useContext(ThemeContext);
+export const useTheme = () => undefined;
 
killedBy: useTheme should return the current theme mode
statusReason: Cannot destructure property 'mode' of '(0 , __vite_ssr_import_6__.useTheme)(...)' as it is undefined.
