[Killed] BlockStatement
src/hooks/use-form-pending/use-form-pending.ts:4:46
 import { FormContext } from '@components/contexts';
 import { useContext } from 'react';
 
-export const useFormPending = (): boolean => {
-  const { isPending } = useContext(FormContext);
-  return isPending ?? false;
-};
+export const useFormPending = (): boolean => {};
 
killedBy: useFormPending should return false when no FormContext provider exists
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/hooks/use-form-pending/use-form-pending.ts:6:10
 
 export const useFormPending = (): boolean => {
   const { isPending } = useContext(FormContext);
-  return isPending ?? false;
+  return isPending && false;
 };
 
killedBy: useFormPending should return true when FormContext provides isPending as true
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/hooks/use-form-pending/use-form-pending.ts:6:23
 
 export const useFormPending = (): boolean => {
   const { isPending } = useContext(FormContext);
-  return isPending ?? false;
+  return isPending ?? true;
 };
 
