[Survived] BooleanLiteral
components/organisms/form/Form.controller.ts:37:20
 
 export function useFormController<TActionState = void>({
   initialValues,
-  resetOnSuccess = false,
+  resetOnSuccess = true,
   onReset,
   action,

[Killed] BooleanLiteral
components/organisms/form/Form.controller.ts:47:62
   const [formData, setFormData] = useState(initialValues);
   const [validationState, setValidationState] = useState(getInitialValidationState(initialValues));
   const [resetSignal, setResetSignal] = useState(0);
-  const [controlledPending, setControlledPending] = useState(false);
+  const [controlledPending, setControlledPending] = useState(true);
 
   const handleInputChange = (params: FormInputParams) => {
killedBy: Form controlled flow (onSubmit) should call onSubmit with FormValues when submitted
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
components/organisms/form/Form.controller.ts:55:42
     setValidationState(updateValidationState(validationState, params));
   };
 
-  const triggerReset = useCallback(() => {
-    setFormData(initialValues);
-    setResetSignal((prev) => prev + 1);
-    setValidationState(getInitialValidationState(initialValues));
-  }, [initialValues]);
+  const triggerReset = useCallback(() => {}, [initialValues]);
 
   const handleReset = (event: SubmitEvent<HTMLFormElement>) => {
killedBy: Form controlled flow (onSubmit) should reset form after successful submit when resetOnSuccess is true
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Alice

Ignored nodes: comments, script, style

[Killed] ArrowFunction
components/organisms/form/Form.controller.ts:57:20
 
   const triggerReset = useCallback(() => {
     setFormData(initialValues);
-    setResetSignal((prev) => prev + 1);
+    setResetSignal(() => undefined);
     setValidationState(getInitialValidationState(initialValues));
   }, [initialValues]);
killedBy: Form controlled flow (onSubmit) should reset form after successful submit when resetOnSuccess is true
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Alice

Ignored nodes: comments, script, style

[Killed] ArithmeticOperator
components/organisms/form/Form.controller.ts:57:30
 
   const triggerReset = useCallback(() => {
     setFormData(initialValues);
-    setResetSignal((prev) => prev + 1);
+    setResetSignal((prev) => prev - 1);
     setValidationState(getInitialValidationState(initialValues));
   }, [initialValues]);
killedBy: useFormController controlled flow (onSubmit) should reset form data and increment resetSignal when resetOnSuccess is true
statusReason: expected -1 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ArrayDeclaration
components/organisms/form/Form.controller.ts:59:6
     setFormData(initialValues);
     setResetSignal((prev) => prev + 1);
     setValidationState(getInitialValidationState(initialValues));
-  }, [initialValues]);
+  }, []);
 
   const handleReset = (event: SubmitEvent<HTMLFormElement>) => {

[Killed] BlockStatement
components/organisms/form/Form.controller.ts:61:64
     setValidationState(getInitialValidationState(initialValues));
   }, [initialValues]);
 
-  const handleReset = (event: SubmitEvent<HTMLFormElement>) => {
-    onReset?.(event);
-    triggerReset();
-  };
+  const handleReset = (event: SubmitEvent<HTMLFormElement>) => {};
 
   const valid = isFormDataValid(validationState);
killedBy: Form shared behavior should reset entered values to initial values on manual reset
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Killed] OptionalChaining
components/organisms/form/Form.controller.ts:62:5
   }, [initialValues]);
 
   const handleReset = (event: SubmitEvent<HTMLFormElement>) => {
-    onReset?.(event);
+    onReset(event);
     triggerReset();
   };
killedBy: Form shared behavior should reset entered values to initial values on manual reset
statusReason: expect(element).toHaveValue(John)

Expected the element to have value:
  John
Received:
  Johntest1

[Killed] BlockStatement
components/organisms/form/Form.controller.ts:70:69
 
   // Action flow using useActionState
   const [, dispatch, actionPending] = useActionState(
-    async (prevState: Awaited<TActionState>, formData: FormData) => {
-      if (!action) return prevState;
-      const result = await action(prevState as TActionState, formData);
-      onActionComplete?.(result);
-      if (resetOnSuccess) triggerReset();
-      return result as Awaited<TActionState>;
-    },
+    async (prevState: Awaited<TActionState>, formData: FormData) => {},
     actionInitialState as Awaited<TActionState>,
   );
killedBy: Form action flow integration should submit form data via action when action prop is used
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
components/organisms/form/Form.controller.ts:71:11
   // Action flow using useActionState
   const [, dispatch, actionPending] = useActionState(
     async (prevState: Awaited<TActionState>, formData: FormData) => {
-      if (!action) return prevState;
+      if (true) return prevState;
       const result = await action(prevState as TActionState, formData);
       onActionComplete?.(result);
killedBy: Form action flow integration should submit form data via action when action prop is used
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] BooleanLiteral
components/organisms/form/Form.controller.ts:71:11
   // Action flow using useActionState
   const [, dispatch, actionPending] = useActionState(
     async (prevState: Awaited<TActionState>, formData: FormData) => {
-      if (!action) return prevState;
+      if (action) return prevState;
       const result = await action(prevState as TActionState, formData);
       onActionComplete?.(result);
killedBy: Form action flow integration should submit form data via action when action prop is used
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] OptionalChaining
components/organisms/form/Form.controller.ts:73:7
     async (prevState: Awaited<TActionState>, formData: FormData) => {
       if (!action) return prevState;
       const result = await action(prevState as TActionState, formData);
-      onActionComplete?.(result);
+      onActionComplete(result);
       if (resetOnSuccess) triggerReset();
       return result as Awaited<TActionState>;
killedBy: useFormController action flow should trigger reset after successful action when resetOnSuccess is true
statusReason: onActionComplete is not a function

[Killed] ConditionalExpression
components/organisms/form/Form.controller.ts:74:11
       if (!action) return prevState;
       const result = await action(prevState as TActionState, formData);
       onActionComplete?.(result);
-      if (resetOnSuccess) triggerReset();
+      if (false) triggerReset();
       return result as Awaited<TActionState>;
     },
killedBy: useFormController action flow should trigger reset after successful action when resetOnSuccess is true
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
components/organisms/form/Form.controller.ts:74:11
       if (!action) return prevState;
       const result = await action(prevState as TActionState, formData);
       onActionComplete?.(result);
-      if (resetOnSuccess) triggerReset();
+      if (true) triggerReset();
       return result as Awaited<TActionState>;
     },
killedBy: useFormController action flow should not trigger reset after action when resetOnSuccess is false
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
components/organisms/form/Form.controller.ts:81:71
   );
 
   // Controlled flow
-  const handleSubmit = async (event: SubmitEvent<HTMLFormElement>) => {
-    event.preventDefault();
-    if (!valid || !onSubmit) return;
-
-    const uncontrolledData = Object.fromEntries(new FormData(event.target as HTMLFormElement));
-    const resultData = { ...uncontrolledData, ...formData };
-
-    setControlledPending(true);
-    try {
-      await onSubmit(resultData);
-      if (resetOnSuccess) triggerReset();
-    } finally {
-      setControlledPending(false);
-    }
-  };
+  const handleSubmit = async (event: SubmitEvent<HTMLFormElement>) => {};
 
   if (action) {
killedBy: useFormController controlled flow (onSubmit) should set isPending to true during async onSubmit and false after
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/organisms/form/Form.controller.ts:83:9
   // Controlled flow
   const handleSubmit = async (event: SubmitEvent<HTMLFormElement>) => {
     event.preventDefault();
-    if (!valid || !onSubmit) return;
+    if (false) return;
 
     const uncontrolledData = Object.fromEntries(new FormData(event.target as HTMLFormElement));
killedBy: useFormController controlled flow (onSubmit) should not call onSubmit when valid is false
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] BooleanLiteral
components/organisms/form/Form.controller.ts:83:9
   // Controlled flow
   const handleSubmit = async (event: SubmitEvent<HTMLFormElement>) => {
     event.preventDefault();
-    if (!valid || !onSubmit) return;
+    if (valid || !onSubmit) return;
 
     const uncontrolledData = Object.fromEntries(new FormData(event.target as HTMLFormElement));
killedBy: useFormController controlled flow (onSubmit) should set isPending to true during async onSubmit and false after
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
components/organisms/form/Form.controller.ts:88:26
     const uncontrolledData = Object.fromEntries(new FormData(event.target as HTMLFormElement));
     const resultData = { ...uncontrolledData, ...formData };
 
-    setControlledPending(true);
+    setControlledPending(false);
     try {
       await onSubmit(resultData);
killedBy: useFormController controlled flow (onSubmit) should set isPending to true during async onSubmit and false after
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
components/organisms/form/Form.controller.ts:89:9
     const resultData = { ...uncontrolledData, ...formData };
 
     setControlledPending(true);
-    try {
-      await onSubmit(resultData);
-      if (resetOnSuccess) triggerReset();
-    } finally {
+    try {} finally {
       setControlledPending(false);
     }
killedBy: useFormController controlled flow (onSubmit) should set isPending to true during async onSubmit and false after
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/organisms/form/Form.controller.ts:91:11
     setControlledPending(true);
     try {
       await onSubmit(resultData);
-      if (resetOnSuccess) triggerReset();
+      if (true) triggerReset();
     } finally {
       setControlledPending(false);
killedBy: useFormController controlled flow edge cases should not reset on success when resetOnSuccess is false and submit succeeds
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
components/organisms/form/Form.controller.ts:91:11
     setControlledPending(true);
     try {
       await onSubmit(resultData);
-      if (resetOnSuccess) triggerReset();
+      if (false) triggerReset();
     } finally {
       setControlledPending(false);
killedBy: useFormController controlled flow (onSubmit) should reset form data and increment resetSignal when resetOnSuccess is true
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
components/organisms/form/Form.controller.ts:92:15
     try {
       await onSubmit(resultData);
       if (resetOnSuccess) triggerReset();
-    } finally {
-      setControlledPending(false);
-    }
+    } finally {}
   };
 
killedBy: useFormController controlled flow (onSubmit) should set isPending to true during async onSubmit and false after
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
components/organisms/form/Form.controller.ts:93:28
       await onSubmit(resultData);
       if (resetOnSuccess) triggerReset();
     } finally {
-      setControlledPending(false);
+      setControlledPending(true);
     }
   };
killedBy: useFormController controlled flow (onSubmit) should set isPending to true during async onSubmit and false after
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
components/organisms/form/Form.controller.ts:97:7
     }
   };
 
-  if (action) {
+  if (true) {
     return {
       handleInputChange,
killedBy: useFormController controlled flow (onSubmit) should set isPending to true during async onSubmit and false after
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/organisms/form/Form.controller.ts:97:7
     }
   };
 
-  if (action) {
+  if (false) {
     return {
       handleInputChange,
killedBy: useFormController action flow should return formAction when action prop is provided
statusReason: expected undefined to be defined
