[Killed] BlockStatement
components/organisms/gallery/Gallery.helpers.ts:3:91
 import type { GalleryItem, ImageProps, ImageSource } from '@types';
 
-export const getLargestImageSource = (sources: ImageSource[]): ImageSource | undefined => {
-  if (sources.length === 0) {
-    return undefined;
-  }
-
-  let largestSource: ImageSource | undefined;
-  let largestWidth = 0;
-
-  for (const source of sources) {
-    const descriptor = source.descriptor?.trim();
-
-    if (descriptor?.endsWith('w')) {
-      const widthStr = descriptor.slice(0, -1);
-      const width = Number.parseInt(widthStr, 10);
-
-      if (!Number.isNaN(width) && width > largestWidth) {
-        largestWidth = width;
-        largestSource = source;
-      }
-    }
-  }
-
-  return largestSource ?? sources.at(-1);
-};
+export const getLargestImageSource = (sources: ImageSource[]): ImageSource | undefined => {};
 
 export const getFullscreenImageProps = (image: GalleryItem): Omit<ImageProps, 'caption'> => {
killedBy: FullscreenViewer image rendering uses largest source for fullscreen display when sources provided
statusReason: expect(element).toHaveAttribute("src", "/large.jpg") // element.getAttribute("src") === "/large.jpg"

Expected the element to have attribute:
  src="/large.jpg"
Received:
  src="/fallback.jpg"

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
components/organisms/gallery/Gallery.helpers.ts:4:7
 import type { GalleryItem, ImageProps, ImageSource } from '@types';
 
 export const getLargestImageSource = (sources: ImageSource[]): ImageSource | undefined => {
-  if (sources.length === 0) {
+  if (true) {
     return undefined;
   }
killedBy: FullscreenViewer image rendering uses largest source for fullscreen display when sources provided
statusReason: expect(element).toHaveAttribute("src", "/large.jpg") // element.getAttribute("src") === "/large.jpg"

Expected the element to have attribute:
  src="/large.jpg"
Received:
  src="/fallback.jpg"

Ignored nodes: comments, script, style

[Killed] EqualityOperator
components/organisms/gallery/Gallery.helpers.ts:4:7
 import type { GalleryItem, ImageProps, ImageSource } from '@types';
 
 export const getLargestImageSource = (sources: ImageSource[]): ImageSource | undefined => {
-  if (sources.length === 0) {
+  if (sources.length !== 0) {
     return undefined;
   }
killedBy: FullscreenViewer image rendering uses largest source for fullscreen display when sources provided
statusReason: expect(element).toHaveAttribute("src", "/large.jpg") // element.getAttribute("src") === "/large.jpg"

Expected the element to have attribute:
  src="/large.jpg"
Received:
  src="/fallback.jpg"

Ignored nodes: comments, script, style

[Killed] BlockStatement
components/organisms/gallery/Gallery.helpers.ts:11:33
   let largestSource: ImageSource | undefined;
   let largestWidth = 0;
 
-  for (const source of sources) {
-    const descriptor = source.descriptor?.trim();
-
-    if (descriptor?.endsWith('w')) {
-      const widthStr = descriptor.slice(0, -1);
-      const width = Number.parseInt(widthStr, 10);
-
-      if (!Number.isNaN(width) && width > largestWidth) {
-        largestWidth = width;
-        largestSource = source;
-      }
-    }
-  }
+  for (const source of sources) {}
 
   return largestSource ?? sources.at(-1);
killedBy: Gallery.helpers getLargestImageSource returns the source with the largest width descriptor
statusReason: expected { src: '/medium.jpg', …(1) } to deeply equal { src: '/large.jpg', …(1) }

[Killed] OptionalChaining
components/organisms/gallery/Gallery.helpers.ts:12:24
   let largestWidth = 0;
 
   for (const source of sources) {
-    const descriptor = source.descriptor?.trim();
+    const descriptor = source.descriptor.trim();
 
     if (descriptor?.endsWith('w')) {
killedBy: Gallery.helpers getLargestImageSource returns the last source when no width descriptors are present
statusReason: Cannot read properties of undefined (reading 'trim')

[Survived] MethodExpression
components/organisms/gallery/Gallery.helpers.ts:12:24
   let largestWidth = 0;
 
   for (const source of sources) {
-    const descriptor = source.descriptor?.trim();
+    const descriptor = source.descriptor;
 
     if (descriptor?.endsWith('w')) {

[Killed] ConditionalExpression
components/organisms/gallery/Gallery.helpers.ts:14:9
   for (const source of sources) {
     const descriptor = source.descriptor?.trim();
 
-    if (descriptor?.endsWith('w')) {
+    if (false) {
       const widthStr = descriptor.slice(0, -1);
       const width = Number.parseInt(widthStr, 10);
killedBy: Gallery.helpers getLargestImageSource returns the source with the largest width descriptor
statusReason: expected { src: '/medium.jpg', …(1) } to deeply equal { src: '/large.jpg', …(1) }

[Killed] ConditionalExpression
components/organisms/gallery/Gallery.helpers.ts:14:9
   for (const source of sources) {
     const descriptor = source.descriptor?.trim();
 
-    if (descriptor?.endsWith('w')) {
+    if (true) {
       const widthStr = descriptor.slice(0, -1);
       const width = Number.parseInt(widthStr, 10);
killedBy: Gallery.helpers getLargestImageSource returns the last source when no width descriptors are present
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] UnaryOperator
components/organisms/gallery/Gallery.helpers.ts:15:44
     const descriptor = source.descriptor?.trim();
 
     if (descriptor?.endsWith('w')) {
-      const widthStr = descriptor.slice(0, -1);
+      const widthStr = descriptor.slice(0, +1);
       const width = Number.parseInt(widthStr, 10);
 
killedBy: FullscreenViewer image rendering uses largest source for fullscreen display when sources provided
statusReason: expect(element).toHaveAttribute("src", "/large.jpg") // element.getAttribute("src") === "/large.jpg"

Expected the element to have attribute:
  src="/large.jpg"
Received:
  src="/small.jpg"

Ignored nodes: comments, script, style

[Survived] MethodExpression
components/organisms/gallery/Gallery.helpers.ts:15:24
     const descriptor = source.descriptor?.trim();
 
     if (descriptor?.endsWith('w')) {
-      const widthStr = descriptor.slice(0, -1);
+      const widthStr = descriptor;
       const width = Number.parseInt(widthStr, 10);
 

[Killed] EqualityOperator
components/organisms/gallery/Gallery.helpers.ts:18:35
       const widthStr = descriptor.slice(0, -1);
       const width = Number.parseInt(widthStr, 10);
 
-      if (!Number.isNaN(width) && width > largestWidth) {
+      if (!Number.isNaN(width) && width <= largestWidth) {
         largestWidth = width;
         largestSource = source;
killedBy: Gallery.helpers getLargestImageSource returns the source with the largest width descriptor
statusReason: expected { src: '/medium.jpg', …(1) } to deeply equal { src: '/large.jpg', …(1) }

[Killed] ConditionalExpression
components/organisms/gallery/Gallery.helpers.ts:18:11
       const widthStr = descriptor.slice(0, -1);
       const width = Number.parseInt(widthStr, 10);
 
-      if (!Number.isNaN(width) && width > largestWidth) {
+      if (false) {
         largestWidth = width;
         largestSource = source;
killedBy: Gallery.helpers getLargestImageSource returns the source with the largest width descriptor
statusReason: expected { src: '/medium.jpg', …(1) } to deeply equal { src: '/large.jpg', …(1) }

[Killed] LogicalOperator
components/organisms/gallery/Gallery.helpers.ts:25:10
     }
   }
 
-  return largestSource ?? sources.at(-1);
+  return largestSource && sources.at(-1);
 };
 
killedBy: Gallery.helpers getLargestImageSource returns the source with the largest width descriptor
statusReason: expected { src: '/medium.jpg', …(1) } to deeply equal { src: '/large.jpg', …(1) }

[Killed] UnaryOperator
components/organisms/gallery/Gallery.helpers.ts:25:38
     }
   }
 
-  return largestSource ?? sources.at(-1);
+  return largestSource ?? sources.at(+1);
 };
 
killedBy: Gallery.helpers getLargestImageSource returns the last source when no width descriptors are present
statusReason: expected { src: '/second.jpg' } to deeply equal { src: '/last.jpg' }

[Killed] BlockStatement
components/organisms/gallery/Gallery.helpers.ts:28:93
   return largestSource ?? sources.at(-1);
 };
 
-export const getFullscreenImageProps = (image: GalleryItem): Omit<ImageProps, 'caption'> => {
-  const { caption: _caption, sources, ...restImageProps } = image;
-
-  if (sources && sources.length > 0) {
-    const largestSource = getLargestImageSource(sources);
-    if (largestSource) {
-      return {
-        ...restImageProps,
-        src: largestSource.src,
-        // Clear sources to render as a simple image with the largest resolution
-        sources: undefined,
-      };
-    }
-  }
-
-  return { ...restImageProps, sources };
-};
+export const getFullscreenImageProps = (image: GalleryItem): Omit<ImageProps, 'caption'> => {};
 
killedBy: Gallery.helpers getFullscreenImageProps returns image props with largest source when sources are provided
statusReason: expected undefined to deeply equal { src: '/large.jpg', …(2) }

[Killed] EqualityOperator
components/organisms/gallery/Gallery.helpers.ts:31:18
 export const getFullscreenImageProps = (image: GalleryItem): Omit<ImageProps, 'caption'> => {
   const { caption: _caption, sources, ...restImageProps } = image;
 
-  if (sources && sources.length > 0) {
+  if (sources && sources.length <= 0) {
     const largestSource = getLargestImageSource(sources);
     if (largestSource) {
killedBy: FullscreenViewer image rendering uses largest source for fullscreen display when sources provided
statusReason: expect(element).toHaveAttribute("src", "/large.jpg") // element.getAttribute("src") === "/large.jpg"

Expected the element to have attribute:
  src="/large.jpg"
Received:
  src="/fallback.jpg"

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
components/organisms/gallery/Gallery.helpers.ts:31:7
 export const getFullscreenImageProps = (image: GalleryItem): Omit<ImageProps, 'caption'> => {
   const { caption: _caption, sources, ...restImageProps } = image;
 
-  if (sources && sources.length > 0) {
+  if (false) {
     const largestSource = getLargestImageSource(sources);
     if (largestSource) {
killedBy: Gallery.helpers getFullscreenImageProps returns image props with largest source when sources are provided
statusReason: expected { src: '/fallback.jpg', …(2) } to deeply equal { src: '/large.jpg', …(2) }

[Killed] ConditionalExpression
components/organisms/gallery/Gallery.helpers.ts:33:9
 
   if (sources && sources.length > 0) {
     const largestSource = getLargestImageSource(sources);
-    if (largestSource) {
+    if (false) {
       return {
         ...restImageProps,
killedBy: FullscreenViewer image rendering uses largest source for fullscreen display when sources provided
statusReason: expect(element).toHaveAttribute("src", "/large.jpg") // element.getAttribute("src") === "/large.jpg"

Expected the element to have attribute:
  src="/large.jpg"
Received:
  src="/fallback.jpg"

Ignored nodes: comments, script, style

[Killed] BlockStatement
components/organisms/gallery/Gallery.helpers.ts:33:24
 
   if (sources && sources.length > 0) {
     const largestSource = getLargestImageSource(sources);
-    if (largestSource) {
-      return {
-        ...restImageProps,
-        src: largestSource.src,
-        // Clear sources to render as a simple image with the largest resolution
-        sources: undefined,
-      };
-    }
+    if (largestSource) {}
   }
 
killedBy: FullscreenViewer image rendering uses largest source for fullscreen display when sources provided
statusReason: expect(element).toHaveAttribute("src", "/large.jpg") // element.getAttribute("src") === "/large.jpg"

Expected the element to have attribute:
  src="/large.jpg"
Received:
  src="/fallback.jpg"

Ignored nodes: comments, script, style
