[Killed] BooleanLiteral
organisms/gallery/hooks/use-carousel-scroll.ts:15:44
   containerRef: RefObject<HTMLDivElement | null>,
   layout: GalleryMode,
 ): CarouselScrollState => {
-  const [showPrev, setShowPrev] = useState(false);
+  const [showPrev, setShowPrev] = useState(true);
   const [showNext, setShowNext] = useState(false);
 
killedBy: useCarouselScroll carousel layout — initial visibility hides both buttons when ref is null
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
organisms/gallery/hooks/use-carousel-scroll.ts:16:44
   layout: GalleryMode,
 ): CarouselScrollState => {
   const [showPrev, setShowPrev] = useState(false);
-  const [showNext, setShowNext] = useState(false);
+  const [showNext, setShowNext] = useState(true);
 
   const updateButtonVisibility = useCallback(() => {
killedBy: useCarouselScroll carousel layout — initial visibility hides both buttons when ref is null
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
organisms/gallery/hooks/use-carousel-scroll.ts:18:52
   const [showPrev, setShowPrev] = useState(false);
   const [showNext, setShowNext] = useState(false);
 
-  const updateButtonVisibility = useCallback(() => {
-    const container = containerRef.current;
-    if (!container) return;
-
-    const { scrollLeft, scrollWidth, clientWidth } = container;
-
-    if (scrollWidth <= clientWidth) {
-      setShowPrev(false);
-      setShowNext(false);
-      return;
-    }
-
-    setShowPrev(scrollLeft > 1);
-    setShowNext(scrollLeft < scrollWidth - clientWidth - 1);
-  }, [containerRef]);
+  const updateButtonVisibility = useCallback(() => {}, [containerRef]);
 
   useEffect(() => {
killedBy: useCarouselScroll non-carousel layout resets buttons when switching from carousel to grid
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
organisms/gallery/hooks/use-carousel-scroll.ts:20:9
 
   const updateButtonVisibility = useCallback(() => {
     const container = containerRef.current;
-    if (!container) return;
+    if (container) return;
 
     const { scrollLeft, scrollWidth, clientWidth } = container;
killedBy: useCarouselScroll non-carousel layout resets buttons when switching from carousel to grid
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
organisms/gallery/hooks/use-carousel-scroll.ts:20:9
 
   const updateButtonVisibility = useCallback(() => {
     const container = containerRef.current;
-    if (!container) return;
+    if (true) return;
 
     const { scrollLeft, scrollWidth, clientWidth } = container;
killedBy: useCarouselScroll non-carousel layout resets buttons when switching from carousel to grid
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
organisms/gallery/hooks/use-carousel-scroll.ts:24:9
 
     const { scrollLeft, scrollWidth, clientWidth } = container;
 
-    if (scrollWidth <= clientWidth) {
+    if (true) {
       setShowPrev(false);
       setShowNext(false);
killedBy: useCarouselScroll non-carousel layout resets buttons when switching from carousel to grid
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
organisms/gallery/hooks/use-carousel-scroll.ts:24:9
 
     const { scrollLeft, scrollWidth, clientWidth } = container;
 
-    if (scrollWidth <= clientWidth) {
+    if (scrollWidth > clientWidth) {
       setShowPrev(false);
       setShowNext(false);
killedBy: useCarouselScroll non-carousel layout resets buttons when switching from carousel to grid
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
organisms/gallery/hooks/use-carousel-scroll.ts:25:19
     const { scrollLeft, scrollWidth, clientWidth } = container;
 
     if (scrollWidth <= clientWidth) {
-      setShowPrev(false);
+      setShowPrev(true);
       setShowNext(false);
       return;
killedBy: useCarouselScroll carousel layout — initial visibility hides both buttons when content is not scrollable
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
organisms/gallery/hooks/use-carousel-scroll.ts:26:19
 
     if (scrollWidth <= clientWidth) {
       setShowPrev(false);
-      setShowNext(false);
+      setShowNext(true);
       return;
     }
killedBy: useCarouselScroll carousel layout — initial visibility hides both buttons when content is not scrollable
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
organisms/gallery/hooks/use-carousel-scroll.ts:30:17
       return;
     }
 
-    setShowPrev(scrollLeft > 1);
+    setShowPrev(true);
     setShowNext(scrollLeft < scrollWidth - clientWidth - 1);
   }, [containerRef]);
killedBy: useCarouselScroll carousel layout — initial visibility shows only Next button when at the start of scrollable content
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
organisms/gallery/hooks/use-carousel-scroll.ts:30:17
       return;
     }
 
-    setShowPrev(scrollLeft > 1);
+    setShowPrev(false);
     setShowNext(scrollLeft < scrollWidth - clientWidth - 1);
   }, [containerRef]);
killedBy: useCarouselScroll carousel layout — initial visibility shows only Prev button when scrolled to the end
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
organisms/gallery/hooks/use-carousel-scroll.ts:31:17
     }
 
     setShowPrev(scrollLeft > 1);
-    setShowNext(scrollLeft < scrollWidth - clientWidth - 1);
+    setShowNext(false);
   }, [containerRef]);
 
killedBy: useCarouselScroll non-carousel layout resets buttons when switching from carousel to grid
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
organisms/gallery/hooks/use-carousel-scroll.ts:31:17
     }
 
     setShowPrev(scrollLeft > 1);
-    setShowNext(scrollLeft < scrollWidth - clientWidth - 1);
+    setShowNext(scrollLeft >= scrollWidth - clientWidth - 1);
   }, [containerRef]);
 
killedBy: useCarouselScroll non-carousel layout resets buttons when switching from carousel to grid
statusReason: expected false to be true // Object.is equality

[Survived] ArrayDeclaration
organisms/gallery/hooks/use-carousel-scroll.ts:32:6
 
     setShowPrev(scrollLeft > 1);
     setShowNext(scrollLeft < scrollWidth - clientWidth - 1);
-  }, [containerRef]);
+  }, []);
 
   useEffect(() => {

[Killed] BlockStatement
organisms/gallery/hooks/use-carousel-scroll.ts:34:19
     setShowNext(scrollLeft < scrollWidth - clientWidth - 1);
   }, [containerRef]);
 
-  useEffect(() => {
-    if (layout !== 'carousel') {
-      setShowPrev(false);
-      setShowNext(false);
-      return;
-    }
-
-    const container = containerRef.current;
-    if (!container) return;
-
-    updateButtonVisibility();
-
-    const resizeObserver = new ResizeObserver(updateButtonVisibility);
-    resizeObserver.observe(container);
-
-    container.addEventListener('scroll', updateButtonVisibility);
-
-    return () => {
-      container.removeEventListener('scroll', updateButtonVisibility);
-      resizeObserver.disconnect();
-    };
-  }, [layout, containerRef, updateButtonVisibility]);
+  useEffect(() => {}, [layout, containerRef, updateButtonVisibility]);
 
   const scrollForward = useCallback(() => {
killedBy: useCarouselScroll non-carousel layout resets buttons when switching from carousel to grid
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
organisms/gallery/hooks/use-carousel-scroll.ts:35:32
   }, [containerRef]);
 
   useEffect(() => {
-    if (layout !== 'carousel') {
-      setShowPrev(false);
-      setShowNext(false);
-      return;
-    }
+    if (layout !== 'carousel') {}
 
     const container = containerRef.current;
killedBy: useCarouselScroll non-carousel layout returns showPrev=false and showNext=false for grid layout
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
organisms/gallery/hooks/use-carousel-scroll.ts:35:9
   }, [containerRef]);
 
   useEffect(() => {
-    if (layout !== 'carousel') {
+    if (false) {
       setShowPrev(false);
       setShowNext(false);
killedBy: useCarouselScroll non-carousel layout returns showPrev=false and showNext=false for grid layout
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
organisms/gallery/hooks/use-carousel-scroll.ts:36:19
 
   useEffect(() => {
     if (layout !== 'carousel') {
-      setShowPrev(false);
+      setShowPrev(true);
       setShowNext(false);
       return;
killedBy: useCarouselScroll non-carousel layout returns showPrev=false and showNext=false for grid layout
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
organisms/gallery/hooks/use-carousel-scroll.ts:42:9
     }
 
     const container = containerRef.current;
-    if (!container) return;
+    if (false) return;
 
     updateButtonVisibility();
killedBy: useCarouselScroll carousel layout — initial visibility hides both buttons when ref is null
statusReason: Cannot read properties of null (reading 'addEventListener')

[Killed] BlockStatement
organisms/gallery/hooks/use-carousel-scroll.ts:51:18
 
     container.addEventListener('scroll', updateButtonVisibility);
 
-    return () => {
-      container.removeEventListener('scroll', updateButtonVisibility);
-      resizeObserver.disconnect();
-    };
+    return () => {};
   }, [layout, containerRef, updateButtonVisibility]);
 
killedBy: useCarouselScroll carousel layout — ResizeObserver integration disconnects ResizeObserver on unmount
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
organisms/gallery/hooks/use-carousel-scroll.ts:57:43
     };
   }, [layout, containerRef, updateButtonVisibility]);
 
-  const scrollForward = useCallback(() => {
-    const container = containerRef.current;
-    if (!container) return;
-
-    container.scrollBy({ left: container.clientWidth, behavior: 'smooth' });
-  }, [containerRef]);
+  const scrollForward = useCallback(() => {}, [containerRef]);
 
   const scrollBackward = useCallback(() => {
killedBy: useCarouselScroll scrollForward and scrollBackward scrollForward calls scrollBy with positive clientWidth
statusReason: expected "vi.fn()" to be called with arguments: [ { left: 300, behavior: 'smooth' } ]

Number of calls: 0

[Killed] BlockStatement
organisms/gallery/hooks/use-carousel-scroll.ts:64:44
     container.scrollBy({ left: container.clientWidth, behavior: 'smooth' });
   }, [containerRef]);
 
-  const scrollBackward = useCallback(() => {
-    const container = containerRef.current;
-    if (!container) return;
-
-    container.scrollBy({ left: -container.clientWidth, behavior: 'smooth' });
-  }, [containerRef]);
+  const scrollBackward = useCallback(() => {}, [containerRef]);
 
   return { showPrev, showNext, scrollForward, scrollBackward };
killedBy: useCarouselScroll scrollForward and scrollBackward scrollBackward calls scrollBy with negative clientWidth
statusReason: expected "vi.fn()" to be called with arguments: [ { left: -300, behavior: 'smooth' } ]

Number of calls: 0

[Killed] UnaryOperator
organisms/gallery/hooks/use-carousel-scroll.ts:68:32
     const container = containerRef.current;
     if (!container) return;
 
-    container.scrollBy({ left: -container.clientWidth, behavior: 'smooth' });
+    container.scrollBy({ left: +container.clientWidth, behavior: 'smooth' });
   }, [containerRef]);
 
killedBy: useCarouselScroll scrollForward and scrollBackward scrollBackward calls scrollBy with negative clientWidth
statusReason: expected "vi.fn()" to be called with arguments: [ { left: -300, behavior: 'smooth' } ]

Received:

  1st vi.fn() call:

  [
    {
