[Killed] BooleanLiteral
organisms/gallery/hooks/use-fullscreen-viewer.ts:13:52
 }
 
 export const useFullscreenViewer = (): FullscreenViewerState => {
-  const [isViewerOpen, setIsViewerOpen] = useState(false);
+  const [isViewerOpen, setIsViewerOpen] = useState(true);
   const [currentImageIndex, setCurrentImageIndex] = useState(0);
   const triggerRef = useRef<HTMLElement | null>(null);
killedBy: Gallery fullscreen mode enabled does not open viewer with other keys
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-fullscreen-viewer"
  data-testid="fullscreen-image-viewer"
>
  <button
    aria-label="Close fullscreen view"

[Killed] BlockStatement
organisms/gallery/hooks/use-fullscreen-viewer.ts:17:75
   const [currentImageIndex, setCurrentImageIndex] = useState(0);
   const triggerRef = useRef<HTMLElement | null>(null);
 
-  const openViewer = useCallback((index: number, element: HTMLElement) => {
-    triggerRef.current = element;
-    setCurrentImageIndex(index);
-    setIsViewerOpen(true);
-  }, []);
+  const openViewer = useCallback((index: number, element: HTMLElement) => {}, []);
 
   const closeViewer = useCallback(() => {
killedBy: Gallery fullscreen mode enabled opens fullscreen viewer when clicking an image
statusReason: Unable to find an element by: [data-testid="fullscreen-image-viewer"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      aria-label="Image gallery"
      class="cl-gallery"

[Killed] BooleanLiteral
organisms/gallery/hooks/use-fullscreen-viewer.ts:20:21
   const openViewer = useCallback((index: number, element: HTMLElement) => {
     triggerRef.current = element;
     setCurrentImageIndex(index);
-    setIsViewerOpen(true);
+    setIsViewerOpen(false);
   }, []);
 
killedBy: Gallery fullscreen mode enabled opens fullscreen viewer when clicking an image
statusReason: Unable to find an element by: [data-testid="fullscreen-image-viewer"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      aria-label="Image gallery"
      class="cl-gallery"

[Killed] BlockStatement
organisms/gallery/hooks/use-fullscreen-viewer.ts:23:41
     setIsViewerOpen(true);
   }, []);
 
-  const closeViewer = useCallback(() => {
-    setIsViewerOpen(false);
-    setTimeout(() => {
-      triggerRef.current?.focus();
-      triggerRef.current = null;
-    }, 300);
-  }, []);
+  const closeViewer = useCallback(() => {}, []);
 
   const handleNavigate = useCallback((index: number) => {
killedBy: Gallery fullscreen mode enabled closes viewer and restores focus
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-fullscreen-viewer"
  data-testid="fullscreen-image-viewer"
>
  <button
    aria-label="Close fullscreen view"

[Killed] BooleanLiteral
organisms/gallery/hooks/use-fullscreen-viewer.ts:24:21
   }, []);
 
   const closeViewer = useCallback(() => {
-    setIsViewerOpen(false);
+    setIsViewerOpen(true);
     setTimeout(() => {
       triggerRef.current?.focus();
killedBy: Gallery fullscreen mode enabled closes viewer and restores focus
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="cl-fullscreen-viewer"
  data-testid="fullscreen-image-viewer"
>
  <button
    aria-label="Close fullscreen view"

[Survived] BlockStatement
organisms/gallery/hooks/use-fullscreen-viewer.ts:25:22
 
   const closeViewer = useCallback(() => {
     setIsViewerOpen(false);
-    setTimeout(() => {
-      triggerRef.current?.focus();
-      triggerRef.current = null;
-    }, 300);
+    setTimeout(() => {}, 300);
   }, []);
 

[Survived] OptionalChaining
organisms/gallery/hooks/use-fullscreen-viewer.ts:26:7
   const closeViewer = useCallback(() => {
     setIsViewerOpen(false);
     setTimeout(() => {
-      triggerRef.current?.focus();
+      triggerRef.current.focus();
       triggerRef.current = null;
     }, 300);

[Killed] BlockStatement
organisms/gallery/hooks/use-fullscreen-viewer.ts:31:57
     }, 300);
   }, []);
 
-  const handleNavigate = useCallback((index: number) => {
-    setCurrentImageIndex(index);
-  }, []);
+  const handleNavigate = useCallback((index: number) => {}, []);
 
   return {
killedBy: Gallery navigation in fullscreen mode updates current index when navigating
statusReason: Unable to find an element with the text: 2 / 3. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      aria-label="Image gallery"
      class="cl-gallery"

[Survived] ArrayDeclaration
organisms/gallery/hooks/use-fullscreen-viewer.ts:33:6
 
   const handleNavigate = useCallback((index: number) => {
     setCurrentImageIndex(index);
-  }, []);
+  }, ["Stryker was here"]);
 
   return {
