[Killed] BlockStatement
src/hooks/use-tooltip-position/use-tooltip-position.ts:29:34
       return;
     }
 
-    const updatePosition = () => {
-      const rect = wrapperRef.current?.getBoundingClientRect();
-      if (!rect) return;
-
-      let top = Math.round(rect.bottom + spacing);
-      // Center the tooltip horizontally under the wrapper
-      let left = Math.round(rect.left + rect.width / 2 - tooltipWidth / 2);
-
-      // Adjust position if tooltip goes beyond the viewport
-      if (top + tooltipHeight > window.innerHeight) {
-        top = Math.round(rect.top - tooltipHeight - spacing);
-      }
-      if (left + tooltipWidth > window.innerWidth) {
-        left = Math.round(window.innerWidth - tooltipWidth - spacing);
-      }
-      if (left < 0) {
-        left = spacing;
-      }
-
-      setPosition({ top, left });
-    };
+    const updatePosition = () => {};
 
     // Initial position calculation
killedBy: useTooltipPosition should center tooltip horizontally under the wrapper
statusReason: expected +0 to be 150 // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:31:11
 
     const updatePosition = () => {
       const rect = wrapperRef.current?.getBoundingClientRect();
-      if (!rect) return;
+      if (false) return;
 
       let top = Math.round(rect.bottom + spacing);
killedBy: useTooltipPosition should handle getBoundingClientRect returning null
statusReason: Cannot read properties of null (reading 'bottom')

[Killed] ArithmeticOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:35:29
 
       let top = Math.round(rect.bottom + spacing);
       // Center the tooltip horizontally under the wrapper
-      let left = Math.round(rect.left + rect.width / 2 - tooltipWidth / 2);
+      let left = Math.round(rect.left + rect.width / 2 + tooltipWidth / 2);
 
       // Adjust position if tooltip goes beyond the viewport
killedBy: useTooltipPosition should center tooltip horizontally under the wrapper
statusReason: expected 250 to be 150 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:35:58
 
       let top = Math.round(rect.bottom + spacing);
       // Center the tooltip horizontally under the wrapper
-      let left = Math.round(rect.left + rect.width / 2 - tooltipWidth / 2);
+      let left = Math.round(rect.left + rect.width / 2 - tooltipWidth * 2);
 
       // Adjust position if tooltip goes beyond the viewport
killedBy: useTooltipPosition should center tooltip horizontally under the wrapper
statusReason: expected +0 to be 150 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/use-tooltip-position/use-tooltip-position.ts:38:11
       let left = Math.round(rect.left + rect.width / 2 - tooltipWidth / 2);
 
       // Adjust position if tooltip goes beyond the viewport
-      if (top + tooltipHeight > window.innerHeight) {
+      if (top - tooltipHeight > window.innerHeight) {
         top = Math.round(rect.top - tooltipHeight - spacing);
       }
killedBy: useTooltipPosition should position tooltip above wrapper when bottom space unavailable
statusReason: expected 558 to be 442 // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-tooltip-position/use-tooltip-position.ts:44:11
       if (left + tooltipWidth > window.innerWidth) {
         left = Math.round(window.innerWidth - tooltipWidth - spacing);
       }
-      if (left < 0) {
+      if (false) {
         left = spacing;
       }
killedBy: useTooltipPosition should adjust left when tooltip overflows left edge
statusReason: expected -30 to be 4 // Object.is equality
