[Killed] ConditionalExpression
src/hooks/use-remaining-timer/use-remaining-timer.ts:24:9
   const animationFrameRef = useRef<number>(0);
 
   useEffect(() => {
-    if (!autoClose) return;
+    if (false) return;
 
     if (!isOpened) {
killedBy: useRemainingTimer autoClose Flag Behavior does not decrement when autoClose is false
statusReason: expected 50.4 to be 100 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/use-remaining-timer/use-remaining-timer.ts:48:44
       const elapsed = Date.now() - startTimeRef.current;
       elapsedTimeRef.current = elapsed;
 
-      const percentage = Math.max(0, 100 - (elapsed / autoCloseDelay) * 100);
+      const percentage = Math.max(0, 100 - elapsed / autoCloseDelay / 100);
       setRemainingPercentage(percentage);
 
killedBy: useRemainingTimer (open/close, cleanup, deps, edge) Open/Close Behavior resets timer when closed
statusReason: expected 99.99504 to be less than 60
